[Killed] EqualityOperator
src/cli.ts:88:6
 
 function arg(flag: string, argv: string[]): string | undefined {
 	const i = argv.indexOf(flag);
-	if (i === -1) return undefined;
+	if (i !== -1) return undefined;
 	return argv[i + 1];
 }
killedBy: test/cli.test.ts
statusReason: start writes a run and echoes its id: start writes a run and echoes its id

[Killed] ConditionalExpression
src/cli.ts:98:9
 
 function num(flag: string, argv: string[]): number | undefined {
 	const v = arg(flag, argv);
-	return v === undefined ? undefined : Number(v);
+	return true ? undefined : Number(v);
 }
 
killedBy: test/cli.test.ts
statusReason: enter and exit round-trip a phase with its fields: enter and exit round-trip a phase with its fields

[Survived] BlockStatement
src/cli.ts:102:34
 }
 
 /** Token counts are only ever read at a glance; six significant digits are noise. */
-function mtok(n: number): string {
-	if (n >= 1e6) return `${(n / 1e6).toFixed(1)}M`.padStart(6);
-	if (n >= 1e3) return `${(n / 1e3).toFixed(0)}k`.padStart(6);
-	return String(n).padStart(6);
-}
+function mtok(n: number): string {}
 
 function requireArg(flag: string, argv: string[], io: Io): string {

[Survived] ArithmeticOperator
src/cli.ts:103:27
 
 /** Token counts are only ever read at a glance; six significant digits are noise. */
 function mtok(n: number): string {
-	if (n >= 1e6) return `${(n / 1e6).toFixed(1)}M`.padStart(6);
+	if (n >= 1e6) return `${(n * 1e6).toFixed(1)}M`.padStart(6);
 	if (n >= 1e3) return `${(n / 1e3).toFixed(0)}k`.padStart(6);
 	return String(n).padStart(6);

[Survived] EqualityOperator
src/cli.ts:103:6
 
 /** Token counts are only ever read at a glance; six significant digits are noise. */
 function mtok(n: number): string {
-	if (n >= 1e6) return `${(n / 1e6).toFixed(1)}M`.padStart(6);
+	if (n < 1e6) return `${(n / 1e6).toFixed(1)}M`.padStart(6);
 	if (n >= 1e3) return `${(n / 1e3).toFixed(0)}k`.padStart(6);
 	return String(n).padStart(6);

[Survived] ConditionalExpression
src/cli.ts:104:6
 /** Token counts are only ever read at a glance; six significant digits are noise. */
 function mtok(n: number): string {
 	if (n >= 1e6) return `${(n / 1e6).toFixed(1)}M`.padStart(6);
-	if (n >= 1e3) return `${(n / 1e3).toFixed(0)}k`.padStart(6);
+	if (false) return `${(n / 1e3).toFixed(0)}k`.padStart(6);
 	return String(n).padStart(6);
 }

[Killed] BooleanLiteral
src/cli.ts:110:6
 
 function requireArg(flag: string, argv: string[], io: Io): string {
 	const v = arg(flag, argv);
-	if (!v) fail(io, `missing ${flag}`);
+	if (v) fail(io, `missing ${flag}`);
 	return v;
 }
killedBy: test/cli.test.ts
statusReason: start writes a run and echoes its id: start writes a run and echoes its id

[Killed] LogicalOperator
src/cli.ts:117:6
 function parsePhase(argv: string[], io: Io): PhaseName {
 	const p = requireArg("--phase", argv, io);
 	// `unattributed` and `supervisor` are derived buckets, not gates a caller enters.
-	if (!PHASES.includes(p as PhaseName) || p === "unattributed") fail(io, `invalid --phase ${p}`);
+	if (!PHASES.includes(p as PhaseName) && p === "unattributed") fail(io, `invalid --phase ${p}`);
 	return p as PhaseName;
 }
killedBy: test/cli.test.ts
statusReason: an invalid kind, mode, or phase exits 2 with a specific message: an invalid kind, mode, or phase exits 2 with a specific message

[Killed] StringLiteral
src/cli.ts:122:23
 }
 
 function parseKind(argv: string[], io: Io): Kind {
-	const k = requireArg("--kind", argv, io);
+	const k = requireArg("", argv, io);
 	if (!KINDS.includes(k as Kind)) fail(io, `invalid --kind ${k} (use ${KINDS.join("|")})`);
 	return k as Kind;
killedBy: test/cli.test.ts
statusReason: start writes a run and echoes its id: start writes a run and echoes its id

[Killed] ConditionalExpression
src/cli.ts:123:6
 
 function parseKind(argv: string[], io: Io): Kind {
 	const k = requireArg("--kind", argv, io);
-	if (!KINDS.includes(k as Kind)) fail(io, `invalid --kind ${k} (use ${KINDS.join("|")})`);
+	if (true) fail(io, `invalid --kind ${k} (use ${KINDS.join("|")})`);
 	return k as Kind;
 }
killedBy: test/cli.test.ts
statusReason: start writes a run and echoes its id: start writes a run and echoes its id

[Killed] ConditionalExpression
src/cli.ts:129:6
 
 function parseMode(argv: string[], io: Io): Mode {
 	const m = requireArg("--mode", argv, io);
-	if (m !== "full" && m !== "hitl" && m !== "lite" && m !== "dag") {
+	if (true) {
 		fail(io, `invalid --mode ${m} (use full, hitl, lite, or dag)`);
 	}
killedBy: test/cli.test.ts
statusReason: start writes a run and echoes its id: start writes a run and echoes its id

[Killed] ConditionalExpression
src/cli.ts:129:6
 
 function parseMode(argv: string[], io: Io): Mode {
 	const m = requireArg("--mode", argv, io);
-	if (m !== "full" && m !== "hitl" && m !== "lite" && m !== "dag") {
+	if (true && m !== "lite" && m !== "dag") {
 		fail(io, `invalid --mode ${m} (use full, hitl, lite, or dag)`);
 	}
killedBy: test/cli.test.ts
statusReason: start writes a run and echoes its id: start writes a run and echoes its id

[Killed] StringLiteral
src/cli.ts:130:12
 function parseMode(argv: string[], io: Io): Mode {
 	const m = requireArg("--mode", argv, io);
 	if (m !== "full" && m !== "hitl" && m !== "lite" && m !== "dag") {
-		fail(io, `invalid --mode ${m} (use full, hitl, lite, or dag)`);
+		fail(io, ``);
 	}
 	return m;
killedBy: test/cli.test.ts
statusReason: an invalid kind, mode, or phase exits 2 with a specific message: an invalid kind, mode, or phase exits 2 with a specific message

[Killed] ConditionalExpression
src/cli.ts:137:30
 
 export function main(argv: string[], io: Io = defaultIo): number {
 	const cmd = argv[0];
-	if (!cmd || cmd === "-h" || cmd === "--help") {
+	if (!cmd || cmd === "-h" || false) {
 		io.write(USAGE);
 		return 0;
killedBy: test/cli.test.ts
statusReason: --help and -h both print usage: --help and -h both print usage

[Killed] ConditionalExpression
src/cli.ts:137:6
 
 export function main(argv: string[], io: Io = defaultIo): number {
 	const cmd = argv[0];
-	if (!cmd || cmd === "-h" || cmd === "--help") {
+	if (false || cmd === "--help") {
 		io.write(USAGE);
 		return 0;
killedBy: test/cli.test.ts
statusReason: no command prints usage and succeeds: no command prints usage and succeeds

[Killed] ConditionalExpression
src/cli.ts:145:3
 	const store = new Store(io.storePath(), io.prices);
 
 	switch (cmd) {
-		case "start": {
-			const run = store.openRun({
-				run_id: arg("--run", rest),
-				host: (arg("--host", rest) as Host | undefined) ?? "unknown",
-				cwd: arg("--cwd", rest) ?? io.cwd(),
-				repo: arg("--repo", rest) ?? basename(arg("--cwd", rest) ?? io.cwd()),
-				mode: parseMode(rest, io),
-				kind: parseKind(rest, io),
-				craft_version: arg("--craft-version", rest),
-			});
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "start":
 		case "enter": {
 			const run = store.enterPhase(requireArg("--run", rest, io), parsePhase(rest, io), {
killedBy: test/cli.test.ts
statusReason: start writes a run and echoes its id: start writes a run and echoes its id

[Killed] BlockStatement
src/cli.ts:145:17
 	const store = new Store(io.storePath(), io.prices);
 
 	switch (cmd) {
-		case "start": {
-			const run = store.openRun({
-				run_id: arg("--run", rest),
-				host: (arg("--host", rest) as Host | undefined) ?? "unknown",
-				cwd: arg("--cwd", rest) ?? io.cwd(),
-				repo: arg("--repo", rest) ?? basename(arg("--cwd", rest) ?? io.cwd()),
-				mode: parseMode(rest, io),
-				kind: parseKind(rest, io),
-				craft_version: arg("--craft-version", rest),
-			});
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "start": {}
 		case "enter": {
 			const run = store.enterPhase(requireArg("--run", rest, io), parsePhase(rest, io), {
killedBy: test/cli.test.ts
statusReason: start writes a run and echoes its id: start writes a run and echoes its id

[Survived] StringLiteral
src/cli.ts:147:17
 	switch (cmd) {
 		case "start": {
 			const run = store.openRun({
-				run_id: arg("--run", rest),
+				run_id: arg("", rest),
 				host: (arg("--host", rest) as Host | undefined) ?? "unknown",
 				cwd: arg("--cwd", rest) ?? io.cwd(),

[Survived] LogicalOperator
src/cli.ts:148:11
 		case "start": {
 			const run = store.openRun({
 				run_id: arg("--run", rest),
-				host: (arg("--host", rest) as Host | undefined) ?? "unknown",
+				host: arg("--host", rest) as Host | undefined && "unknown",
 				cwd: arg("--cwd", rest) ?? io.cwd(),
 				repo: arg("--repo", rest) ?? basename(arg("--cwd", rest) ?? io.cwd()),

[Killed] LogicalOperator
src/cli.ts:149:10
 			const run = store.openRun({
 				run_id: arg("--run", rest),
 				host: (arg("--host", rest) as Host | undefined) ?? "unknown",
-				cwd: arg("--cwd", rest) ?? io.cwd(),
+				cwd: arg("--cwd", rest) && io.cwd(),
 				repo: arg("--repo", rest) ?? basename(arg("--cwd", rest) ?? io.cwd()),
 				mode: parseMode(rest, io),
killedBy: test/cli.test.ts
statusReason: start writes a run and echoes its id: start writes a run and echoes its id

[Killed] StringLiteral
src/cli.ts:149:14
 			const run = store.openRun({
 				run_id: arg("--run", rest),
 				host: (arg("--host", rest) as Host | undefined) ?? "unknown",
-				cwd: arg("--cwd", rest) ?? io.cwd(),
+				cwd: arg("", rest) ?? io.cwd(),
 				repo: arg("--repo", rest) ?? basename(arg("--cwd", rest) ?? io.cwd()),
 				mode: parseMode(rest, io),
killedBy: test/cli.test.ts
statusReason: current prints the open run for a directory: current prints the open run for a directory

[Killed] StringLiteral
src/cli.ts:159:44
 			return 0;
 		}
 		case "enter": {
-			const run = store.enterPhase(requireArg("--run", rest, io), parsePhase(rest, io), {
+			const run = store.enterPhase(requireArg("", rest, io), parsePhase(rest, io), {
 				agent: arg("--agent", rest),
 			});
killedBy: test/cli.test.ts
statusReason: an invalid kind, mode, or phase exits 2 with a specific message: an invalid kind, mode, or phase exits 2 with a specific message

[Killed] ObjectLiteral
src/cli.ts:159:86
 			return 0;
 		}
 		case "enter": {
-			const run = store.enterPhase(requireArg("--run", rest, io), parsePhase(rest, io), {
-				agent: arg("--agent", rest),
-			});
+			const run = store.enterPhase(requireArg("--run", rest, io), parsePhase(rest, io), {});
 			io.write(run.run_id + "\n");
 			return 0;
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] StringLiteral
src/cli.ts:160:16
 		}
 		case "enter": {
 			const run = store.enterPhase(requireArg("--run", rest, io), parsePhase(rest, io), {
-				agent: arg("--agent", rest),
+				agent: arg("", rest),
 			});
 			io.write(run.run_id + "\n");
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] ConditionalExpression
src/cli.ts:165:3
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "exit": {
-			const run = store.exitPhase(requireArg("--run", rest, io), parsePhase(rest, io), {
-				security_triggers: arg("--security-triggers", rest)?.split(",").filter(Boolean),
-				blocking_questions: num("--blocking-questions", rest),
-				afk_hitl_status: arg("--afk-hitl-status", rest),
-				criteria_provenance: arg("--criteria-provenance", rest),
-				counsel_status: arg("--counsel-status", rest),
-				blocking_findings: num("--blocking-findings", rest),
-				probe_required: has("--probe-required", rest) ? true : undefined,
-				verdict: arg("--verdict", rest),
-				t_status: arg("--t-status", rest),
-				p0_count: num("--p0", rest),
-				non_p0_count: num("--non-p0", rest),
-				docs_touched: num("--docs-touched", rest),
-				decisions: num("--decisions", rest),
-				plan_deviations: num("--plan-deviations", rest),
-			});
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "exit":
 		case "usage": {
 			const run = store.recordUsage(requireArg("--run", rest, io), {
killedBy: test/cli.test.ts
statusReason: enter and exit round-trip a phase with its fields: enter and exit round-trip a phase with its fields

[Killed] BlockStatement
src/cli.ts:165:16
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "exit": {
-			const run = store.exitPhase(requireArg("--run", rest, io), parsePhase(rest, io), {
-				security_triggers: arg("--security-triggers", rest)?.split(",").filter(Boolean),
-				blocking_questions: num("--blocking-questions", rest),
-				afk_hitl_status: arg("--afk-hitl-status", rest),
-				criteria_provenance: arg("--criteria-provenance", rest),
-				counsel_status: arg("--counsel-status", rest),
-				blocking_findings: num("--blocking-findings", rest),
-				probe_required: has("--probe-required", rest) ? true : undefined,
-				verdict: arg("--verdict", rest),
-				t_status: arg("--t-status", rest),
-				p0_count: num("--p0", rest),
-				non_p0_count: num("--non-p0", rest),
-				docs_touched: num("--docs-touched", rest),
-				decisions: num("--decisions", rest),
-				plan_deviations: num("--plan-deviations", rest),
-			});
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "exit": {}
 		case "usage": {
 			const run = store.recordUsage(requireArg("--run", rest, io), {
killedBy: test/cli.test.ts
statusReason: enter and exit round-trip a phase with its fields: enter and exit round-trip a phase with its fields

[Killed] StringLiteral
src/cli.ts:168:29
 		case "exit": {
 			const run = store.exitPhase(requireArg("--run", rest, io), parsePhase(rest, io), {
 				security_triggers: arg("--security-triggers", rest)?.split(",").filter(Boolean),
-				blocking_questions: num("--blocking-questions", rest),
+				blocking_questions: num("", rest),
 				afk_hitl_status: arg("--afk-hitl-status", rest),
 				criteria_provenance: arg("--criteria-provenance", rest),
killedBy: test/cli.test.ts
statusReason: enter and exit round-trip a phase with its fields: enter and exit round-trip a phase with its fields

[Survived] StringLiteral
src/cli.ts:170:30
 				security_triggers: arg("--security-triggers", rest)?.split(",").filter(Boolean),
 				blocking_questions: num("--blocking-questions", rest),
 				afk_hitl_status: arg("--afk-hitl-status", rest),
-				criteria_provenance: arg("--criteria-provenance", rest),
+				criteria_provenance: arg("", rest),
 				counsel_status: arg("--counsel-status", rest),
 				blocking_findings: num("--blocking-findings", rest),

[Survived] StringLiteral
src/cli.ts:189:19
 			const run = store.recordUsage(requireArg("--run", rest, io), {
 				phase: has("--phase", rest) ? parsePhase(rest, io) : undefined,
 				model: arg("--model", rest),
-				provider: arg("--provider", rest),
+				provider: arg("", rest),
 				thinking: arg("--thinking", rest),
 				tokens: {

[Survived] StringLiteral
src/cli.ts:193:18
 				thinking: arg("--thinking", rest),
 				tokens: {
 					input: num("--input", rest) ?? 0,
-					output: num("--output", rest) ?? 0,
+					output: num("", rest) ?? 0,
 					cacheRead: num("--cache-read", rest) ?? 0,
 					cacheWrite: num("--cache-write", rest) ?? 0,

[Survived] StringLiteral
src/cli.ts:195:22
 					input: num("--input", rest) ?? 0,
 					output: num("--output", rest) ?? 0,
 					cacheRead: num("--cache-read", rest) ?? 0,
-					cacheWrite: num("--cache-write", rest) ?? 0,
+					cacheWrite: num("", rest) ?? 0,
 				},
 				cost_usd: num("--cost", rest),

[Survived] StringLiteral
src/cli.ts:200:16
 				cost_usd: num("--cost", rest),
 				turns: num("--turns", rest),
 				tool_name: arg("--tool", rest),
-				agent: arg("--agent", rest),
+				agent: arg("", rest),
 				subagent: has("--subagent", rest),
 				quota_error: has("--quota-error", rest),

[Survived] StringLiteral
src/cli.ts:202:22
 				tool_name: arg("--tool", rest),
 				agent: arg("--agent", rest),
 				subagent: has("--subagent", rest),
-				quota_error: has("--quota-error", rest),
+				quota_error: has("", rest),
 				timeout: has("--timeout", rest),
 				failover: has("--failover", rest),

[Killed] StringLiteral
src/cli.ts:211:21
 			return 0;
 		}
 		case "verify": {
-			const code = num("--exit-code", rest);
+			const code = num("", rest);
 			if (code === undefined || Number.isNaN(code)) fail(io, "missing or invalid --exit-code");
 			const run = store.recordVerify(requireArg("--run", rest, io), requireArg("--command", rest, io), code);
killedBy: test/cli.test.ts
statusReason: verify records the command and its exit code: verify records the command and its exit code

[Killed] ConditionalExpression
src/cli.ts:212:8
 		}
 		case "verify": {
 			const code = num("--exit-code", rest);
-			if (code === undefined || Number.isNaN(code)) fail(io, "missing or invalid --exit-code");
+			if (false || Number.isNaN(code)) fail(io, "missing or invalid --exit-code");
 			const run = store.recordVerify(requireArg("--run", rest, io), requireArg("--command", rest, io), code);
 			io.write(run.run_id + "\n");
killedBy: test/cli.test.ts
statusReason: verify requires a numeric exit code: verify requires a numeric exit code

[Survived] StringLiteral
src/cli.ts:226:8
 		case "mode":
 			store.setMode(requireArg("--run", rest, io), parseMode(rest, io));
 			return 0;
-		case "kind":
+		case "":
 			store.setKind(requireArg("--run", rest, io), parseKind(rest, io));
 			return 0;

[Killed] ConditionalExpression
src/cli.ts:237:8
 		case "current": {
 			const cwd = arg("--cwd", rest) ?? io.cwd();
 			const run = store.latestOpenForCwd(cwd);
-			if (!run) return 1;
+			if (true) return 1;
 			io.write(run.run_id + "\n");
 			return 0;
killedBy: test/cli.test.ts
statusReason: current prints the open run for a directory: current prints the open run for a directory

[Survived] ArrowFunction
src/cli.ts:245:31
 			const id = arg("--run", rest);
 			const last = num("--last", rest);
 			let runs = store.loadAll();
-			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
+			if (id) runs = runs.filter(() => undefined);
 			if (last) runs = runs.slice(-last);
 			io.write(summarize(runs) + "\n");

[NoCoverage] UnaryOperator
src/cli.ts:246:32
 			const last = num("--last", rest);
 			let runs = store.loadAll();
 			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
-			if (last) runs = runs.slice(-last);
+			if (last) runs = runs.slice(+last);
 			io.write(summarize(runs) + "\n");
 			return 0;

[Survived] StringLiteral
src/cli.ts:247:31
 			let runs = store.loadAll();
 			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
 			if (last) runs = runs.slice(-last);
-			io.write(summarize(runs) + "\n");
+			io.write(summarize(runs) + "");
 			return 0;
 		}

[Killed] ConditionalExpression
src/cli.ts:252:8
 		}
 		case "doctor": {
 			const complaints = diagnose(store.loadAll(), io.now(), num("--stale-hours", rest) ?? 12);
-			if (complaints.length === 0) {
+			if (false) {
 				io.write("no data-quality problems found\n");
 				return 0;
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Survived] StringLiteral
src/cli.ts:266:19
 		}
 		case "totals": {
 			const runs = store.loadAll();
-			const header = "phase          n     cost     notional      time      turns      in     out   cache\n";
+			const header = "";
 			const writeTable = (totals: Map<PhaseName, PhaseTotal>) => {
 				io.write(header);

[Killed] ConditionalExpression
src/cli.ts:278:8
 			// Split by default. A blended table averages workflows that differ in shape
 			// — v3's three-agent counsel panel against v4's single reviewer — and reads
 			// as one coherent number when it is not. `--all` opts back into the blend.
-			if (has("--all", rest)) {
+			if (false) {
 				writeTable(phaseTotals(runs));
 			} else {
killedBy: test/cli.test.ts
statusReason: totals --all blends versions into a single table: totals --all blends versions into a single table

[Killed] ConditionalExpression
src/cli.ts:278:8
 			// Split by default. A blended table averages workflows that differ in shape
 			// — v3's three-agent counsel panel against v4's single reviewer — and reads
 			// as one coherent number when it is not. `--all` opts back into the blend.
-			if (has("--all", rest)) {
+			if (true) {
 				writeTable(phaseTotals(runs));
 			} else {
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] BlockStatement
src/cli.ts:280:11
 			// as one coherent number when it is not. `--all` opts back into the blend.
 			if (has("--all", rest)) {
 				writeTable(phaseTotals(runs));
-			} else {
-				const byVersion = phaseTotalsByVersion(runs);
-				for (const [version, totals] of byVersion) {
-					const n = runs.filter((r) => (r.craft_version ?? "unknown") === version).length;
-					const inferred = runs.filter(
-						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",
-					).length;
-					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
-					io.write(`\n── CRAFTS v${version} — ${n} run${n === 1 ? "" : "s"}${mark}\n`);
-					writeTable(totals);
-				}
-			}
+			} else {}
 			io.write(
 				"\n`cost` is what you paid; `notional` is what the tokens are worth at list price\n" +
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] BlockStatement
src/cli.ts:282:48
 				writeTable(phaseTotals(runs));
 			} else {
 				const byVersion = phaseTotalsByVersion(runs);
-				for (const [version, totals] of byVersion) {
-					const n = runs.filter((r) => (r.craft_version ?? "unknown") === version).length;
-					const inferred = runs.filter(
-						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",
-					).length;
-					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
-					io.write(`\n── CRAFTS v${version} — ${n} run${n === 1 ? "" : "s"}${mark}\n`);
-					writeTable(totals);
-				}
+				for (const [version, totals] of byVersion) {}
 			}
 			io.write(
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Survived] MethodExpression
src/cli.ts:283:16
 			} else {
 				const byVersion = phaseTotalsByVersion(runs);
 				for (const [version, totals] of byVersion) {
-					const n = runs.filter((r) => (r.craft_version ?? "unknown") === version).length;
+					const n = runs.length;
 					const inferred = runs.filter(
 						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",

[Survived] LogicalOperator
src/cli.ts:283:36
 			} else {
 				const byVersion = phaseTotalsByVersion(runs);
 				for (const [version, totals] of byVersion) {
-					const n = runs.filter((r) => (r.craft_version ?? "unknown") === version).length;
+					const n = runs.filter((r) => (r.craft_version && "unknown") === version).length;
 					const inferred = runs.filter(
 						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",

[Survived] MethodExpression
src/cli.ts:284:23
 				const byVersion = phaseTotalsByVersion(runs);
 				for (const [version, totals] of byVersion) {
 					const n = runs.filter((r) => (r.craft_version ?? "unknown") === version).length;
-					const inferred = runs.filter(
-						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",
-					).length;
+					const inferred = runs.length;
 					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
 					io.write(`\n── CRAFTS v${version} — ${n} run${n === 1 ? "" : "s"}${mark}\n`);

[Killed] EqualityOperator
src/cli.ts:285:60
 				for (const [version, totals] of byVersion) {
 					const n = runs.filter((r) => (r.craft_version ?? "unknown") === version).length;
 					const inferred = runs.filter(
-						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",
+						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source !== "inferred",
 					).length;
 					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] EqualityOperator
src/cli.ts:285:14
 				for (const [version, totals] of byVersion) {
 					const n = runs.filter((r) => (r.craft_version ?? "unknown") === version).length;
 					const inferred = runs.filter(
-						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",
+						(r) => (r.craft_version ?? "unknown") !== version && r.craft_version_source === "inferred",
 					).length;
 					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] EqualityOperator
src/cli.ts:287:19
 					const inferred = runs.filter(
 						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",
 					).length;
-					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
+					const mark = inferred <= 0 ? ` (${inferred} inferred)` : "";
 					io.write(`\n── CRAFTS v${version} — ${n} run${n === 1 ? "" : "s"}${mark}\n`);
 					writeTable(totals);
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] ConditionalExpression
src/cli.ts:287:19
 					const inferred = runs.filter(
 						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",
 					).length;
-					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
+					const mark = false ? ` (${inferred} inferred)` : "";
 					io.write(`\n── CRAFTS v${version} — ${n} run${n === 1 ? "" : "s"}${mark}\n`);
 					writeTable(totals);
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Survived] EqualityOperator
src/cli.ts:288:52
 						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",
 					).length;
 					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
-					io.write(`\n── CRAFTS v${version} — ${n} run${n === 1 ? "" : "s"}${mark}\n`);
+					io.write(`\n── CRAFTS v${version} — ${n} run${n !== 1 ? "" : "s"}${mark}\n`);
 					writeTable(totals);
 				}

[Survived] ConditionalExpression
src/cli.ts:288:52
 						(r) => (r.craft_version ?? "unknown") === version && r.craft_version_source === "inferred",
 					).length;
 					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
-					io.write(`\n── CRAFTS v${version} — ${n} run${n === 1 ? "" : "s"}${mark}\n`);
+					io.write(`\n── CRAFTS v${version} — ${n} run${false ? "" : "s"}${mark}\n`);
 					writeTable(totals);
 				}

[Survived] CallExpression
src/cli.ts:289:6
 					).length;
 					const mark = inferred > 0 ? ` (${inferred} inferred)` : "";
 					io.write(`\n── CRAFTS v${version} — ${n} run${n === 1 ? "" : "s"}${mark}\n`);
-					writeTable(totals);
+					;
 				}
 			}

[Killed] BlockStatement
src/cli.ts:299:18
 			);
 			return 0;
 		}
-		case "models": {
-			const rows = modelTotals(store.loadAll());
-			if (rows.length === 0) {
-				io.write("no model usage recorded\n");
-				return 0;
-			}
-			io.write(
-				"model                          turns      cost   notional      in     out   cache\n",
-			);
-			for (const m of rows) {
-				const cost = m.costless ? "     n/a" : `$${m.cost.toFixed(2).padStart(7)}`;
-				const notional = m.unpriced ? "   unpriced" : `  $${m.notional.toFixed(2).padStart(8)}`;
-				io.write(
-					`${m.model.padEnd(29)} ${String(m.turns).padStart(5)}  ${cost}${notional}  ${mtok(m.tokens.input)}  ${mtok(m.tokens.output)}  ${mtok(m.tokens.cacheRead)}\n`,
-				);
-			}
-			if (rows.some((m) => m.costless)) {
-				io.write(
-					"\nn/a = subscription-billed, no per-token price reported. Compare tokens, not cost.\n",
-				);
-			}
-			return 0;
-		}
+		case "models": {}
 		default:
 			io.error(`unknown command ${cmd}`);
killedBy: test/cli.test.ts
statusReason: models reports nothing gracefully when no model usage exists: models reports nothing gracefully when no model usage exists

[Killed] ConditionalExpression
src/cli.ts:299:3
 			);
 			return 0;
 		}
-		case "models": {
-			const rows = modelTotals(store.loadAll());
-			if (rows.length === 0) {
-				io.write("no model usage recorded\n");
-				return 0;
-			}
-			io.write(
-				"model                          turns      cost   notional      in     out   cache\n",
-			);
-			for (const m of rows) {
-				const cost = m.costless ? "     n/a" : `$${m.cost.toFixed(2).padStart(7)}`;
-				const notional = m.unpriced ? "   unpriced" : `  $${m.notional.toFixed(2).padStart(8)}`;
-				io.write(
-					`${m.model.padEnd(29)} ${String(m.turns).padStart(5)}  ${cost}${notional}  ${mtok(m.tokens.input)}  ${mtok(m.tokens.output)}  ${mtok(m.tokens.cacheRead)}\n`,
-				);
-			}
-			if (rows.some((m) => m.costless)) {
-				io.write(
-					"\nn/a = subscription-billed, no per-token price reported. Compare tokens, not cost.\n",
-				);
-			}
-			return 0;
-		}
+		case "models":
 		default:
 			io.error(`unknown command ${cmd}`);
killedBy: test/cli.test.ts
statusReason: models reports nothing gracefully when no model usage exists: models reports nothing gracefully when no model usage exists
