[NoCoverage] BlockStatement
src/mutate-cli.ts:31:64
 correctly ignored; deciding which is a judgment call left to the reviewer.
 `;
 
-function arg(flag: string, argv: string[]): string | undefined {
-	const i = argv.indexOf(flag);
-	return i === -1 ? undefined : argv[i + 1];
-}
+function arg(flag: string, argv: string[]): string | undefined {}
 
 function main(argv: string[]): void {

[NoCoverage] EqualityOperator
src/mutate-cli.ts:33:9
 
 function arg(flag: string, argv: string[]): string | undefined {
 	const i = argv.indexOf(flag);
-	return i === -1 ? undefined : argv[i + 1];
+	return i !== -1 ? undefined : argv[i + 1];
 }
 

[NoCoverage] ConditionalExpression
src/mutate-cli.ts:37:6
 }
 
 function main(argv: string[]): void {
-	if (argv.includes("-h") || argv.includes("--help")) {
+	if (false) {
 		process.stdout.write(USAGE);
 		return;

[NoCoverage] ConditionalExpression
src/mutate-cli.ts:37:6
 }
 
 function main(argv: string[]): void {
-	if (argv.includes("-h") || argv.includes("--help")) {
+	if (true) {
 		process.stdout.write(USAGE);
 		return;

[NoCoverage] CallExpression
src/mutate-cli.ts:38:3
 
 function main(argv: string[]): void {
 	if (argv.includes("-h") || argv.includes("--help")) {
-		process.stdout.write(USAGE);
+		;
 		return;
 	}

[NoCoverage] CallExpression
src/mutate-cli.ts:44:3
 	const base = arg("--base", argv);
 	if (!base) {
 		console.error("missing --base <ref>");
-		process.exit(2);
+		;
 	}
 	const cwd = arg("--cwd", argv) ?? process.cwd();

[NoCoverage] LogicalOperator
src/mutate-cli.ts:46:14
 		console.error("missing --base <ref>");
 		process.exit(2);
 	}
-	const cwd = arg("--cwd", argv) ?? process.cwd();
+	const cwd = arg("--cwd", argv) && process.cwd();
 	const timeoutSec = Number(arg("--timeout", argv) ?? DEFAULT_TIMEOUT_SEC);
 	const maxLines = Number(arg("--max-lines", argv) ?? DEFAULT_MAX_LINES);

[NoCoverage] LogicalOperator
src/mutate-cli.ts:47:28
 		process.exit(2);
 	}
 	const cwd = arg("--cwd", argv) ?? process.cwd();
-	const timeoutSec = Number(arg("--timeout", argv) ?? DEFAULT_TIMEOUT_SEC);
+	const timeoutSec = Number(arg("--timeout", argv) && DEFAULT_TIMEOUT_SEC);
 	const maxLines = Number(arg("--max-lines", argv) ?? DEFAULT_MAX_LINES);
 

[NoCoverage] LogicalOperator
src/mutate-cli.ts:48:26
 	}
 	const cwd = arg("--cwd", argv) ?? process.cwd();
 	const timeoutSec = Number(arg("--timeout", argv) ?? DEFAULT_TIMEOUT_SEC);
-	const maxLines = Number(arg("--max-lines", argv) ?? DEFAULT_MAX_LINES);
+	const maxLines = Number(arg("--max-lines", argv) && DEFAULT_MAX_LINES);
 
 	// A stale report from an earlier run must not be mistaken for this one's.

[NoCoverage] StringLiteral
src/mutate-cli.ts:48:30
 	}
 	const cwd = arg("--cwd", argv) ?? process.cwd();
 	const timeoutSec = Number(arg("--timeout", argv) ?? DEFAULT_TIMEOUT_SEC);
-	const maxLines = Number(arg("--max-lines", argv) ?? DEFAULT_MAX_LINES);
+	const maxLines = Number(arg("", argv) ?? DEFAULT_MAX_LINES);
 
 	// A stale report from an earlier run must not be mistaken for this one's.

[NoCoverage] BlockStatement
src/mutate-cli.ts:58:26
 		base,
 		timeoutSec,
 		maxLines,
-		gitDiff: (dir, ref) => {
-			const out = spawnSync("git", ["diff", "--unified=0", ref, "--"], { cwd: dir, encoding: "utf8" });
-			if (out.status !== 0) {
-				console.error(out.stderr?.trim() || `git diff against ${ref} failed`);
-				process.exit(1);
-			}
-			return out.stdout ?? "";
-		},
+		gitDiff: (dir, ref) => {},
 		untracked: (dir) => {
 			const out = spawnSync("git", ["ls-files", "--others", "--exclude-standard"], { cwd: dir, encoding: "utf8" });

[NoCoverage] ObjectLiteral
src/mutate-cli.ts:59:69
 		timeoutSec,
 		maxLines,
 		gitDiff: (dir, ref) => {
-			const out = spawnSync("git", ["diff", "--unified=0", ref, "--"], { cwd: dir, encoding: "utf8" });
+			const out = spawnSync("git", ["diff", "--unified=0", ref, "--"], {});
 			if (out.status !== 0) {
 				console.error(out.stderr?.trim() || `git diff against ${ref} failed`);

[NoCoverage] EqualityOperator
src/mutate-cli.ts:60:8
 		maxLines,
 		gitDiff: (dir, ref) => {
 			const out = spawnSync("git", ["diff", "--unified=0", ref, "--"], { cwd: dir, encoding: "utf8" });
-			if (out.status !== 0) {
+			if (out.status === 0) {
 				console.error(out.stderr?.trim() || `git diff against ${ref} failed`);
 				process.exit(1);

[NoCoverage] ConditionalExpression
src/mutate-cli.ts:60:8
 		maxLines,
 		gitDiff: (dir, ref) => {
 			const out = spawnSync("git", ["diff", "--unified=0", ref, "--"], { cwd: dir, encoding: "utf8" });
-			if (out.status !== 0) {
+			if (true) {
 				console.error(out.stderr?.trim() || `git diff against ${ref} failed`);
 				process.exit(1);

[NoCoverage] ConditionalExpression
src/mutate-cli.ts:61:19
 		gitDiff: (dir, ref) => {
 			const out = spawnSync("git", ["diff", "--unified=0", ref, "--"], { cwd: dir, encoding: "utf8" });
 			if (out.status !== 0) {
-				console.error(out.stderr?.trim() || `git diff against ${ref} failed`);
+				console.error(false);
 				process.exit(1);
 			}

[NoCoverage] LogicalOperator
src/mutate-cli.ts:61:19
 		gitDiff: (dir, ref) => {
 			const out = spawnSync("git", ["diff", "--unified=0", ref, "--"], { cwd: dir, encoding: "utf8" });
 			if (out.status !== 0) {
-				console.error(out.stderr?.trim() || `git diff against ${ref} failed`);
+				console.error(out.stderr?.trim() && `git diff against ${ref} failed`);
 				process.exit(1);
 			}

[NoCoverage] CallExpression
src/mutate-cli.ts:62:5
 			const out = spawnSync("git", ["diff", "--unified=0", ref, "--"], { cwd: dir, encoding: "utf8" });
 			if (out.status !== 0) {
 				console.error(out.stderr?.trim() || `git diff against ${ref} failed`);
-				process.exit(1);
+				;
 			}
 			return out.stdout ?? "";

[NoCoverage] LogicalOperator
src/mutate-cli.ts:64:11
 				console.error(out.stderr?.trim() || `git diff against ${ref} failed`);
 				process.exit(1);
 			}
-			return out.stdout ?? "";
+			return out.stdout && "";
 		},
 		untracked: (dir) => {

[NoCoverage] StringLiteral
src/mutate-cli.ts:64:25
 				console.error(out.stderr?.trim() || `git diff against ${ref} failed`);
 				process.exit(1);
 			}
-			return out.stdout ?? "";
+			return out.stdout ?? "Stryker was here!";
 		},
 		untracked: (dir) => {

[NoCoverage] BlockStatement
src/mutate-cli.ts:66:23
 			}
 			return out.stdout ?? "";
 		},
-		untracked: (dir) => {
-			const out = spawnSync("git", ["ls-files", "--others", "--exclude-standard"], { cwd: dir, encoding: "utf8" });
-			if (out.status !== 0) return [];
-			return (out.stdout ?? "")
-				.split("\n")
-				.map((f) => f.trim())
-				.filter(Boolean)
-				.map((file) => {
-					try {
-						// Count lines rather than assuming: the range must not run past
-						// end-of-file or Stryker rejects it.
-						const text = readFileSync(join(dir, file), "utf8");
-						return { file, lines: text.split("\n").length };
-					} catch {
-						return { file, lines: 0 };
-					}
-				});
-		},
+		untracked: (dir) => {},
 		runStryker: (dir, mutateArgs, seconds) => {
 			const out = spawnSync(

[NoCoverage] ObjectLiteral
src/mutate-cli.ts:67:81
 			return out.stdout ?? "";
 		},
 		untracked: (dir) => {
-			const out = spawnSync("git", ["ls-files", "--others", "--exclude-standard"], { cwd: dir, encoding: "utf8" });
+			const out = spawnSync("git", ["ls-files", "--others", "--exclude-standard"], {});
 			if (out.status !== 0) return [];
 			return (out.stdout ?? "")

[NoCoverage] StringLiteral
src/mutate-cli.ts:67:46
 			return out.stdout ?? "";
 		},
 		untracked: (dir) => {
-			const out = spawnSync("git", ["ls-files", "--others", "--exclude-standard"], { cwd: dir, encoding: "utf8" });
+			const out = spawnSync("git", ["ls-files", "", "--exclude-standard"], { cwd: dir, encoding: "utf8" });
 			if (out.status !== 0) return [];
 			return (out.stdout ?? "")

[NoCoverage] ConditionalExpression
src/mutate-cli.ts:68:8
 		},
 		untracked: (dir) => {
 			const out = spawnSync("git", ["ls-files", "--others", "--exclude-standard"], { cwd: dir, encoding: "utf8" });
-			if (out.status !== 0) return [];
+			if (false) return [];
 			return (out.stdout ?? "")
 				.split("\n")

[NoCoverage] ConditionalExpression
src/mutate-cli.ts:68:8
 		},
 		untracked: (dir) => {
 			const out = spawnSync("git", ["ls-files", "--others", "--exclude-standard"], { cwd: dir, encoding: "utf8" });
-			if (out.status !== 0) return [];
+			if (true) return [];
 			return (out.stdout ?? "")
 				.split("\n")

[NoCoverage] BlockStatement
src/mutate-cli.ts:73:20
 				.split("\n")
 				.map((f) => f.trim())
 				.filter(Boolean)
-				.map((file) => {
-					try {
-						// Count lines rather than assuming: the range must not run past
-						// end-of-file or Stryker rejects it.
-						const text = readFileSync(join(dir, file), "utf8");
-						return { file, lines: text.split("\n").length };
-					} catch {
-						return { file, lines: 0 };
-					}
-				});
+				.map((file) => {});
 		},
 		runStryker: (dir, mutateArgs, seconds) => {

[NoCoverage] BlockStatement
src/mutate-cli.ts:74:10
 				.map((f) => f.trim())
 				.filter(Boolean)
 				.map((file) => {
-					try {
-						// Count lines rather than assuming: the range must not run past
-						// end-of-file or Stryker rejects it.
-						const text = readFileSync(join(dir, file), "utf8");
-						return { file, lines: text.split("\n").length };
-					} catch {
+					try {} catch {
 						return { file, lines: 0 };
 					}

[NoCoverage] StringLiteral
src/mutate-cli.ts:78:40
 						// Count lines rather than assuming: the range must not run past
 						// end-of-file or Stryker rejects it.
 						const text = readFileSync(join(dir, file), "utf8");
-						return { file, lines: text.split("\n").length };
+						return { file, lines: text.split("").length };
 					} catch {
 						return { file, lines: 0 };

[NoCoverage] BlockStatement
src/mutate-cli.ts:79:14
 						// end-of-file or Stryker rejects it.
 						const text = readFileSync(join(dir, file), "utf8");
 						return { file, lines: text.split("\n").length };
-					} catch {
-						return { file, lines: 0 };
-					}
+					} catch {}
 				});
 		},

[NoCoverage] BlockStatement
src/mutate-cli.ts:84:45
 					}
 				});
 		},
-		runStryker: (dir, mutateArgs, seconds) => {
-			const out = spawnSync(
-				"npx",
-				["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"],
-				{ cwd: dir, encoding: "utf8", timeout: seconds * 1000 },
-			);
-			// spawnSync reports a killed-by-timeout child via `signal`, not `status`.
-			const timedOut = out.error !== undefined && (out.error as NodeJS.ErrnoException).code === "ETIMEDOUT";
-			return {
-				ok: out.status === 0,
-				timedOut: timedOut || out.signal === "SIGTERM",
-				detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),
-			};
-		},
+		runStryker: (dir, mutateArgs, seconds) => {},
 	});
 

[NoCoverage] StringLiteral
src/mutate-cli.ts:86:5
 		},
 		runStryker: (dir, mutateArgs, seconds) => {
 			const out = spawnSync(
-				"npx",
+				"",
 				["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"],
 				{ cwd: dir, encoding: "utf8", timeout: seconds * 1000 },

[NoCoverage] StringLiteral
src/mutate-cli.ts:87:6
 		runStryker: (dir, mutateArgs, seconds) => {
 			const out = spawnSync(
 				"npx",
-				["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"],
+				["", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"],
 				{ cwd: dir, encoding: "utf8", timeout: seconds * 1000 },
 			);

[NoCoverage] StringLiteral
src/mutate-cli.ts:87:58
 		runStryker: (dir, mutateArgs, seconds) => {
 			const out = spawnSync(
 				"npx",
-				["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"],
+				["stryker", "run", "--mutate", mutateArgs.join(","), "", "json"],
 				{ cwd: dir, encoding: "utf8", timeout: seconds * 1000 },
 			);

[NoCoverage] ArithmeticOperator
src/mutate-cli.ts:88:44
 			const out = spawnSync(
 				"npx",
 				["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"],
-				{ cwd: dir, encoding: "utf8", timeout: seconds * 1000 },
+				{ cwd: dir, encoding: "utf8", timeout: seconds / 1000 },
 			);
 			// spawnSync reports a killed-by-timeout child via `signal`, not `status`.

[NoCoverage] ObjectLiteral
src/mutate-cli.ts:88:5
 			const out = spawnSync(
 				"npx",
 				["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"],
-				{ cwd: dir, encoding: "utf8", timeout: seconds * 1000 },
+				{},
 			);
 			// spawnSync reports a killed-by-timeout child via `signal`, not `status`.

[NoCoverage] ConditionalExpression
src/mutate-cli.ts:91:21
 				{ cwd: dir, encoding: "utf8", timeout: seconds * 1000 },
 			);
 			// spawnSync reports a killed-by-timeout child via `signal`, not `status`.
-			const timedOut = out.error !== undefined && (out.error as NodeJS.ErrnoException).code === "ETIMEDOUT";
+			const timedOut = true;
 			return {
 				ok: out.status === 0,

[NoCoverage] ConditionalExpression
src/mutate-cli.ts:91:21
 				{ cwd: dir, encoding: "utf8", timeout: seconds * 1000 },
 			);
 			// spawnSync reports a killed-by-timeout child via `signal`, not `status`.
-			const timedOut = out.error !== undefined && (out.error as NodeJS.ErrnoException).code === "ETIMEDOUT";
+			const timedOut = true && (out.error as NodeJS.ErrnoException).code === "ETIMEDOUT";
 			return {
 				ok: out.status === 0,

[NoCoverage] EqualityOperator
src/mutate-cli.ts:93:9
 			// spawnSync reports a killed-by-timeout child via `signal`, not `status`.
 			const timedOut = out.error !== undefined && (out.error as NodeJS.ErrnoException).code === "ETIMEDOUT";
 			return {
-				ok: out.status === 0,
+				ok: out.status !== 0,
 				timedOut: timedOut || out.signal === "SIGTERM",
 				detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),

[NoCoverage] EqualityOperator
src/mutate-cli.ts:94:27
 			const timedOut = out.error !== undefined && (out.error as NodeJS.ErrnoException).code === "ETIMEDOUT";
 			return {
 				ok: out.status === 0,
-				timedOut: timedOut || out.signal === "SIGTERM",
+				timedOut: timedOut || out.signal !== "SIGTERM",
 				detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),
 			};

[NoCoverage] LogicalOperator
src/mutate-cli.ts:94:15
 			const timedOut = out.error !== undefined && (out.error as NodeJS.ErrnoException).code === "ETIMEDOUT";
 			return {
 				ok: out.status === 0,
-				timedOut: timedOut || out.signal === "SIGTERM",
+				timedOut: timedOut && out.signal === "SIGTERM",
 				detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),
 			};

[NoCoverage] UnaryOperator
src/mutate-cli.ts:95:50
 			return {
 				ok: out.status === 0,
 				timedOut: timedOut || out.signal === "SIGTERM",
-				detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),
+				detail: out.stderr?.trim().split("\n").slice(+3).join("\n"),
 			};
 		},

[NoCoverage] OptionalChaining
src/mutate-cli.ts:95:13
 			return {
 				ok: out.status === 0,
 				timedOut: timedOut || out.signal === "SIGTERM",
-				detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),
+				detail: out.stderr.trim().split("\n").slice(-3).join("\n"),
 			};
 		},

[NoCoverage] ConditionalExpression
src/mutate-cli.ts:101:6
 	});
 
 	process.stdout.write(JSON.stringify(result, null, 2) + "\n");
-	if (result.status === "error") process.exit(1);
+	if (true) process.exit(1);
 }
 

[NoCoverage] EqualityOperator
src/mutate-cli.ts:101:6
 	});
 
 	process.stdout.write(JSON.stringify(result, null, 2) + "\n");
-	if (result.status === "error") process.exit(1);
+	if (result.status !== "error") process.exit(1);
 }
 

[NoCoverage] BlockStatement
src/mutate-cli.ts:104:5
 	if (result.status === "error") process.exit(1);
 }
 
-try {
-	main(process.argv.slice(2));
-} catch (err) {
+try {} catch (err) {
 	console.error(err instanceof Error ? err.message : String(err));
 	process.exit(1);

[NoCoverage] MethodExpression
src/mutate-cli.ts:105:7
 }
 
 try {
-	main(process.argv.slice(2));
+	main(process.argv);
 } catch (err) {
 	console.error(err instanceof Error ? err.message : String(err));

[NoCoverage] BlockStatement
src/mutate-cli.ts:106:15
 
 try {
 	main(process.argv.slice(2));
-} catch (err) {
-	console.error(err instanceof Error ? err.message : String(err));
-	process.exit(1);
-}
+} catch (err) {}
 

[NoCoverage] CallExpression
src/mutate-cli.ts:107:2
 try {
 	main(process.argv.slice(2));
 } catch (err) {
-	console.error(err instanceof Error ? err.message : String(err));
+	;
 	process.exit(1);
 }

[NoCoverage] CallExpression
src/mutate-cli.ts:108:2
 	main(process.argv.slice(2));
 } catch (err) {
 	console.error(err instanceof Error ? err.message : String(err));
-	process.exit(1);
+	;
 }
 
