[Killed] StringLiteral
src/mutate.ts:59:37
 }
 
 export const DEFAULT_TIMEOUT_SEC = 60;
-const REPORT_PATH = join("reports", "mutation", "mutation.json");
+const REPORT_PATH = join("reports", "", "mutation.json");
 
 /** Source globs to mutate, and the test patterns to keep out of the mutation set. */
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] Regex
src/mutate.ts:62:33
 const REPORT_PATH = join("reports", "mutation", "mutation.json");
 
 /** Source globs to mutate, and the test patterns to keep out of the mutation set. */
-export const DEFAULT_INCLUDE = [/^src\/.*\.(ts|tsx|js|jsx|mjs|cjs)$/];
+export const DEFAULT_INCLUDE = [/^src\/.\.(ts|tsx|js|jsx|mjs|cjs)$/];
 export const DEFAULT_EXCLUDE = [/\.(test|spec)\.(ts|tsx|js|jsx|mjs|cjs)$/, /^test\//, /^tests\//, /^__tests__\//];
 
killedBy: test/mutate.test.ts
statusReason: an untracked source file is scoped in full — git diff cannot see it: an untracked source file is scoped in full — git diff cannot see it

[Survived] ArrayDeclaration
src/mutate.ts:63:32
 
 /** Source globs to mutate, and the test patterns to keep out of the mutation set. */
 export const DEFAULT_INCLUDE = [/^src\/.*\.(ts|tsx|js|jsx|mjs|cjs)$/];
-export const DEFAULT_EXCLUDE = [/\.(test|spec)\.(ts|tsx|js|jsx|mjs|cjs)$/, /^test\//, /^tests\//, /^__tests__\//];
+export const DEFAULT_EXCLUDE = [];
 
 /**

[Killed] AssignmentOperator
src/mutate.ts:93:57
 		for (const m of entry.mutants ?? []) {
 			// Timeouts count as killed: the mutant changed behaviour enough to hang the
 			// suite, which is detection, just an ugly form of it.
-			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
+			if (m.status === "Killed" || m.status === "Timeout") killed -= 1;
 			else if (m.status === "NoCoverage") noCoverage += 1;
 			else if (m.status === "Survived") {
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ConditionalExpression
src/mutate.ts:94:13
 			// Timeouts count as killed: the mutant changed behaviour enough to hang the
 			// suite, which is detection, just an ugly form of it.
 			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
-			else if (m.status === "NoCoverage") noCoverage += 1;
+			else if (true) noCoverage += 1;
 			else if (m.status === "Survived") {
 				survived += 1;
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ConditionalExpression
src/mutate.ts:95:13
 			// suite, which is detection, just an ugly form of it.
 			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
 			else if (m.status === "NoCoverage") noCoverage += 1;
-			else if (m.status === "Survived") {
+			else if (true) {
 				survived += 1;
 				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !!f))];
killedBy: test/mutate.test.ts
statusReason: statuses that say nothing about test quality are excluded from the count: statuses that say nothing about test quality are excluded from the count

[Killed] ArrowFunction
src/mutate.ts:97:84
 			else if (m.status === "NoCoverage") noCoverage += 1;
 			else if (m.status === "Survived") {
 				survived += 1;
-				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !!f))];
+				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter(() => undefined))];
 				survivors.push({
 					file,
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ArrowFunction
src/mutate.ts:97:55
 			else if (m.status === "NoCoverage") noCoverage += 1;
 			else if (m.status === "Survived") {
 				survived += 1;
-				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !!f))];
+				const files = [...new Set((m.coveredBy ?? []).map(() => undefined).filter((f): f is string => !!f))];
 				survivors.push({
 					file,
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ArithmeticOperator
src/mutate.ts:110:19
 			// nothing about test quality, only about the mutant being unrunnable.
 		}
 	}
-	return { tested: killed + survived + noCoverage, killed, survived, no_coverage: noCoverage, survivors };
+	return { tested: killed - survived + noCoverage, killed, survived, no_coverage: noCoverage, survivors };
 }
 
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ArithmeticOperator
src/mutate.ts:110:19
 			// nothing about test quality, only about the mutant being unrunnable.
 		}
 	}
-	return { tested: killed + survived + noCoverage, killed, survived, no_coverage: noCoverage, survivors };
+	return { tested: killed + survived - noCoverage, killed, survived, no_coverage: noCoverage, survivors };
 }
 
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] MethodExpression
src/mutate.ts:140:18
 export function computeRanges(diff: string, untracked: Array<{ file: string; lines: number }> = []): LineRange[] {
 	const fromDiff = parseDiffRanges(diff);
 	// An untracked file is entirely new, so every line of it is in scope.
-	const fromNew = untracked.filter((u) => u.lines > 0).map((u) => ({ file: u.file, start: 1, end: u.lines }));
+	const fromNew = untracked.map((u) => ({ file: u.file, start: 1, end: u.lines }));
 	return mergeRanges(filterSourceRanges([...fromDiff, ...fromNew], { include: DEFAULT_INCLUDE, exclude: DEFAULT_EXCLUDE }));
 }
killedBy: test/mutate.test.ts
statusReason: an empty untracked file scopes nothing rather than an invalid range: an empty untracked file scopes nothing rather than an invalid range

[Killed] ConditionalExpression
src/mutate.ts:140:42
 export function computeRanges(diff: string, untracked: Array<{ file: string; lines: number }> = []): LineRange[] {
 	const fromDiff = parseDiffRanges(diff);
 	// An untracked file is entirely new, so every line of it is in scope.
-	const fromNew = untracked.filter((u) => u.lines > 0).map((u) => ({ file: u.file, start: 1, end: u.lines }));
+	const fromNew = untracked.filter((u) => true).map((u) => ({ file: u.file, start: 1, end: u.lines }));
 	return mergeRanges(filterSourceRanges([...fromDiff, ...fromNew], { include: DEFAULT_INCLUDE, exclude: DEFAULT_EXCLUDE }));
 }
killedBy: test/mutate.test.ts
statusReason: an empty untracked file scopes nothing rather than an invalid range: an empty untracked file scopes nothing rather than an invalid range

[Killed] ObjectLiteral
src/mutate.ts:141:67
 	const fromDiff = parseDiffRanges(diff);
 	// An untracked file is entirely new, so every line of it is in scope.
 	const fromNew = untracked.filter((u) => u.lines > 0).map((u) => ({ file: u.file, start: 1, end: u.lines }));
-	return mergeRanges(filterSourceRanges([...fromDiff, ...fromNew], { include: DEFAULT_INCLUDE, exclude: DEFAULT_EXCLUDE }));
+	return mergeRanges(filterSourceRanges([...fromDiff, ...fromNew], {}));
 }
 
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] BooleanLiteral
src/mutate.ts:151:6
 
 	// No Stryker config means this repo has not opted in. Silence, not failure:
 	// most repos have not, and Render must not break because of it.
-	if (!existsSync(join(cwd, "stryker.config.json")) && !existsSync(join(cwd, "stryker.conf.json"))) {
+	if (existsSync(join(cwd, "stryker.config.json")) && !existsSync(join(cwd, "stryker.conf.json"))) {
 		return { status: "skipped", reason: "no-backend" };
 	}
killedBy: test/mutate.test.ts
statusReason: skips silently when the repo has no stryker config: skips silently when the repo has no stryker config

[Killed] ConditionalExpression
src/mutate.ts:157:6
 
 	const diff = opts.gitDiff!(cwd, base);
 	const ranges = computeRanges(diff, opts.untracked?.(cwd) ?? []);
-	if (ranges.length === 0) return { status: "skipped", reason: "no-changes" };
+	if (true) return { status: "skipped", reason: "no-changes" };
 
 	const lines = countLines(ranges);
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/mutate.ts:160:6
 	if (ranges.length === 0) return { status: "skipped", reason: "no-changes" };
 
 	const lines = countLines(ranges);
-	if (lines > maxLines) {
+	if (true) {
 		return { status: "skipped", reason: "oversize", lines_scoped: lines };
 	}
killedBy: test/mutate.test.ts
statusReason: reports a timeout as skipped rather than an error: reports a timeout as skipped rather than an error

[Killed] BlockStatement
src/mutate.ts:160:24
 	if (ranges.length === 0) return { status: "skipped", reason: "no-changes" };
 
 	const lines = countLines(ranges);
-	if (lines > maxLines) {
-		return { status: "skipped", reason: "oversize", lines_scoped: lines };
-	}
+	if (lines > maxLines) {}
 
 	const started = Date.now();
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/mutate.ts:168:6
 	const outcome = opts.runStryker!(cwd, toStrykerMutateArgs(ranges), timeoutSec);
 	const duration = Date.now() - started;
 
-	if (outcome.timedOut) {
+	if (false) {
 		return { status: "skipped", reason: "timeout", lines_scoped: lines, duration_ms: duration };
 	}
killedBy: test/mutate.test.ts
statusReason: reports a timeout as skipped rather than an error: reports a timeout as skipped rather than an error

[Killed] StringLiteral
src/mutate.ts:174:37
 
 	const reportPath = join(cwd, REPORT_PATH);
 	if (!existsSync(reportPath)) {
-		return { status: "error", reason: "failed", detail: outcome.detail ?? "no mutation report produced", duration_ms: duration };
+		return { status: "error", reason: "", detail: outcome.detail ?? "no mutation report produced", duration_ms: duration };
 	}
 	let report: StrykerReport;
killedBy: test/mutate.test.ts
statusReason: errors when the backend ran but produced no report: errors when the backend ran but produced no report

[NoCoverage] StringLiteral
src/mutate.ts:180:20
 	try {
 		report = JSON.parse(readFileSync(reportPath, "utf8")) as StrykerReport;
 	} catch (err) {
-		return { status: "error", reason: "failed", detail: `unreadable report: ${String(err)}`, duration_ms: duration };
+		return { status: "", reason: "failed", detail: `unreadable report: ${String(err)}`, duration_ms: duration };
 	}
 	const parsed = parseStrykerReport(report);

[NoCoverage] StringLiteral
src/mutate.ts:180:37
 	try {
 		report = JSON.parse(readFileSync(reportPath, "utf8")) as StrykerReport;
 	} catch (err) {
-		return { status: "error", reason: "failed", detail: `unreadable report: ${String(err)}`, duration_ms: duration };
+		return { status: "error", reason: "", detail: `unreadable report: ${String(err)}`, duration_ms: duration };
 	}
 	const parsed = parseStrykerReport(report);

[Killed] ObjectLiteral
src/mutate.ts:183:9
 		return { status: "error", reason: "failed", detail: `unreadable report: ${String(err)}`, duration_ms: duration };
 	}
 	const parsed = parseStrykerReport(report);
-	return { status: "ran", backend: "stryker", lines_scoped: lines, duration_ms: duration, ...parsed };
+	return {};
 }
 
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors
