[Killed] Regex
src/diff-ranges.ts:23:21
 
 /** `@@ -oldStart,oldCount +newStart,newCount @@` — counts are omitted when 1. */
 const HUNK = /^@@ -\d+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/;
-const FILE_HEADER = /^\+\+\+ b\/(.+)$/;
+const FILE_HEADER = /^\+\+\+ b\/(.)$/;
 
 /**
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/diff-ranges.ts:37:7
 	let file: string | null = null;
 	for (const line of diff.split("\n")) {
 		const header = FILE_HEADER.exec(line);
-		if (header) {
+		if (false) {
 			// `/dev/null` on the + side means the file was deleted; nothing to mutate.
 			file = header[1] === "/dev/null" ? null : header[1];
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] BooleanLiteral
src/diff-ranges.ts:44:7
 		}
 		if (!file) continue;
 		const hunk = HUNK.exec(line);
-		if (!hunk) continue;
+		if (hunk) continue;
 		const start = Number(hunk[1]);
 		// An absent count means exactly one line. A count of zero means the change
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] ConditionalExpression
src/diff-ranges.ts:49:7
 		// An absent count means exactly one line. A count of zero means the change
 		// was a deletion anchored after `start`, so there is no new line to mutate.
 		const count = hunk[2] === undefined ? 1 : Number(hunk[2]);
-		if (count === 0) continue;
+		if (true) continue;
 		ranges.push({ file, start, end: start + count - 1 });
 	}
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/diff-ranges.ts:65:10
 	opts: { include: RegExp[]; exclude: RegExp[] },
 ): LineRange[] {
 	return ranges.filter(
-		(r) => opts.include.some((re) => re.test(r.file)) && !opts.exclude.some((re) => re.test(r.file)),
+		(r) => false,
 	);
 }
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Survived] ArrowFunction
src/diff-ranges.ts:83:13
 	}
 	const out: LineRange[] = [];
 	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
-		list.sort((a, b) => a.start - b.start);
+		list.sort(() => undefined);
 		let cur = { ...list[0] };
 		for (const r of list.slice(1)) {

[Killed] ConditionalExpression
src/diff-ranges.ts:87:8
 		let cur = { ...list[0] };
 		for (const r of list.slice(1)) {
 			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
-			if (r.start <= cur.end + 1) {
+			if (true) {
 				cur.end = Math.max(cur.end, r.end);
 			} else {
killedBy: test/diff-ranges.test.ts
statusReason: merges overlapping and abutting ranges, leaves separated ones alone: merges overlapping and abutting ranges, leaves separated ones alone

[Killed] ArithmeticOperator
src/diff-ranges.ts:110:42
 
 /** Total lines covered, for the size cap that decides whether to run at all. */
 export function countLines(ranges: LineRange[]): number {
-	return ranges.reduce((sum, r) => sum + (r.end - r.start + 1), 0);
+	return ranges.reduce((sum, r) => sum + (r.end - r.start - 1), 0);
 }
 
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything
