[Killed] BlockStatement
extensions/claude-code.ts:79:37
 	agents: string[];
 }
 
-function emptyState(): SessionState {
-	return { offset: 0, billed: {}, agents: [] };
-}
+function emptyState(): SessionState {}
 
 export function defaultStateDir(): string {
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Survived] ArrayDeclaration
extensions/claude-code.ts:80:42
 }
 
 function emptyState(): SessionState {
-	return { offset: 0, billed: {}, agents: [] };
+	return { offset: 0, billed: {}, agents: ["Stryker was here"] };
 }
 

[NoCoverage] BlockStatement
extensions/claude-code.ts:83:43
 	return { offset: 0, billed: {}, agents: [] };
 }
 
-export function defaultStateDir(): string {
-	return join(defaultDir(), "sessions");
-}
+export function defaultStateDir(): string {}
 
 function statePath(host: Host, sessionId: string): string {

[Killed] BlockStatement
extensions/claude-code.ts:87:59
 	return join(defaultDir(), "sessions");
 }
 
-function statePath(host: Host, sessionId: string): string {
-	// A session id is a uuid from Claude Code, but it lands in a path either way.
-	return join(host.stateDir, `${sessionId.replace(/[^\w.-]/g, "_")}.json`);
-}
+function statePath(host: Host, sessionId: string): string {}
 
 function readState(host: Host, sessionId: string): SessionState {
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Survived] StringLiteral
extensions/claude-code.ts:89:62
 
 function statePath(host: Host, sessionId: string): string {
 	// A session id is a uuid from Claude Code, but it lands in a path either way.
-	return join(host.stateDir, `${sessionId.replace(/[^\w.-]/g, "_")}.json`);
+	return join(host.stateDir, `${sessionId.replace(/[^\w.-]/g, "")}.json`);
 }
 

[Killed] BlockStatement
extensions/claude-code.ts:92:65
 	return join(host.stateDir, `${sessionId.replace(/[^\w.-]/g, "_")}.json`);
 }
 
-function readState(host: Host, sessionId: string): SessionState {
-	try {
-		const parsed = JSON.parse(readFileSync(statePath(host, sessionId), "utf8")) as Partial<SessionState>;
-		return {
-			run_id: parsed.run_id,
-			offset: parsed.offset ?? 0,
-			billed: parsed.billed ?? {},
-			agents: parsed.agents ?? [],
-		};
-	} catch {
-		return emptyState();
-	}
-}
+function readState(host: Host, sessionId: string): SessionState {}
 
 function writeState(host: Host, sessionId: string, state: SessionState): void {
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] BlockStatement
extensions/claude-code.ts:93:6
 }
 
 function readState(host: Host, sessionId: string): SessionState {
-	try {
-		const parsed = JSON.parse(readFileSync(statePath(host, sessionId), "utf8")) as Partial<SessionState>;
-		return {
-			run_id: parsed.run_id,
-			offset: parsed.offset ?? 0,
-			billed: parsed.billed ?? {},
-			agents: parsed.agents ?? [],
-		};
-	} catch {
+	try {} catch {
 		return emptyState();
 	}
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ObjectLiteral
extensions/claude-code.ts:95:10
 function readState(host: Host, sessionId: string): SessionState {
 	try {
 		const parsed = JSON.parse(readFileSync(statePath(host, sessionId), "utf8")) as Partial<SessionState>;
-		return {
-			run_id: parsed.run_id,
-			offset: parsed.offset ?? 0,
-			billed: parsed.billed ?? {},
-			agents: parsed.agents ?? [],
-		};
+		return {};
 	} catch {
 		return emptyState();
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] LogicalOperator
extensions/claude-code.ts:97:12
 		const parsed = JSON.parse(readFileSync(statePath(host, sessionId), "utf8")) as Partial<SessionState>;
 		return {
 			run_id: parsed.run_id,
-			offset: parsed.offset ?? 0,
+			offset: parsed.offset && 0,
 			billed: parsed.billed ?? {},
 			agents: parsed.agents ?? [],
killedBy: test/claude-code.test.ts
statusReason: the billed-response record stays bounded across a long session: the billed-response record stays bounded across a long session

[Killed] LogicalOperator
extensions/claude-code.ts:98:12
 		return {
 			run_id: parsed.run_id,
 			offset: parsed.offset ?? 0,
-			billed: parsed.billed ?? {},
+			billed: parsed.billed && {},
 			agents: parsed.agents ?? [],
 		};
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Survived] LogicalOperator
extensions/claude-code.ts:99:12
 			run_id: parsed.run_id,
 			offset: parsed.offset ?? 0,
 			billed: parsed.billed ?? {},
-			agents: parsed.agents ?? [],
+			agents: parsed.agents && [],
 		};
 	} catch {

[Killed] BlockStatement
extensions/claude-code.ts:101:10
 			billed: parsed.billed ?? {},
 			agents: parsed.agents ?? [],
 		};
-	} catch {
-		return emptyState();
-	}
+	} catch {}
 }
 
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Timeout] BlockStatement
extensions/claude-code.ts:106:79
 	}
 }
 
-function writeState(host: Host, sessionId: string, state: SessionState): void {
-	const keys = Object.keys(state.billed);
-	if (keys.length > BILLED_LIMIT) {
-		// Insertion order is arrival order, so the oldest keys are the safe ones to drop.
-		for (const key of keys.slice(0, keys.length - BILLED_LIMIT)) delete state.billed[key];
-	}
-	if (state.agents.length > BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);
-	mkdirSync(host.stateDir, { recursive: true });
-	writeFileSync(statePath(host, sessionId), JSON.stringify(state));
-}
+function writeState(host: Host, sessionId: string, state: SessionState): void {}
 
 /**

[Killed] BlockStatement
extensions/claude-code.ts:108:34
 
 function writeState(host: Host, sessionId: string, state: SessionState): void {
 	const keys = Object.keys(state.billed);
-	if (keys.length > BILLED_LIMIT) {
-		// Insertion order is arrival order, so the oldest keys are the safe ones to drop.
-		for (const key of keys.slice(0, keys.length - BILLED_LIMIT)) delete state.billed[key];
-	}
+	if (keys.length > BILLED_LIMIT) {}
 	if (state.agents.length > BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);
 	mkdirSync(host.stateDir, { recursive: true });
killedBy: test/claude-code.test.ts
statusReason: the billed-response record stays bounded across a long session: the billed-response record stays bounded across a long session

[Killed] ConditionalExpression
extensions/claude-code.ts:108:6
 
 function writeState(host: Host, sessionId: string, state: SessionState): void {
 	const keys = Object.keys(state.billed);
-	if (keys.length > BILLED_LIMIT) {
+	if (false) {
 		// Insertion order is arrival order, so the oldest keys are the safe ones to drop.
 		for (const key of keys.slice(0, keys.length - BILLED_LIMIT)) delete state.billed[key];
killedBy: test/claude-code.test.ts
statusReason: the billed-response record stays bounded across a long session: the billed-response record stays bounded across a long session

[Survived] ArithmeticOperator
extensions/claude-code.ts:110:35
 	const keys = Object.keys(state.billed);
 	if (keys.length > BILLED_LIMIT) {
 		// Insertion order is arrival order, so the oldest keys are the safe ones to drop.
-		for (const key of keys.slice(0, keys.length - BILLED_LIMIT)) delete state.billed[key];
+		for (const key of keys.slice(0, keys.length + BILLED_LIMIT)) delete state.billed[key];
 	}
 	if (state.agents.length > BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);

[Survived] MethodExpression
extensions/claude-code.ts:110:21
 	const keys = Object.keys(state.billed);
 	if (keys.length > BILLED_LIMIT) {
 		// Insertion order is arrival order, so the oldest keys are the safe ones to drop.
-		for (const key of keys.slice(0, keys.length - BILLED_LIMIT)) delete state.billed[key];
+		for (const key of keys) delete state.billed[key];
 	}
 	if (state.agents.length > BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);

[Survived] ConditionalExpression
extensions/claude-code.ts:112:6
 		// Insertion order is arrival order, so the oldest keys are the safe ones to drop.
 		for (const key of keys.slice(0, keys.length - BILLED_LIMIT)) delete state.billed[key];
 	}
-	if (state.agents.length > BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);
+	if (true) state.agents = state.agents.slice(-BILLED_LIMIT);
 	mkdirSync(host.stateDir, { recursive: true });
 	writeFileSync(statePath(host, sessionId), JSON.stringify(state));

[Survived] EqualityOperator
extensions/claude-code.ts:112:6
 		// Insertion order is arrival order, so the oldest keys are the safe ones to drop.
 		for (const key of keys.slice(0, keys.length - BILLED_LIMIT)) delete state.billed[key];
 	}
-	if (state.agents.length > BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);
+	if (state.agents.length >= BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);
 	mkdirSync(host.stateDir, { recursive: true });
 	writeFileSync(statePath(host, sessionId), JSON.stringify(state));

[Killed] BooleanLiteral
extensions/claude-code.ts:113:40
 		for (const key of keys.slice(0, keys.length - BILLED_LIMIT)) delete state.billed[key];
 	}
 	if (state.agents.length > BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);
-	mkdirSync(host.stateDir, { recursive: true });
+	mkdirSync(host.stateDir, { recursive: false });
 	writeFileSync(statePath(host, sessionId), JSON.stringify(state));
 }
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ObjectLiteral
extensions/claude-code.ts:113:27
 		for (const key of keys.slice(0, keys.length - BILLED_LIMIT)) delete state.billed[key];
 	}
 	if (state.agents.length > BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);
-	mkdirSync(host.stateDir, { recursive: true });
+	mkdirSync(host.stateDir, {});
 	writeFileSync(statePath(host, sessionId), JSON.stringify(state));
 }
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Timeout] CallExpression
extensions/claude-code.ts:114:2
 	}
 	if (state.agents.length > BILLED_LIMIT) state.agents = state.agents.slice(-BILLED_LIMIT);
 	mkdirSync(host.stateDir, { recursive: true });
-	writeFileSync(statePath(host, sessionId), JSON.stringify(state));
+	;
 }
 

[Killed] BlockStatement
extensions/claude-code.ts:122:61
  * ordering included: an `/execute-dag` prompt also names a protocol, so matching
  * CRAFTS first would file the supervisor as a protocol run.
  */
-export function parseCraftMode(prompt: string): Mode | null {
-	if (/\/execute-dag\b/.test(prompt)) return "dag";
-	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
-	if (/\/craft-lite\b/.test(prompt)) return "lite";
-	if (/\/craft-hitl\b/.test(prompt) || /\bhitl\b/i.test(prompt)) return "hitl";
-	return "full";
-}
+export function parseCraftMode(prompt: string): Mode | null {}
 
 function quota(text: string): boolean {
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] ConditionalExpression
extensions/claude-code.ts:123:6
  * CRAFTS first would file the supervisor as a protocol run.
  */
 export function parseCraftMode(prompt: string): Mode | null {
-	if (/\/execute-dag\b/.test(prompt)) return "dag";
+	if (true) return "dag";
 	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
 	if (/\/craft-lite\b/.test(prompt)) return "lite";
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] ConditionalExpression
extensions/claude-code.ts:123:6
  * CRAFTS first would file the supervisor as a protocol run.
  */
 export function parseCraftMode(prompt: string): Mode | null {
-	if (/\/execute-dag\b/.test(prompt)) return "dag";
+	if (false) return "dag";
 	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
 	if (/\/craft-lite\b/.test(prompt)) return "lite";
killedBy: test/claude-code.test.ts
statusReason: modes are read from the prompt the same way the pi extension reads them: modes are read from the prompt the same way the pi extension reads them

[Killed] BooleanLiteral
extensions/claude-code.ts:124:6
  */
 export function parseCraftMode(prompt: string): Mode | null {
 	if (/\/execute-dag\b/.test(prompt)) return "dag";
-	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
+	if (/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
 	if (/\/craft-lite\b/.test(prompt)) return "lite";
 	if (/\/craft-hitl\b/.test(prompt) || /\bhitl\b/i.test(prompt)) return "hitl";
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] ConditionalExpression
extensions/claude-code.ts:124:6
  */
 export function parseCraftMode(prompt: string): Mode | null {
 	if (/\/execute-dag\b/.test(prompt)) return "dag";
-	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
+	if (true) return null;
 	if (/\/craft-lite\b/.test(prompt)) return "lite";
 	if (/\/craft-hitl\b/.test(prompt) || /\bhitl\b/i.test(prompt)) return "hitl";
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] ConditionalExpression
extensions/claude-code.ts:125:6
 export function parseCraftMode(prompt: string): Mode | null {
 	if (/\/execute-dag\b/.test(prompt)) return "dag";
 	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
-	if (/\/craft-lite\b/.test(prompt)) return "lite";
+	if (false) return "lite";
 	if (/\/craft-hitl\b/.test(prompt) || /\bhitl\b/i.test(prompt)) return "hitl";
 	return "full";
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] ConditionalExpression
extensions/claude-code.ts:125:6
 export function parseCraftMode(prompt: string): Mode | null {
 	if (/\/execute-dag\b/.test(prompt)) return "dag";
 	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
-	if (/\/craft-lite\b/.test(prompt)) return "lite";
+	if (true) return "lite";
 	if (/\/craft-hitl\b/.test(prompt) || /\bhitl\b/i.test(prompt)) return "hitl";
 	return "full";
killedBy: test/claude-code.test.ts
statusReason: modes are read from the prompt the same way the pi extension reads them: modes are read from the prompt the same way the pi extension reads them

[Killed] ConditionalExpression
extensions/claude-code.ts:126:6
 	if (/\/execute-dag\b/.test(prompt)) return "dag";
 	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
 	if (/\/craft-lite\b/.test(prompt)) return "lite";
-	if (/\/craft-hitl\b/.test(prompt) || /\bhitl\b/i.test(prompt)) return "hitl";
+	if (false) return "hitl";
 	return "full";
 }
killedBy: test/claude-code.test.ts
statusReason: modes are read from the prompt the same way the pi extension reads them: modes are read from the prompt the same way the pi extension reads them

[Killed] LogicalOperator
extensions/claude-code.ts:126:6
 	if (/\/execute-dag\b/.test(prompt)) return "dag";
 	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
 	if (/\/craft-lite\b/.test(prompt)) return "lite";
-	if (/\/craft-hitl\b/.test(prompt) || /\bhitl\b/i.test(prompt)) return "hitl";
+	if (/\/craft-hitl\b/.test(prompt) && /\bhitl\b/i.test(prompt)) return "hitl";
 	return "full";
 }
killedBy: test/claude-code.test.ts
statusReason: hitl is recognised from the word as well as the command: hitl is recognised from the word as well as the command

[Killed] StringLiteral
extensions/claude-code.ts:127:9
 	if (!/(?:^|\s)\/craft(?:-hitl|-lite)?(?:\s|$)/m.test(prompt) && !/\bCRAFTS\b/.test(prompt)) return null;
 	if (/\/craft-lite\b/.test(prompt)) return "lite";
 	if (/\/craft-hitl\b/.test(prompt) || /\bhitl\b/i.test(prompt)) return "hitl";
-	return "full";
+	return "";
 }
 
killedBy: test/claude-code.test.ts
statusReason: modes are read from the prompt the same way the pi extension reads them: modes are read from the prompt the same way the pi extension reads them

[Killed] BlockStatement
extensions/claude-code.ts:130:39
 	return "full";
 }
 
-function quota(text: string): boolean {
-	return /429|rate.?limit|quota|resource.?exhausted|usage.?limit/i.test(text);
-}
+function quota(text: string): boolean {}
 
 function timeout(text: string): boolean {
killedBy: test/claude-code.test.ts
statusReason: errors in a tool result are classified, not just counted: errors in a tool result are classified, not just counted

[Killed] BlockStatement
extensions/claude-code.ts:134:41
 	return /429|rate.?limit|quota|resource.?exhausted|usage.?limit/i.test(text);
 }
 
-function timeout(text: string): boolean {
-	return /timed? out|timeout/i.test(text);
-}
+function timeout(text: string): boolean {}
 
 function failover(text: string): boolean {
killedBy: test/claude-code.test.ts
statusReason: errors in a tool result are classified, not just counted: errors in a tool result are classified, not just counted

[Survived] BlockStatement
extensions/claude-code.ts:138:42
 	return /timed? out|timeout/i.test(text);
 }
 
-function failover(text: string): boolean {
-	return /failing over|failover|switched to|provider error/i.test(text);
-}
+function failover(text: string): boolean {}
 
 /** One assistant response, as the transcript records it. */

[Killed] BlockStatement
extensions/claude-code.ts:150:59
 	tokens: Tokens;
 }
 
-function tokensOf(usage: Record<string, unknown>): Tokens {
-	return {
-		input: Number(usage.input_tokens) || 0,
-		output: Number(usage.output_tokens) || 0,
-		cacheRead: Number(usage.cache_read_input_tokens) || 0,
-		cacheWrite: Number(usage.cache_creation_input_tokens) || 0,
-	};
-}
+function tokensOf(usage: Record<string, unknown>): Tokens {}
 
 function totalTokens(t: Tokens): number {
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ObjectLiteral
extensions/claude-code.ts:151:9
 }
 
 function tokensOf(usage: Record<string, unknown>): Tokens {
-	return {
-		input: Number(usage.input_tokens) || 0,
-		output: Number(usage.output_tokens) || 0,
-		cacheRead: Number(usage.cache_read_input_tokens) || 0,
-		cacheWrite: Number(usage.cache_creation_input_tokens) || 0,
-	};
+	return {};
 }
 
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] LogicalOperator
extensions/claude-code.ts:152:10
 
 function tokensOf(usage: Record<string, unknown>): Tokens {
 	return {
-		input: Number(usage.input_tokens) || 0,
+		input: Number(usage.input_tokens) && 0,
 		output: Number(usage.output_tokens) || 0,
 		cacheRead: Number(usage.cache_read_input_tokens) || 0,
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ConditionalExpression
extensions/claude-code.ts:152:10
 
 function tokensOf(usage: Record<string, unknown>): Tokens {
 	return {
-		input: Number(usage.input_tokens) || 0,
+		input: true,
 		output: Number(usage.output_tokens) || 0,
 		cacheRead: Number(usage.cache_read_input_tokens) || 0,
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ConditionalExpression
extensions/claude-code.ts:153:11
 function tokensOf(usage: Record<string, unknown>): Tokens {
 	return {
 		input: Number(usage.input_tokens) || 0,
-		output: Number(usage.output_tokens) || 0,
+		output: true,
 		cacheRead: Number(usage.cache_read_input_tokens) || 0,
 		cacheWrite: Number(usage.cache_creation_input_tokens) || 0,
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ConditionalExpression
extensions/claude-code.ts:153:11
 function tokensOf(usage: Record<string, unknown>): Tokens {
 	return {
 		input: Number(usage.input_tokens) || 0,
-		output: Number(usage.output_tokens) || 0,
+		output: false,
 		cacheRead: Number(usage.cache_read_input_tokens) || 0,
 		cacheWrite: Number(usage.cache_creation_input_tokens) || 0,
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ConditionalExpression
extensions/claude-code.ts:154:14
 	return {
 		input: Number(usage.input_tokens) || 0,
 		output: Number(usage.output_tokens) || 0,
-		cacheRead: Number(usage.cache_read_input_tokens) || 0,
+		cacheRead: true,
 		cacheWrite: Number(usage.cache_creation_input_tokens) || 0,
 	};
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] LogicalOperator
extensions/claude-code.ts:154:14
 	return {
 		input: Number(usage.input_tokens) || 0,
 		output: Number(usage.output_tokens) || 0,
-		cacheRead: Number(usage.cache_read_input_tokens) || 0,
+		cacheRead: Number(usage.cache_read_input_tokens) && 0,
 		cacheWrite: Number(usage.cache_creation_input_tokens) || 0,
 	};
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Killed] LogicalOperator
extensions/claude-code.ts:155:15
 		input: Number(usage.input_tokens) || 0,
 		output: Number(usage.output_tokens) || 0,
 		cacheRead: Number(usage.cache_read_input_tokens) || 0,
-		cacheWrite: Number(usage.cache_creation_input_tokens) || 0,
+		cacheWrite: Number(usage.cache_creation_input_tokens) && 0,
 	};
 }
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ConditionalExpression
extensions/claude-code.ts:155:15
 		input: Number(usage.input_tokens) || 0,
 		output: Number(usage.output_tokens) || 0,
 		cacheRead: Number(usage.cache_read_input_tokens) || 0,
-		cacheWrite: Number(usage.cache_creation_input_tokens) || 0,
+		cacheWrite: true,
 	};
 }
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] BlockStatement
extensions/claude-code.ts:159:41
 	};
 }
 
-function totalTokens(t: Tokens): number {
-	return t.input + t.output + t.cacheRead + t.cacheWrite;
-}
+function totalTokens(t: Tokens): number {}
 
 /**
killedBy: test/claude-code.test.ts
statusReason: parseTurns skips lines that carry no usable usage: parseTurns skips lines that carry no usable usage

[Survived] ArithmeticOperator
extensions/claude-code.ts:160:9
 }
 
 function totalTokens(t: Tokens): number {
-	return t.input + t.output + t.cacheRead + t.cacheWrite;
+	return t.input - t.output + t.cacheRead + t.cacheWrite;
 }
 

[Survived] ArithmeticOperator
extensions/claude-code.ts:160:9
 }
 
 function totalTokens(t: Tokens): number {
-	return t.input + t.output + t.cacheRead + t.cacheWrite;
+	return t.input + t.output + t.cacheRead - t.cacheWrite;
 }
 

[Killed] BlockStatement
extensions/claude-code.ts:168:60
  * overwrite earlier ones rather than adding to them — within one response the usage
  * is a running total, not an increment.
  */
-export function parseTurns(text: string): TranscriptTurn[] {
-	const byKey = new Map<string, TranscriptTurn>();
-	for (const line of text.split("\n")) {
-		if (!line.trim()) continue;
-		let entry: Record<string, unknown>;
-		try {
-			entry = JSON.parse(line) as Record<string, unknown>;
-		} catch {
-			continue;
-		}
-		if (entry.type !== "assistant") continue;
-		const message = entry.message as Record<string, unknown> | undefined;
-		const usage = message?.usage as Record<string, unknown> | undefined;
-		if (!usage) continue;
-		// `requestId` identifies the API call; `message.id` is the same value's stand-in
-		// on builds that omit it. `uuid` is per *line*, so it must never be the key.
-		const key = String(entry.requestId ?? message?.id ?? "");
-		if (!key) continue;
-		const tokens = tokensOf(usage);
-		if (totalTokens(tokens) === 0) continue;
-		byKey.set(key, { key, model: message?.model ? String(message.model) : undefined, tokens });
-	}
-	return [...byKey.values()];
-}
+export function parseTurns(text: string): TranscriptTurn[] {}
 
 interface Chunk {
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] BlockStatement
extensions/claude-code.ts:170:39
  */
 export function parseTurns(text: string): TranscriptTurn[] {
 	const byKey = new Map<string, TranscriptTurn>();
-	for (const line of text.split("\n")) {
-		if (!line.trim()) continue;
-		let entry: Record<string, unknown>;
-		try {
-			entry = JSON.parse(line) as Record<string, unknown>;
-		} catch {
-			continue;
-		}
-		if (entry.type !== "assistant") continue;
-		const message = entry.message as Record<string, unknown> | undefined;
-		const usage = message?.usage as Record<string, unknown> | undefined;
-		if (!usage) continue;
-		// `requestId` identifies the API call; `message.id` is the same value's stand-in
-		// on builds that omit it. `uuid` is per *line*, so it must never be the key.
-		const key = String(entry.requestId ?? message?.id ?? "");
-		if (!key) continue;
-		const tokens = tokensOf(usage);
-		if (totalTokens(tokens) === 0) continue;
-		byKey.set(key, { key, model: message?.model ? String(message.model) : undefined, tokens });
-	}
+	for (const line of text.split("\n")) {}
 	return [...byKey.values()];
 }
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ConditionalExpression
extensions/claude-code.ts:171:7
 export function parseTurns(text: string): TranscriptTurn[] {
 	const byKey = new Map<string, TranscriptTurn>();
 	for (const line of text.split("\n")) {
-		if (!line.trim()) continue;
+		if (true) continue;
 		let entry: Record<string, unknown>;
 		try {
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] BooleanLiteral
extensions/claude-code.ts:171:7
 export function parseTurns(text: string): TranscriptTurn[] {
 	const byKey = new Map<string, TranscriptTurn>();
 	for (const line of text.split("\n")) {
-		if (!line.trim()) continue;
+		if (line.trim()) continue;
 		let entry: Record<string, unknown>;
 		try {
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] BlockStatement
extensions/claude-code.ts:173:7
 	for (const line of text.split("\n")) {
 		if (!line.trim()) continue;
 		let entry: Record<string, unknown>;
-		try {
-			entry = JSON.parse(line) as Record<string, unknown>;
-		} catch {
+		try {} catch {
 			continue;
 		}
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] BlockStatement
extensions/claude-code.ts:175:11
 		let entry: Record<string, unknown>;
 		try {
 			entry = JSON.parse(line) as Record<string, unknown>;
-		} catch {
-			continue;
-		}
+		} catch {}
 		if (entry.type !== "assistant") continue;
 		const message = entry.message as Record<string, unknown> | undefined;
killedBy: test/claude-code.test.ts
statusReason: parseTurns skips lines that carry no usable usage: parseTurns skips lines that carry no usable usage
