[Killed] EqualityOperator
extensions/claude-code.ts:178:7
 		} catch {
 			continue;
 		}
-		if (entry.type !== "assistant") continue;
+		if (entry.type === "assistant") continue;
 		const message = entry.message as Record<string, unknown> | undefined;
 		const usage = message?.usage as Record<string, unknown> | undefined;
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ConditionalExpression
extensions/claude-code.ts:178:7
 		} catch {
 			continue;
 		}
-		if (entry.type !== "assistant") continue;
+		if (true) continue;
 		const message = entry.message as Record<string, unknown> | undefined;
 		const usage = message?.usage as Record<string, unknown> | undefined;
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] BooleanLiteral
extensions/claude-code.ts:181:7
 		if (entry.type !== "assistant") continue;
 		const message = entry.message as Record<string, unknown> | undefined;
 		const usage = message?.usage as Record<string, unknown> | undefined;
-		if (!usage) continue;
+		if (usage) continue;
 		// `requestId` identifies the API call; `message.id` is the same value's stand-in
 		// on builds that omit it. `uuid` is per *line*, so it must never be the key.
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ConditionalExpression
extensions/claude-code.ts:181:7
 		if (entry.type !== "assistant") continue;
 		const message = entry.message as Record<string, unknown> | undefined;
 		const usage = message?.usage as Record<string, unknown> | undefined;
-		if (!usage) continue;
+		if (true) continue;
 		// `requestId` identifies the API call; `message.id` is the same value's stand-in
 		// on builds that omit it. `uuid` is per *line*, so it must never be the key.
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] LogicalOperator
extensions/claude-code.ts:184:22
 		if (!usage) continue;
 		// `requestId` identifies the API call; `message.id` is the same value's stand-in
 		// on builds that omit it. `uuid` is per *line*, so it must never be the key.
-		const key = String(entry.requestId ?? message?.id ?? "");
+		const key = String((entry.requestId ?? message?.id) && "");
 		if (!key) continue;
 		const tokens = tokensOf(usage);
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] LogicalOperator
extensions/claude-code.ts:184:22
 		if (!usage) continue;
 		// `requestId` identifies the API call; `message.id` is the same value's stand-in
 		// on builds that omit it. `uuid` is per *line*, so it must never be the key.
-		const key = String(entry.requestId ?? message?.id ?? "");
+		const key = String(entry.requestId && message?.id ?? "");
 		if (!key) continue;
 		const tokens = tokensOf(usage);
killedBy: test/claude-code.test.ts
statusReason: parseTurns skips lines that carry no usable usage: parseTurns skips lines that carry no usable usage

[Killed] ConditionalExpression
extensions/claude-code.ts:185:7
 		// `requestId` identifies the API call; `message.id` is the same value's stand-in
 		// on builds that omit it. `uuid` is per *line*, so it must never be the key.
 		const key = String(entry.requestId ?? message?.id ?? "");
-		if (!key) continue;
+		if (true) continue;
 		const tokens = tokensOf(usage);
 		if (totalTokens(tokens) === 0) continue;
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] BooleanLiteral
extensions/claude-code.ts:185:7
 		// `requestId` identifies the API call; `message.id` is the same value's stand-in
 		// on builds that omit it. `uuid` is per *line*, so it must never be the key.
 		const key = String(entry.requestId ?? message?.id ?? "");
-		if (!key) continue;
+		if (key) continue;
 		const tokens = tokensOf(usage);
 		if (totalTokens(tokens) === 0) continue;
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] EqualityOperator
extensions/claude-code.ts:187:7
 		const key = String(entry.requestId ?? message?.id ?? "");
 		if (!key) continue;
 		const tokens = tokensOf(usage);
-		if (totalTokens(tokens) === 0) continue;
+		if (totalTokens(tokens) !== 0) continue;
 		byKey.set(key, { key, model: message?.model ? String(message.model) : undefined, tokens });
 	}
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Killed] ConditionalExpression
extensions/claude-code.ts:187:7
 		const key = String(entry.requestId ?? message?.id ?? "");
 		if (!key) continue;
 		const tokens = tokensOf(usage);
-		if (totalTokens(tokens) === 0) continue;
+		if (true) continue;
 		byKey.set(key, { key, model: message?.model ? String(message.model) : undefined, tokens });
 	}
killedBy: test/claude-code.test.ts
statusReason: a response split across several lines is billed once, at its final size: a response split across several lines is billed once, at its final size

[Survived] OptionalChaining
extensions/claude-code.ts:188:32
 		if (!key) continue;
 		const tokens = tokensOf(usage);
 		if (totalTokens(tokens) === 0) continue;
-		byKey.set(key, { key, model: message?.model ? String(message.model) : undefined, tokens });
+		byKey.set(key, { key, model: message.model ? String(message.model) : undefined, tokens });
 	}
 	return [...byKey.values()];

[Killed] BlockStatement
extensions/claude-code.ts:205:6
 /** Read a transcript from `offset` to EOF, stopping at the last complete line. */
 export function readFrom(path: string, offset: number): Chunk | undefined {
 	let fd: number;
-	try {
-		fd = openSync(path, "r");
-	} catch {
+	try {} catch {
 		return undefined;
 	}
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] BlockStatement
extensions/claude-code.ts:207:10
 	let fd: number;
 	try {
 		fd = openSync(path, "r");
-	} catch {
-		return undefined;
-	}
+	} catch {}
 	try {
 		const size = fstatSync(fd).size;
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] BlockStatement
extensions/claude-code.ts:210:6
 	} catch {
 		return undefined;
 	}
-	try {
-		const size = fstatSync(fd).size;
-		// Shorter than what we already read: the file was rewritten (compaction does
-		// this). Re-reading it would re-bill every response whose key has aged out of
-		// the billed map, so re-anchor to the end and lose the rewrite instead.
-		if (size < offset) return { text: "", consumed: 0, reset: true, size };
-		if (size === offset) return { text: "", consumed: 0, reset: false, size };
-		const buf = Buffer.allocUnsafe(size - offset);
-		readSync(fd, buf, 0, buf.length, offset);
-		const text = buf.toString("utf8");
-		const cut = text.lastIndexOf("\n");
-		if (cut === -1) return { text: "", consumed: 0, reset: false, size };
-		const complete = text.slice(0, cut + 1);
-		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: false, size };
-	} catch {
+	try {} catch {
 		return undefined;
 	} finally {
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] EqualityOperator
extensions/claude-code.ts:215:7
 		// Shorter than what we already read: the file was rewritten (compaction does
 		// this). Re-reading it would re-bill every response whose key has aged out of
 		// the billed map, so re-anchor to the end and lose the rewrite instead.
-		if (size < offset) return { text: "", consumed: 0, reset: true, size };
+		if (size >= offset) return { text: "", consumed: 0, reset: true, size };
 		if (size === offset) return { text: "", consumed: 0, reset: false, size };
 		const buf = Buffer.allocUnsafe(size - offset);
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] ConditionalExpression
extensions/claude-code.ts:215:7
 		// Shorter than what we already read: the file was rewritten (compaction does
 		// this). Re-reading it would re-bill every response whose key has aged out of
 		// the billed map, so re-anchor to the end and lose the rewrite instead.
-		if (size < offset) return { text: "", consumed: 0, reset: true, size };
+		if (false) return { text: "", consumed: 0, reset: true, size };
 		if (size === offset) return { text: "", consumed: 0, reset: false, size };
 		const buf = Buffer.allocUnsafe(size - offset);
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] EqualityOperator
extensions/claude-code.ts:216:7
 		// this). Re-reading it would re-bill every response whose key has aged out of
 		// the billed map, so re-anchor to the end and lose the rewrite instead.
 		if (size < offset) return { text: "", consumed: 0, reset: true, size };
-		if (size === offset) return { text: "", consumed: 0, reset: false, size };
+		if (size !== offset) return { text: "", consumed: 0, reset: false, size };
 		const buf = Buffer.allocUnsafe(size - offset);
 		readSync(fd, buf, 0, buf.length, offset);
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] ConditionalExpression
extensions/claude-code.ts:216:7
 		// this). Re-reading it would re-bill every response whose key has aged out of
 		// the billed map, so re-anchor to the end and lose the rewrite instead.
 		if (size < offset) return { text: "", consumed: 0, reset: true, size };
-		if (size === offset) return { text: "", consumed: 0, reset: false, size };
+		if (true) return { text: "", consumed: 0, reset: false, size };
 		const buf = Buffer.allocUnsafe(size - offset);
 		readSync(fd, buf, 0, buf.length, offset);
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] ArithmeticOperator
extensions/claude-code.ts:217:34
 		// the billed map, so re-anchor to the end and lose the rewrite instead.
 		if (size < offset) return { text: "", consumed: 0, reset: true, size };
 		if (size === offset) return { text: "", consumed: 0, reset: false, size };
-		const buf = Buffer.allocUnsafe(size - offset);
+		const buf = Buffer.allocUnsafe(size + offset);
 		readSync(fd, buf, 0, buf.length, offset);
 		const text = buf.toString("utf8");
killedBy: test/claude-code.test.ts
statusReason: the billed-response record stays bounded across a long session: the billed-response record stays bounded across a long session

[Killed] CallExpression
extensions/claude-code.ts:218:3
 		if (size < offset) return { text: "", consumed: 0, reset: true, size };
 		if (size === offset) return { text: "", consumed: 0, reset: false, size };
 		const buf = Buffer.allocUnsafe(size - offset);
-		readSync(fd, buf, 0, buf.length, offset);
+		;
 		const text = buf.toString("utf8");
 		const cut = text.lastIndexOf("\n");
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] StringLiteral
extensions/claude-code.ts:219:29
 		if (size === offset) return { text: "", consumed: 0, reset: false, size };
 		const buf = Buffer.allocUnsafe(size - offset);
 		readSync(fd, buf, 0, buf.length, offset);
-		const text = buf.toString("utf8");
+		const text = buf.toString("");
 		const cut = text.lastIndexOf("\n");
 		if (cut === -1) return { text: "", consumed: 0, reset: false, size };
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] ConditionalExpression
extensions/claude-code.ts:221:7
 		readSync(fd, buf, 0, buf.length, offset);
 		const text = buf.toString("utf8");
 		const cut = text.lastIndexOf("\n");
-		if (cut === -1) return { text: "", consumed: 0, reset: false, size };
+		if (true) return { text: "", consumed: 0, reset: false, size };
 		const complete = text.slice(0, cut + 1);
 		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: false, size };
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] EqualityOperator
extensions/claude-code.ts:221:7
 		readSync(fd, buf, 0, buf.length, offset);
 		const text = buf.toString("utf8");
 		const cut = text.lastIndexOf("\n");
-		if (cut === -1) return { text: "", consumed: 0, reset: false, size };
+		if (cut !== -1) return { text: "", consumed: 0, reset: false, size };
 		const complete = text.slice(0, cut + 1);
 		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: false, size };
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] MethodExpression
extensions/claude-code.ts:222:20
 		const text = buf.toString("utf8");
 		const cut = text.lastIndexOf("\n");
 		if (cut === -1) return { text: "", consumed: 0, reset: false, size };
-		const complete = text.slice(0, cut + 1);
+		const complete = text;
 		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: false, size };
 	} catch {
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] ArithmeticOperator
extensions/claude-code.ts:222:34
 		const text = buf.toString("utf8");
 		const cut = text.lastIndexOf("\n");
 		if (cut === -1) return { text: "", consumed: 0, reset: false, size };
-		const complete = text.slice(0, cut + 1);
+		const complete = text.slice(0, cut - 1);
 		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: false, size };
 	} catch {
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Killed] BooleanLiteral
extensions/claude-code.ts:223:82
 		const cut = text.lastIndexOf("\n");
 		if (cut === -1) return { text: "", consumed: 0, reset: false, size };
 		const complete = text.slice(0, cut + 1);
-		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: false, size };
+		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: true, size };
 	} catch {
 		return undefined;
killedBy: test/claude-code.test.ts
statusReason: readFrom stops at the last complete line and reports what it consumed: readFrom stops at the last complete line and reports what it consumed

[Survived] StringLiteral
extensions/claude-code.ts:223:66
 		const cut = text.lastIndexOf("\n");
 		if (cut === -1) return { text: "", consumed: 0, reset: false, size };
 		const complete = text.slice(0, cut + 1);
-		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: false, size };
+		return { text: complete, consumed: Buffer.byteLength(complete, ""), reset: false, size };
 	} catch {
 		return undefined;

[NoCoverage] BlockStatement
extensions/claude-code.ts:224:10
 		if (cut === -1) return { text: "", consumed: 0, reset: false, size };
 		const complete = text.slice(0, cut + 1);
 		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: false, size };
-	} catch {
-		return undefined;
-	} finally {
+	} catch {} finally {
 		closeSync(fd);
 	}

[Survived] BlockStatement
extensions/claude-code.ts:226:12
 		return { text: complete, consumed: Buffer.byteLength(complete, "utf8"), reset: false, size };
 	} catch {
 		return undefined;
-	} finally {
-		closeSync(fd);
-	}
+	} finally {}
 }
 

[Survived] CallExpression
extensions/claude-code.ts:227:3
 	} catch {
 		return undefined;
 	} finally {
-		closeSync(fd);
+		;
 	}
 }

[Killed] BlockStatement
extensions/claude-code.ts:232:85
 }
 
 /** What is left to bill for a turn, given what has been billed already. */
-export function unbilled(turn: TranscriptTurn, already: Tokens | undefined): Tokens {
-	if (!already) return turn.tokens;
-	return {
-		input: Math.max(0, turn.tokens.input - already.input),
-		output: Math.max(0, turn.tokens.output - already.output),
-		cacheRead: Math.max(0, turn.tokens.cacheRead - already.cacheRead),
-		cacheWrite: Math.max(0, turn.tokens.cacheWrite - already.cacheWrite),
-	};
-}
+export function unbilled(turn: TranscriptTurn, already: Tokens | undefined): Tokens {}
 
 function safe(fn: () => HookOutput | undefined): HookOutput | undefined {
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] ConditionalExpression
extensions/claude-code.ts:233:6
 
 /** What is left to bill for a turn, given what has been billed already. */
 export function unbilled(turn: TranscriptTurn, already: Tokens | undefined): Tokens {
-	if (!already) return turn.tokens;
+	if (true) return turn.tokens;
 	return {
 		input: Math.max(0, turn.tokens.input - already.input),
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] ConditionalExpression
extensions/claude-code.ts:233:6
 
 /** What is left to bill for a turn, given what has been billed already. */
 export function unbilled(turn: TranscriptTurn, already: Tokens | undefined): Tokens {
-	if (!already) return turn.tokens;
+	if (false) return turn.tokens;
 	return {
 		input: Math.max(0, turn.tokens.input - already.input),
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] MethodExpression
extensions/claude-code.ts:235:10
 export function unbilled(turn: TranscriptTurn, already: Tokens | undefined): Tokens {
 	if (!already) return turn.tokens;
 	return {
-		input: Math.max(0, turn.tokens.input - already.input),
+		input: Math.min(0, turn.tokens.input - already.input),
 		output: Math.max(0, turn.tokens.output - already.output),
 		cacheRead: Math.max(0, turn.tokens.cacheRead - already.cacheRead),
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] ArithmeticOperator
extensions/claude-code.ts:235:22
 export function unbilled(turn: TranscriptTurn, already: Tokens | undefined): Tokens {
 	if (!already) return turn.tokens;
 	return {
-		input: Math.max(0, turn.tokens.input - already.input),
+		input: Math.max(0, turn.tokens.input + already.input),
 		output: Math.max(0, turn.tokens.output - already.output),
 		cacheRead: Math.max(0, turn.tokens.cacheRead - already.cacheRead),
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] ArithmeticOperator
extensions/claude-code.ts:236:23
 	if (!already) return turn.tokens;
 	return {
 		input: Math.max(0, turn.tokens.input - already.input),
-		output: Math.max(0, turn.tokens.output - already.output),
+		output: Math.max(0, turn.tokens.output + already.output),
 		cacheRead: Math.max(0, turn.tokens.cacheRead - already.cacheRead),
 		cacheWrite: Math.max(0, turn.tokens.cacheWrite - already.cacheWrite),
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] MethodExpression
extensions/claude-code.ts:236:11
 	if (!already) return turn.tokens;
 	return {
 		input: Math.max(0, turn.tokens.input - already.input),
-		output: Math.max(0, turn.tokens.output - already.output),
+		output: Math.min(0, turn.tokens.output - already.output),
 		cacheRead: Math.max(0, turn.tokens.cacheRead - already.cacheRead),
 		cacheWrite: Math.max(0, turn.tokens.cacheWrite - already.cacheWrite),
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] ArithmeticOperator
extensions/claude-code.ts:237:26
 	return {
 		input: Math.max(0, turn.tokens.input - already.input),
 		output: Math.max(0, turn.tokens.output - already.output),
-		cacheRead: Math.max(0, turn.tokens.cacheRead - already.cacheRead),
+		cacheRead: Math.max(0, turn.tokens.cacheRead + already.cacheRead),
 		cacheWrite: Math.max(0, turn.tokens.cacheWrite - already.cacheWrite),
 	};
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] MethodExpression
extensions/claude-code.ts:237:14
 	return {
 		input: Math.max(0, turn.tokens.input - already.input),
 		output: Math.max(0, turn.tokens.output - already.output),
-		cacheRead: Math.max(0, turn.tokens.cacheRead - already.cacheRead),
+		cacheRead: Math.min(0, turn.tokens.cacheRead - already.cacheRead),
 		cacheWrite: Math.max(0, turn.tokens.cacheWrite - already.cacheWrite),
 	};
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] ArithmeticOperator
extensions/claude-code.ts:238:27
 		input: Math.max(0, turn.tokens.input - already.input),
 		output: Math.max(0, turn.tokens.output - already.output),
 		cacheRead: Math.max(0, turn.tokens.cacheRead - already.cacheRead),
-		cacheWrite: Math.max(0, turn.tokens.cacheWrite - already.cacheWrite),
+		cacheWrite: Math.max(0, turn.tokens.cacheWrite + already.cacheWrite),
 	};
 }
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Killed] MethodExpression
extensions/claude-code.ts:238:15
 		input: Math.max(0, turn.tokens.input - already.input),
 		output: Math.max(0, turn.tokens.output - already.output),
 		cacheRead: Math.max(0, turn.tokens.cacheRead - already.cacheRead),
-		cacheWrite: Math.max(0, turn.tokens.cacheWrite - already.cacheWrite),
+		cacheWrite: Math.min(0, turn.tokens.cacheWrite - already.cacheWrite),
 	};
 }
killedBy: test/claude-code.test.ts
statusReason: only the increase is billed when a response is seen again: only the increase is billed when a response is seen again

[Survived] BlockStatement
extensions/claude-code.ts:242:73
 	};
 }
 
-function safe(fn: () => HookOutput | undefined): HookOutput | undefined {
-	try {
-		return fn();
-	} catch {
-		// Metrics must never break a session.
-		return undefined;
-	}
-}
+function safe(fn: () => HookOutput | undefined): HookOutput | undefined {}
 
 /**

[Survived] BlockStatement
extensions/claude-code.ts:243:6
 }
 
 function safe(fn: () => HookOutput | undefined): HookOutput | undefined {
-	try {
-		return fn();
-	} catch {
+	try {} catch {
 		// Metrics must never break a session.
 		return undefined;

[Survived] BlockStatement
extensions/claude-code.ts:245:10
 function safe(fn: () => HookOutput | undefined): HookOutput | undefined {
 	try {
 		return fn();
-	} catch {
-		// Metrics must never break a session.
-		return undefined;
-	}
+	} catch {}
 }
 

[Killed] BlockStatement
extensions/claude-code.ts:258:87
  * conductor typed. Host decides which population a run is compared within, so a
  * disagreement resolves toward whoever is actually running the work.
  */
-function resolveRun(host: Host, state: SessionState, cwd: string): string | undefined {
-	if (state.run_id) return state.run_id;
-	const run = host.store.latestOpenForCwd(cwd);
-	if (!run) return undefined;
-	if (run.host !== "claude-code") host.store.setHost(run.run_id, "claude-code");
-	state.run_id = run.run_id;
-	return run.run_id;
-}
+function resolveRun(host: Host, state: SessionState, cwd: string): string | undefined {}
 
 /** Bill every turn in a transcript that has not been billed yet. */
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ConditionalExpression
extensions/claude-code.ts:259:6
  * disagreement resolves toward whoever is actually running the work.
  */
 function resolveRun(host: Host, state: SessionState, cwd: string): string | undefined {
-	if (state.run_id) return state.run_id;
+	if (true) return state.run_id;
 	const run = host.store.latestOpenForCwd(cwd);
 	if (!run) return undefined;
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Survived] ConditionalExpression
extensions/claude-code.ts:259:6
  * disagreement resolves toward whoever is actually running the work.
  */
 function resolveRun(host: Host, state: SessionState, cwd: string): string | undefined {
-	if (state.run_id) return state.run_id;
+	if (false) return state.run_id;
 	const run = host.store.latestOpenForCwd(cwd);
 	if (!run) return undefined;

[Killed] ConditionalExpression
extensions/claude-code.ts:261:6
 function resolveRun(host: Host, state: SessionState, cwd: string): string | undefined {
 	if (state.run_id) return state.run_id;
 	const run = host.store.latestOpenForCwd(cwd);
-	if (!run) return undefined;
+	if (false) return undefined;
 	if (run.host !== "claude-code") host.store.setHost(run.run_id, "claude-code");
 	state.run_id = run.run_id;
killedBy: test/claude-code.test.ts
statusReason: a session with no craft run records nothing at all: a session with no craft run records nothing at all

[Killed] ConditionalExpression
extensions/claude-code.ts:261:6
 function resolveRun(host: Host, state: SessionState, cwd: string): string | undefined {
 	if (state.run_id) return state.run_id;
 	const run = host.store.latestOpenForCwd(cwd);
-	if (!run) return undefined;
+	if (true) return undefined;
 	if (run.host !== "claude-code") host.store.setHost(run.run_id, "claude-code");
 	state.run_id = run.run_id;
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] EqualityOperator
extensions/claude-code.ts:262:6
 	if (state.run_id) return state.run_id;
 	const run = host.store.latestOpenForCwd(cwd);
 	if (!run) return undefined;
-	if (run.host !== "claude-code") host.store.setHost(run.run_id, "claude-code");
+	if (run.host === "claude-code") host.store.setHost(run.run_id, "claude-code");
 	state.run_id = run.run_id;
 	return run.run_id;
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] ConditionalExpression
extensions/claude-code.ts:262:6
 	if (state.run_id) return state.run_id;
 	const run = host.store.latestOpenForCwd(cwd);
 	if (!run) return undefined;
-	if (run.host !== "claude-code") host.store.setHost(run.run_id, "claude-code");
+	if (true) host.store.setHost(run.run_id, "claude-code");
 	state.run_id = run.run_id;
 	return run.run_id;
killedBy: test/claude-code.test.ts
statusReason: a run already filed under this harness is not re-stamped on every session: a run already filed under this harness is not re-stamped on every session

[Killed] LogicalOperator
extensions/claude-code.ts:275:31
 	path: string,
 	opts: { offset?: number; subagent?: boolean; agent?: string; thinking?: string } = {},
 ): number {
-	const chunk = readFrom(path, opts.offset ?? 0);
+	const chunk = readFrom(path, opts.offset && 0);
 	if (!chunk) return opts.offset ?? 0;
 	if (chunk.reset) return chunk.size;
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's
