[Killed] ConditionalExpression
extensions/claude-code.ts:276:6
 	opts: { offset?: number; subagent?: boolean; agent?: string; thinking?: string } = {},
 ): number {
 	const chunk = readFrom(path, opts.offset ?? 0);
-	if (!chunk) return opts.offset ?? 0;
+	if (false) return opts.offset ?? 0;
 	if (chunk.reset) return chunk.size;
 	const phase = host.store.openPhase(runId);
killedBy: test/claude-code.test.ts
statusReason: a SubagentStop with no transcript to read bills nothing and breaks nothing: a SubagentStop with no transcript to read bills nothing and breaks nothing

[Killed] BooleanLiteral
extensions/claude-code.ts:276:6
 	opts: { offset?: number; subagent?: boolean; agent?: string; thinking?: string } = {},
 ): number {
 	const chunk = readFrom(path, opts.offset ?? 0);
-	if (!chunk) return opts.offset ?? 0;
+	if (chunk) return opts.offset ?? 0;
 	if (chunk.reset) return chunk.size;
 	const phase = host.store.openPhase(runId);
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ConditionalExpression
extensions/claude-code.ts:277:6
 ): number {
 	const chunk = readFrom(path, opts.offset ?? 0);
 	if (!chunk) return opts.offset ?? 0;
-	if (chunk.reset) return chunk.size;
+	if (true) return chunk.size;
 	const phase = host.store.openPhase(runId);
 	for (const turn of parseTurns(chunk.text)) {
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Survived] ConditionalExpression
extensions/claude-code.ts:277:6
 ): number {
 	const chunk = readFrom(path, opts.offset ?? 0);
 	if (!chunk) return opts.offset ?? 0;
-	if (chunk.reset) return chunk.size;
+	if (false) return chunk.size;
 	const phase = host.store.openPhase(runId);
 	for (const turn of parseTurns(chunk.text)) {

[Killed] EqualityOperator
extensions/claude-code.ts:281:17
 	const phase = host.store.openPhase(runId);
 	for (const turn of parseTurns(chunk.text)) {
 		const delta = unbilled(turn, state.billed[turn.key]);
-		const first = state.billed[turn.key] === undefined;
+		const first = state.billed[turn.key] !== undefined;
 		state.billed[turn.key] = turn.tokens;
 		if (totalTokens(delta) === 0) continue;
killedBy: test/claude-code.test.ts
statusReason: the billed-response record stays bounded across a long session: the billed-response record stays bounded across a long session

[Killed] ConditionalExpression
extensions/claude-code.ts:281:17
 	const phase = host.store.openPhase(runId);
 	for (const turn of parseTurns(chunk.text)) {
 		const delta = unbilled(turn, state.billed[turn.key]);
-		const first = state.billed[turn.key] === undefined;
+		const first = true;
 		state.billed[turn.key] = turn.tokens;
 		if (totalTokens(delta) === 0) continue;
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] EqualityOperator
extensions/claude-code.ts:283:7
 		const delta = unbilled(turn, state.billed[turn.key]);
 		const first = state.billed[turn.key] === undefined;
 		state.billed[turn.key] = turn.tokens;
-		if (totalTokens(delta) === 0) continue;
+		if (totalTokens(delta) !== 0) continue;
 		host.store.recordUsage(
 			runId,
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ConditionalExpression
extensions/claude-code.ts:283:7
 		const delta = unbilled(turn, state.billed[turn.key]);
 		const first = state.billed[turn.key] === undefined;
 		state.billed[turn.key] = turn.tokens;
-		if (totalTokens(delta) === 0) continue;
+		if (true) continue;
 		host.store.recordUsage(
 			runId,
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ObjectLiteral
extensions/claude-code.ts:286:4
 		if (totalTokens(delta) === 0) continue;
 		host.store.recordUsage(
 			runId,
-			{
-				phase,
-				model: turn.model ? `anthropic/${turn.model}` : undefined,
-				provider: "anthropic",
-				thinking: opts.thinking,
-				tokens: delta,
-				// Claude Code reports no cost of its own. Recording 0 rather than
-				// omitting it keeps `cost_usd` meaning "what you paid" — notional
-				// pricing is what makes the phase comparable to a metered one.
-				cost_usd: 0,
-				// A response split across several lines is still one turn, counted when
-				// its first line arrives.
-				turns: first ? 1 : 0,
-				subagent: opts.subagent,
-				agent: opts.agent,
-			},
+			{},
 			false,
 		);
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] StringLiteral
extensions/claude-code.ts:288:25
 			runId,
 			{
 				phase,
-				model: turn.model ? `anthropic/${turn.model}` : undefined,
+				model: turn.model ? `` : undefined,
 				provider: "anthropic",
 				thinking: opts.thinking,
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Survived] BooleanLiteral
extensions/claude-code.ts:302:4
 				subagent: opts.subagent,
 				agent: opts.agent,
 			},
-			false,
+			true,
 		);
 	}

[Killed] LogicalOperator
extensions/claude-code.ts:305:10
 			false,
 		);
 	}
-	return (opts.offset ?? 0) + chunk.consumed;
+	return (opts.offset && 0) + chunk.consumed;
 }
 
killedBy: test/claude-code.test.ts
statusReason: the billed-response record stays bounded across a long session: the billed-response record stays bounded across a long session

[Killed] ArithmeticOperator
extensions/claude-code.ts:305:9
 			false,
 		);
 	}
-	return (opts.offset ?? 0) + chunk.consumed;
+	return (opts.offset ?? 0) - chunk.consumed;
 }
 
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] BlockStatement
extensions/claude-code.ts:308:60
 	return (opts.offset ?? 0) + chunk.consumed;
 }
 
-function effortLevel(event: HookEvent): string | undefined {
-	if (typeof event.effort === "string") return event.effort;
-	return event.effort?.level;
-}
+function effortLevel(event: HookEvent): string | undefined {}
 
 export function handleHook(event: HookEvent, host: Host): HookOutput | undefined {
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ConditionalExpression
extensions/claude-code.ts:309:6
 }
 
 function effortLevel(event: HookEvent): string | undefined {
-	if (typeof event.effort === "string") return event.effort;
+	if (false) return event.effort;
 	return event.effort?.level;
 }
killedBy: test/claude-code.test.ts
statusReason: the effort level is read whichever shape the host sends it in: the effort level is read whichever shape the host sends it in

[Killed] ConditionalExpression
extensions/claude-code.ts:309:6
 }
 
 function effortLevel(event: HookEvent): string | undefined {
-	if (typeof event.effort === "string") return event.effort;
+	if (true) return event.effort;
 	return event.effort?.level;
 }
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] OptionalChaining
extensions/claude-code.ts:310:9
 
 function effortLevel(event: HookEvent): string | undefined {
 	if (typeof event.effort === "string") return event.effort;
-	return event.effort?.level;
+	return event.effort.level;
 }
 
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Killed] BooleanLiteral
extensions/claude-code.ts:316:6
 export function handleHook(event: HookEvent, host: Host): HookOutput | undefined {
 	const sessionId = event.session_id;
 	const cwd = event.cwd;
-	if (!sessionId || !cwd) return undefined;
+	if (sessionId || !cwd) return undefined;
 	const state = readState(host, sessionId);
 
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ConditionalExpression
extensions/claude-code.ts:316:6
 export function handleHook(event: HookEvent, host: Host): HookOutput | undefined {
 	const sessionId = event.session_id;
 	const cwd = event.cwd;
-	if (!sessionId || !cwd) return undefined;
+	if (true) return undefined;
 	const state = readState(host, sessionId);
 
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Survived] ConditionalExpression
extensions/claude-code.ts:320:3
 	const state = readState(host, sessionId);
 
 	switch (event.hook_event_name) {
-		case "SessionStart": {
-			if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
-			return undefined;
-		}
+		case "SessionStart":
 
 		case "UserPromptSubmit": {

[Survived] BlockStatement
extensions/claude-code.ts:320:24
 	const state = readState(host, sessionId);
 
 	switch (event.hook_event_name) {
-		case "SessionStart": {
-			if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
-			return undefined;
-		}
+		case "SessionStart": {}
 
 		case "UserPromptSubmit": {

[Killed] ConditionalExpression
extensions/claude-code.ts:321:8
 
 	switch (event.hook_event_name) {
 		case "SessionStart": {
-			if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
+			if (false) writeState(host, sessionId, state);
 			return undefined;
 		}
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] ConditionalExpression
extensions/claude-code.ts:321:8
 
 	switch (event.hook_event_name) {
 		case "SessionStart": {
-			if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
+			if (true) writeState(host, sessionId, state);
 			return undefined;
 		}
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] BlockStatement
extensions/claude-code.ts:325:28
 			return undefined;
 		}
 
-		case "UserPromptSubmit": {
-			const mode = parseCraftMode(event.prompt ?? "");
-			if (!mode) {
-				if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
-				return undefined;
-			}
-			// `openRun` dedupes on the open run for this cwd, so opening here before the
-			// skill reaches its own `start` is the same benign race pi already handles.
-			const run = host.store.openRun({ host: "claude-code", cwd, repo: basename(cwd), mode });
-			state.run_id = run.run_id;
-			writeState(host, sessionId, state);
-			return undefined;
-		}
+		case "UserPromptSubmit": {}
 
 		case "PreToolUse": {
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] ConditionalExpression
extensions/claude-code.ts:325:3
 			return undefined;
 		}
 
-		case "UserPromptSubmit": {
-			const mode = parseCraftMode(event.prompt ?? "");
-			if (!mode) {
-				if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
-				return undefined;
-			}
-			// `openRun` dedupes on the open run for this cwd, so opening here before the
-			// skill reaches its own `start` is the same benign race pi already handles.
-			const run = host.store.openRun({ host: "claude-code", cwd, repo: basename(cwd), mode });
-			state.run_id = run.run_id;
-			writeState(host, sessionId, state);
-			return undefined;
-		}
+		case "UserPromptSubmit":
 
 		case "PreToolUse": {
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] LogicalOperator
extensions/claude-code.ts:326:32
 		}
 
 		case "UserPromptSubmit": {
-			const mode = parseCraftMode(event.prompt ?? "");
+			const mode = parseCraftMode(event.prompt && "");
 			if (!mode) {
 				if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[NoCoverage] StringLiteral
extensions/claude-code.ts:326:48
 		}
 
 		case "UserPromptSubmit": {
-			const mode = parseCraftMode(event.prompt ?? "");
+			const mode = parseCraftMode(event.prompt ?? "Stryker was here!");
 			if (!mode) {
 				if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);

[Killed] ConditionalExpression
extensions/claude-code.ts:327:8
 
 		case "UserPromptSubmit": {
 			const mode = parseCraftMode(event.prompt ?? "");
-			if (!mode) {
+			if (true) {
 				if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
 				return undefined;
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Killed] BooleanLiteral
extensions/claude-code.ts:327:8
 
 		case "UserPromptSubmit": {
 			const mode = parseCraftMode(event.prompt ?? "");
-			if (!mode) {
+			if (mode) {
 				if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
 				return undefined;
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[NoCoverage] ConditionalExpression
extensions/claude-code.ts:328:9
 		case "UserPromptSubmit": {
 			const mode = parseCraftMode(event.prompt ?? "");
 			if (!mode) {
-				if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
+				if (true) writeState(host, sessionId, state);
 				return undefined;
 			}

[NoCoverage] CallExpression
extensions/claude-code.ts:328:39
 		case "UserPromptSubmit": {
 			const mode = parseCraftMode(event.prompt ?? "");
 			if (!mode) {
-				if (resolveRun(host, state, cwd)) writeState(host, sessionId, state);
+				if (resolveRun(host, state, cwd)) ;
 				return undefined;
 			}

[Killed] StringLiteral
extensions/claude-code.ts:333:43
 			}
 			// `openRun` dedupes on the open run for this cwd, so opening here before the
 			// skill reaches its own `start` is the same benign race pi already handles.
-			const run = host.store.openRun({ host: "claude-code", cwd, repo: basename(cwd), mode });
+			const run = host.store.openRun({ host: "", cwd, repo: basename(cwd), mode });
 			state.run_id = run.run_id;
 			writeState(host, sessionId, state);
killedBy: test/claude-code.test.ts
statusReason: a craft prompt opens a run, and the adapter stamps its own host: a craft prompt opens a run, and the adapter stamps its own host

[Survived] CallExpression
extensions/claude-code.ts:335:4
 			// skill reaches its own `start` is the same benign race pi already handles.
 			const run = host.store.openRun({ host: "claude-code", cwd, repo: basename(cwd), mode });
 			state.run_id = run.run_id;
-			writeState(host, sessionId, state);
+			;
 			return undefined;
 		}

[Killed] BlockStatement
extensions/claude-code.ts:339:22
 			return undefined;
 		}
 
-		case "PreToolUse": {
-			// Blinding enforcement. The hook can rewrite the tool's input before it runs,
-			// so the reviewer physically cannot receive an authorship signal — this does
-			// not depend on the conductor having composed the payload correctly.
-			if (!SUBAGENT_TOOLS.has(event.tool_name ?? "")) return undefined;
-			const input = event.tool_input;
-			if (!input) return undefined;
-			const agent = String(input.subagent_type ?? "");
-			if (!BLIND_TARGETS.has(agent)) return undefined;
-			const hits = scrubPayload(input, agent);
-			if (hits.length === 0) return undefined;
-			const runId = resolveRun(host, state, cwd);
-			if (runId) {
-				host.store.recordUsage(runId, { phase: host.store.openPhase(runId), blinding_scrubs: hits.length }, false);
-			}
-			writeState(host, sessionId, state);
-			return {
-				hookSpecificOutput: { hookEventName: "PreToolUse", updatedInput: input },
-				systemMessage: `craft: blinded ${hits.length} authorship signal${hits.length === 1 ? "" : "s"} → ${agent}`,
-			};
-		}
+		case "PreToolUse": {}
 
 		case "PostToolUse":
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
extensions/claude-code.ts:339:3
 			return undefined;
 		}
 
-		case "PreToolUse": {
-			// Blinding enforcement. The hook can rewrite the tool's input before it runs,
-			// so the reviewer physically cannot receive an authorship signal — this does
-			// not depend on the conductor having composed the payload correctly.
-			if (!SUBAGENT_TOOLS.has(event.tool_name ?? "")) return undefined;
-			const input = event.tool_input;
-			if (!input) return undefined;
-			const agent = String(input.subagent_type ?? "");
-			if (!BLIND_TARGETS.has(agent)) return undefined;
-			const hits = scrubPayload(input, agent);
-			if (hits.length === 0) return undefined;
-			const runId = resolveRun(host, state, cwd);
-			if (runId) {
-				host.store.recordUsage(runId, { phase: host.store.openPhase(runId), blinding_scrubs: hits.length }, false);
-			}
-			writeState(host, sessionId, state);
-			return {
-				hookSpecificOutput: { hookEventName: "PreToolUse", updatedInput: input },
-				systemMessage: `craft: blinded ${hits.length} authorship signal${hits.length === 1 ? "" : "s"} → ${agent}`,
-			};
-		}
+		case "PreToolUse":
 
 		case "PostToolUse":
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
extensions/claude-code.ts:343:8
 			// Blinding enforcement. The hook can rewrite the tool's input before it runs,
 			// so the reviewer physically cannot receive an authorship signal — this does
 			// not depend on the conductor having composed the payload correctly.
-			if (!SUBAGENT_TOOLS.has(event.tool_name ?? "")) return undefined;
+			if (true) return undefined;
 			const input = event.tool_input;
 			if (!input) return undefined;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BooleanLiteral
extensions/claude-code.ts:343:8
 			// Blinding enforcement. The hook can rewrite the tool's input before it runs,
 			// so the reviewer physically cannot receive an authorship signal — this does
 			// not depend on the conductor having composed the payload correctly.
-			if (!SUBAGENT_TOOLS.has(event.tool_name ?? "")) return undefined;
+			if (SUBAGENT_TOOLS.has(event.tool_name ?? "")) return undefined;
 			const input = event.tool_input;
 			if (!input) return undefined;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BooleanLiteral
extensions/claude-code.ts:345:8
 			// not depend on the conductor having composed the payload correctly.
 			if (!SUBAGENT_TOOLS.has(event.tool_name ?? "")) return undefined;
 			const input = event.tool_input;
-			if (!input) return undefined;
+			if (input) return undefined;
 			const agent = String(input.subagent_type ?? "");
 			if (!BLIND_TARGETS.has(agent)) return undefined;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
extensions/claude-code.ts:345:8
 			// not depend on the conductor having composed the payload correctly.
 			if (!SUBAGENT_TOOLS.has(event.tool_name ?? "")) return undefined;
 			const input = event.tool_input;
-			if (!input) return undefined;
+			if (true) return undefined;
 			const agent = String(input.subagent_type ?? "");
 			if (!BLIND_TARGETS.has(agent)) return undefined;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] LogicalOperator
extensions/claude-code.ts:346:25
 			if (!SUBAGENT_TOOLS.has(event.tool_name ?? "")) return undefined;
 			const input = event.tool_input;
 			if (!input) return undefined;
-			const agent = String(input.subagent_type ?? "");
+			const agent = String(input.subagent_type && "");
 			if (!BLIND_TARGETS.has(agent)) return undefined;
 			const hits = scrubPayload(input, agent);
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
extensions/claude-code.ts:347:8
 			const input = event.tool_input;
 			if (!input) return undefined;
 			const agent = String(input.subagent_type ?? "");
-			if (!BLIND_TARGETS.has(agent)) return undefined;
+			if (false) return undefined;
 			const hits = scrubPayload(input, agent);
 			if (hits.length === 0) return undefined;
killedBy: test/claude-code.test.ts
statusReason: a non-reviewer agent's payload is passed through untouched: a non-reviewer agent's payload is passed through untouched

[Killed] ConditionalExpression
extensions/claude-code.ts:347:8
 			const input = event.tool_input;
 			if (!input) return undefined;
 			const agent = String(input.subagent_type ?? "");
-			if (!BLIND_TARGETS.has(agent)) return undefined;
+			if (true) return undefined;
 			const hits = scrubPayload(input, agent);
 			if (hits.length === 0) return undefined;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
extensions/claude-code.ts:349:8
 			const agent = String(input.subagent_type ?? "");
 			if (!BLIND_TARGETS.has(agent)) return undefined;
 			const hits = scrubPayload(input, agent);
-			if (hits.length === 0) return undefined;
+			if (true) return undefined;
 			const runId = resolveRun(host, state, cwd);
 			if (runId) {
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] EqualityOperator
extensions/claude-code.ts:349:8
 			const agent = String(input.subagent_type ?? "");
 			if (!BLIND_TARGETS.has(agent)) return undefined;
 			const hits = scrubPayload(input, agent);
-			if (hits.length === 0) return undefined;
+			if (hits.length !== 0) return undefined;
 			const runId = resolveRun(host, state, cwd);
 			if (runId) {
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
extensions/claude-code.ts:351:8
 			const hits = scrubPayload(input, agent);
 			if (hits.length === 0) return undefined;
 			const runId = resolveRun(host, state, cwd);
-			if (runId) {
+			if (false) {
 				host.store.recordUsage(runId, { phase: host.store.openPhase(runId), blinding_scrubs: hits.length }, false);
 			}
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BlockStatement
extensions/claude-code.ts:351:15
 			const hits = scrubPayload(input, agent);
 			if (hits.length === 0) return undefined;
 			const runId = resolveRun(host, state, cwd);
-			if (runId) {
-				host.store.recordUsage(runId, { phase: host.store.openPhase(runId), blinding_scrubs: hits.length }, false);
-			}
+			if (runId) {}
 			writeState(host, sessionId, state);
 			return {
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Survived] BooleanLiteral
extensions/claude-code.ts:352:105
 			if (hits.length === 0) return undefined;
 			const runId = resolveRun(host, state, cwd);
 			if (runId) {
-				host.store.recordUsage(runId, { phase: host.store.openPhase(runId), blinding_scrubs: hits.length }, false);
+				host.store.recordUsage(runId, { phase: host.store.openPhase(runId), blinding_scrubs: hits.length }, true);
 			}
 			writeState(host, sessionId, state);

[Killed] ObjectLiteral
extensions/claude-code.ts:352:35
 			if (hits.length === 0) return undefined;
 			const runId = resolveRun(host, state, cwd);
 			if (runId) {
-				host.store.recordUsage(runId, { phase: host.store.openPhase(runId), blinding_scrubs: hits.length }, false);
+				host.store.recordUsage(runId, {}, false);
 			}
 			writeState(host, sessionId, state);
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Survived] CallExpression
extensions/claude-code.ts:354:4
 			if (runId) {
 				host.store.recordUsage(runId, { phase: host.store.openPhase(runId), blinding_scrubs: hits.length }, false);
 			}
-			writeState(host, sessionId, state);
+			;
 			return {
 				hookSpecificOutput: { hookEventName: "PreToolUse", updatedInput: input },

[Killed] StringLiteral
extensions/claude-code.ts:356:42
 			}
 			writeState(host, sessionId, state);
 			return {
-				hookSpecificOutput: { hookEventName: "PreToolUse", updatedInput: input },
+				hookSpecificOutput: { hookEventName: "", updatedInput: input },
 				systemMessage: `craft: blinded ${hits.length} authorship signal${hits.length === 1 ? "" : "s"} → ${agent}`,
 			};
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Survived] ConditionalExpression
extensions/claude-code.ts:357:70
 			writeState(host, sessionId, state);
 			return {
 				hookSpecificOutput: { hookEventName: "PreToolUse", updatedInput: input },
-				systemMessage: `craft: blinded ${hits.length} authorship signal${hits.length === 1 ? "" : "s"} → ${agent}`,
+				systemMessage: `craft: blinded ${hits.length} authorship signal${true ? "" : "s"} → ${agent}`,
 			};
 		}

[Survived] ConditionalExpression
extensions/claude-code.ts:357:70
 			writeState(host, sessionId, state);
 			return {
 				hookSpecificOutput: { hookEventName: "PreToolUse", updatedInput: input },
-				systemMessage: `craft: blinded ${hits.length} authorship signal${hits.length === 1 ? "" : "s"} → ${agent}`,
+				systemMessage: `craft: blinded ${hits.length} authorship signal${false ? "" : "s"} → ${agent}`,
 			};
 		}

[Killed] BooleanLiteral
extensions/claude-code.ts:364:8
 		case "PostToolUse":
 		case "PostToolUseFailure": {
 			const runId = resolveRun(host, state, cwd);
-			if (!runId) return undefined;
+			if (runId) return undefined;
 			// Finding 3: a subagent's hooks report the *parent's* transcript. Flushing it
 			// from there would bill the conductor's turns against the subagent's phase.
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ConditionalExpression
extensions/claude-code.ts:364:8
 		case "PostToolUse":
 		case "PostToolUseFailure": {
 			const runId = resolveRun(host, state, cwd);
-			if (!runId) return undefined;
+			if (true) return undefined;
 			// Finding 3: a subagent's hooks report the *parent's* transcript. Flushing it
 			// from there would bill the conductor's turns against the subagent's phase.
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] LogicalOperator
extensions/claude-code.ts:367:8
 			if (!runId) return undefined;
 			// Finding 3: a subagent's hooks report the *parent's* transcript. Flushing it
 			// from there would bill the conductor's turns against the subagent's phase.
-			if (!event.agent_id && event.transcript_path) {
+			if (!event.agent_id || event.transcript_path) {
 				state.offset = flush(host, state, runId, event.transcript_path, {
 					offset: state.offset,
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's
