[Killed] BlockStatement
extensions/claude-code.ts:367:50
 			if (!runId) return undefined;
 			// Finding 3: a subagent's hooks report the *parent's* transcript. Flushing it
 			// from there would bill the conductor's turns against the subagent's phase.
-			if (!event.agent_id && event.transcript_path) {
-				state.offset = flush(host, state, runId, event.transcript_path, {
-					offset: state.offset,
-					thinking: effortLevel(event),
-				});
-			}
+			if (!event.agent_id && event.transcript_path) {}
 			const errText = event.error === undefined ? "" : JSON.stringify(event.error);
 			const named = event.agent_type && AGENT_PHASE[event.agent_type] ? event.agent_type : undefined;
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ConditionalExpression
extensions/claude-code.ts:373:20
 					thinking: effortLevel(event),
 				});
 			}
-			const errText = event.error === undefined ? "" : JSON.stringify(event.error);
+			const errText = true ? "" : JSON.stringify(event.error);
 			const named = event.agent_type && AGENT_PHASE[event.agent_type] ? event.agent_type : undefined;
 			host.store.recordUsage(
killedBy: test/claude-code.test.ts
statusReason: errors in a tool result are classified, not just counted: errors in a tool result are classified, not just counted

[Killed] EqualityOperator
extensions/claude-code.ts:373:20
 					thinking: effortLevel(event),
 				});
 			}
-			const errText = event.error === undefined ? "" : JSON.stringify(event.error);
+			const errText = event.error !== undefined ? "" : JSON.stringify(event.error);
 			const named = event.agent_type && AGENT_PHASE[event.agent_type] ? event.agent_type : undefined;
 			host.store.recordUsage(
killedBy: test/claude-code.test.ts
statusReason: errors in a tool result are classified, not just counted: errors in a tool result are classified, not just counted

[Killed] ConditionalExpression
extensions/claude-code.ts:374:18
 				});
 			}
 			const errText = event.error === undefined ? "" : JSON.stringify(event.error);
-			const named = event.agent_type && AGENT_PHASE[event.agent_type] ? event.agent_type : undefined;
+			const named = true ? event.agent_type : undefined;
 			host.store.recordUsage(
 				runId,
killedBy: test/claude-code.test.ts
statusReason: only agents the protocol knows are recorded by name: only agents the protocol knows are recorded by name

[Killed] LogicalOperator
extensions/claude-code.ts:374:18
 				});
 			}
 			const errText = event.error === undefined ? "" : JSON.stringify(event.error);
-			const named = event.agent_type && AGENT_PHASE[event.agent_type] ? event.agent_type : undefined;
+			const named = event.agent_type || AGENT_PHASE[event.agent_type] ? event.agent_type : undefined;
 			host.store.recordUsage(
 				runId,
killedBy: test/claude-code.test.ts
statusReason: only agents the protocol knows are recorded by name: only agents the protocol knows are recorded by name

[Killed] ObjectLiteral
extensions/claude-code.ts:377:5
 			const named = event.agent_type && AGENT_PHASE[event.agent_type] ? event.agent_type : undefined;
 			host.store.recordUsage(
 				runId,
-				{
-					phase: host.store.openPhase(runId),
-					tool_name: event.tool_name,
-					agent: named,
-					subagent: Boolean(event.agent_id),
-					quota_error: quota(errText),
-					timeout: timeout(errText),
-					failover: failover(errText),
-				},
+				{},
 				false,
 			);
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Timeout] CallExpression
extensions/claude-code.ts:388:4
 				},
 				false,
 			);
-			writeState(host, sessionId, state);
+			;
 			return undefined;
 		}

[Killed] BlockStatement
extensions/claude-code.ts:392:24
 			return undefined;
 		}
 
-		case "SubagentStop": {
-			const runId = resolveRun(host, state, cwd);
-			const path = event.agent_transcript_path;
-			const agentId = event.agent_id;
-			if (!runId || !path || !agentId) return undefined;
-			if (state.agents.includes(agentId)) return undefined;
-			state.agents.push(agentId);
-			// Read whole: the subagent has stopped, so there is no tail to resume, and
-			// the per-request keys still guard against a repeat.
-			flush(host, state, runId, path, {
-				subagent: true,
-				agent: event.agent_type,
-				thinking: effortLevel(event),
-			});
-			writeState(host, sessionId, state);
-			return undefined;
-		}
+		case "SubagentStop": {}
 
 		case "Stop": {
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Killed] ConditionalExpression
extensions/claude-code.ts:392:3
 			return undefined;
 		}
 
-		case "SubagentStop": {
-			const runId = resolveRun(host, state, cwd);
-			const path = event.agent_transcript_path;
-			const agentId = event.agent_id;
-			if (!runId || !path || !agentId) return undefined;
-			if (state.agents.includes(agentId)) return undefined;
-			state.agents.push(agentId);
-			// Read whole: the subagent has stopped, so there is no tail to resume, and
-			// the per-request keys still guard against a repeat.
-			flush(host, state, runId, path, {
-				subagent: true,
-				agent: event.agent_type,
-				thinking: effortLevel(event),
-			});
-			writeState(host, sessionId, state);
-			return undefined;
-		}
+		case "SubagentStop":
 
 		case "Stop": {
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Killed] ConditionalExpression
extensions/claude-code.ts:396:8
 			const runId = resolveRun(host, state, cwd);
 			const path = event.agent_transcript_path;
 			const agentId = event.agent_id;
-			if (!runId || !path || !agentId) return undefined;
+			if (true) return undefined;
 			if (state.agents.includes(agentId)) return undefined;
 			state.agents.push(agentId);
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Killed] BooleanLiteral
extensions/claude-code.ts:396:27
 			const runId = resolveRun(host, state, cwd);
 			const path = event.agent_transcript_path;
 			const agentId = event.agent_id;
-			if (!runId || !path || !agentId) return undefined;
+			if (!runId || !path || agentId) return undefined;
 			if (state.agents.includes(agentId)) return undefined;
 			state.agents.push(agentId);
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Killed] ConditionalExpression
extensions/claude-code.ts:397:8
 			const path = event.agent_transcript_path;
 			const agentId = event.agent_id;
 			if (!runId || !path || !agentId) return undefined;
-			if (state.agents.includes(agentId)) return undefined;
+			if (true) return undefined;
 			state.agents.push(agentId);
 			// Read whole: the subagent has stopped, so there is no tail to resume, and
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Survived] ConditionalExpression
extensions/claude-code.ts:397:8
 			const path = event.agent_transcript_path;
 			const agentId = event.agent_id;
 			if (!runId || !path || !agentId) return undefined;
-			if (state.agents.includes(agentId)) return undefined;
+			if (false) return undefined;
 			state.agents.push(agentId);
 			// Read whole: the subagent has stopped, so there is no tail to resume, and

[Survived] CallExpression
extensions/claude-code.ts:398:4
 			const agentId = event.agent_id;
 			if (!runId || !path || !agentId) return undefined;
 			if (state.agents.includes(agentId)) return undefined;
-			state.agents.push(agentId);
+			;
 			// Read whole: the subagent has stopped, so there is no tail to resume, and
 			// the per-request keys still guard against a repeat.

[Killed] BooleanLiteral
extensions/claude-code.ts:402:15
 			// Read whole: the subagent has stopped, so there is no tail to resume, and
 			// the per-request keys still guard against a repeat.
 			flush(host, state, runId, path, {
-				subagent: true,
+				subagent: false,
 				agent: event.agent_type,
 				thinking: effortLevel(event),
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Killed] CallExpression
extensions/claude-code.ts:406:4
 				agent: event.agent_type,
 				thinking: effortLevel(event),
 			});
-			writeState(host, sessionId, state);
+			;
 			return undefined;
 		}
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Survived] ConditionalExpression
extensions/claude-code.ts:410:3
 			return undefined;
 		}
 
-		case "Stop": {
-			const runId = resolveRun(host, state, cwd);
-			if (!runId || !event.transcript_path) return undefined;
-			state.offset = flush(host, state, runId, event.transcript_path, {
-				offset: state.offset,
-				thinking: effortLevel(event),
-			});
-			writeState(host, sessionId, state);
-			return undefined;
-		}
+		case "Stop":
 
 		case "SessionEnd": {

[Survived] BlockStatement
extensions/claude-code.ts:410:16
 			return undefined;
 		}
 
-		case "Stop": {
-			const runId = resolveRun(host, state, cwd);
-			if (!runId || !event.transcript_path) return undefined;
-			state.offset = flush(host, state, runId, event.transcript_path, {
-				offset: state.offset,
-				thinking: effortLevel(event),
-			});
-			writeState(host, sessionId, state);
-			return undefined;
-		}
+		case "Stop": {}
 
 		case "SessionEnd": {

[Killed] BooleanLiteral
extensions/claude-code.ts:412:8
 
 		case "Stop": {
 			const runId = resolveRun(host, state, cwd);
-			if (!runId || !event.transcript_path) return undefined;
+			if (runId || !event.transcript_path) return undefined;
 			state.offset = flush(host, state, runId, event.transcript_path, {
 				offset: state.offset,
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Killed] ConditionalExpression
extensions/claude-code.ts:412:8
 
 		case "Stop": {
 			const runId = resolveRun(host, state, cwd);
-			if (!runId || !event.transcript_path) return undefined;
+			if (true) return undefined;
 			state.offset = flush(host, state, runId, event.transcript_path, {
 				offset: state.offset,
killedBy: test/claude-code.test.ts
statusReason: a subagent is billed from its own transcript, not the parent's: a subagent is billed from its own transcript, not the parent's

[Killed] BlockStatement
extensions/claude-code.ts:421:22
 			return undefined;
 		}
 
-		case "SessionEnd": {
-			const runId = resolveRun(host, state, cwd);
-			if (runId && event.transcript_path) {
-				flush(host, state, runId, event.transcript_path, { offset: state.offset, thinking: effortLevel(event) });
-			}
-			// The run stays open: ending it is the skill's job, as on pi. Only this
-			// session's bookkeeping goes.
-			try {
-				rmSync(statePath(host, sessionId), { force: true });
-			} catch {
-				// A stale state file is harmless; a throw here is not.
-			}
-			return undefined;
-		}
+		case "SessionEnd": {}
 
 		default:
killedBy: test/claude-code.test.ts
statusReason: SessionEnd flushes the last turn and clears the session's bookkeeping: SessionEnd flushes the last turn and clears the session's bookkeeping

[Killed] ConditionalExpression
extensions/claude-code.ts:421:3
 			return undefined;
 		}
 
-		case "SessionEnd": {
-			const runId = resolveRun(host, state, cwd);
-			if (runId && event.transcript_path) {
-				flush(host, state, runId, event.transcript_path, { offset: state.offset, thinking: effortLevel(event) });
-			}
-			// The run stays open: ending it is the skill's job, as on pi. Only this
-			// session's bookkeeping goes.
-			try {
-				rmSync(statePath(host, sessionId), { force: true });
-			} catch {
-				// A stale state file is harmless; a throw here is not.
-			}
-			return undefined;
-		}
+		case "SessionEnd":
 
 		default:
killedBy: test/claude-code.test.ts
statusReason: SessionEnd flushes the last turn and clears the session's bookkeeping: SessionEnd flushes the last turn and clears the session's bookkeeping

[Killed] ConditionalExpression
extensions/claude-code.ts:423:8
 
 		case "SessionEnd": {
 			const runId = resolveRun(host, state, cwd);
-			if (runId && event.transcript_path) {
+			if (false) {
 				flush(host, state, runId, event.transcript_path, { offset: state.offset, thinking: effortLevel(event) });
 			}
killedBy: test/claude-code.test.ts
statusReason: SessionEnd flushes the last turn and clears the session's bookkeeping: SessionEnd flushes the last turn and clears the session's bookkeeping

[Killed] BlockStatement
extensions/claude-code.ts:423:40
 
 		case "SessionEnd": {
 			const runId = resolveRun(host, state, cwd);
-			if (runId && event.transcript_path) {
-				flush(host, state, runId, event.transcript_path, { offset: state.offset, thinking: effortLevel(event) });
-			}
+			if (runId && event.transcript_path) {}
 			// The run stays open: ending it is the skill's job, as on pi. Only this
 			// session's bookkeeping goes.
killedBy: test/claude-code.test.ts
statusReason: SessionEnd flushes the last turn and clears the session's bookkeeping: SessionEnd flushes the last turn and clears the session's bookkeeping

[Survived] BlockStatement
extensions/claude-code.ts:428:8
 			}
 			// The run stays open: ending it is the skill's job, as on pi. Only this
 			// session's bookkeeping goes.
-			try {
-				rmSync(statePath(host, sessionId), { force: true });
-			} catch {
+			try {} catch {
 				// A stale state file is harmless; a throw here is not.
 			}

[Survived] BooleanLiteral
extensions/claude-code.ts:429:49
 			// The run stays open: ending it is the skill's job, as on pi. Only this
 			// session's bookkeeping goes.
 			try {
-				rmSync(statePath(host, sessionId), { force: true });
+				rmSync(statePath(host, sessionId), { force: false });
 			} catch {
 				// A stale state file is harmless; a throw here is not.

[Survived] ObjectLiteral
extensions/claude-code.ts:429:40
 			// The run stays open: ending it is the skill's job, as on pi. Only this
 			// session's bookkeeping goes.
 			try {
-				rmSync(statePath(host, sessionId), { force: true });
+				rmSync(statePath(host, sessionId), {});
 			} catch {
 				// A stale state file is harmless; a throw here is not.

[NoCoverage] ConditionalExpression
extensions/claude-code.ts:436:3
 			return undefined;
 		}
 
-		default:
-			return undefined;
+		default:
 	}
 }

[NoCoverage] BlockStatement
extensions/claude-code.ts:441:37
 	}
 }
 
-export function readStdin(): string {
-	try {
-		return readFileSync(0, "utf8");
-	} catch {
-		return "";
-	}
-}
+export function readStdin(): string {}
 
 export function defaultHost(): Host {

[NoCoverage] BlockStatement
extensions/claude-code.ts:442:6
 }
 
 export function readStdin(): string {
-	try {
-		return readFileSync(0, "utf8");
-	} catch {
+	try {} catch {
 		return "";
 	}

[NoCoverage] BlockStatement
extensions/claude-code.ts:444:10
 export function readStdin(): string {
 	try {
 		return readFileSync(0, "utf8");
-	} catch {
-		return "";
-	}
+	} catch {}
 }
 

[NoCoverage] BlockStatement
extensions/claude-code.ts:449:37
 	}
 }
 
-export function defaultHost(): Host {
-	// Honours `CRAFT_METRICS_PATH` the way the CLI does, so a redirected store stays
-	// redirected for the half of collection the host contributes — and session state
-	// follows the log rather than stranding itself beside a store nobody is reading.
-	const store = new Store(process.env.CRAFT_METRICS_PATH ?? undefined);
-	return { store, stateDir: join(dirname(store.path), "sessions") };
-}
+export function defaultHost(): Host {}
 
 /** Entry point. Never throws — a hook that fails must not fail the session. */

[NoCoverage] LogicalOperator
extensions/claude-code.ts:453:26
 	// Honours `CRAFT_METRICS_PATH` the way the CLI does, so a redirected store stays
 	// redirected for the half of collection the host contributes — and session state
 	// follows the log rather than stranding itself beside a store nobody is reading.
-	const store = new Store(process.env.CRAFT_METRICS_PATH ?? undefined);
+	const store = new Store(process.env.CRAFT_METRICS_PATH && undefined);
 	return { store, stateDir: join(dirname(store.path), "sessions") };
 }

[Killed] BlockStatement
extensions/claude-code.ts:458:71
 }
 
 /** Entry point. Never throws — a hook that fails must not fail the session. */
-export function main(raw: string, host: Host = defaultHost()): string {
-	const output = safe(() => {
-		let event: HookEvent;
-		try {
-			event = JSON.parse(raw) as HookEvent;
-		} catch {
-			return undefined;
-		}
-		return handleHook(event, host);
-	});
-	return output ? JSON.stringify(output) : "";
-}
+export function main(raw: string, host: Host = defaultHost()): string {}
 
killedBy: test/claude-code.test.ts
statusReason: main survives anything on stdin: main survives anything on stdin

[Survived] BlockStatement
extensions/claude-code.ts:459:28
 
 /** Entry point. Never throws — a hook that fails must not fail the session. */
 export function main(raw: string, host: Host = defaultHost()): string {
-	const output = safe(() => {
-		let event: HookEvent;
-		try {
-			event = JSON.parse(raw) as HookEvent;
-		} catch {
-			return undefined;
-		}
-		return handleHook(event, host);
-	});
+	const output = safe(() => {});
 	return output ? JSON.stringify(output) : "";
 }

[Survived] BlockStatement
extensions/claude-code.ts:461:7
 export function main(raw: string, host: Host = defaultHost()): string {
 	const output = safe(() => {
 		let event: HookEvent;
-		try {
-			event = JSON.parse(raw) as HookEvent;
-		} catch {
+		try {} catch {
 			return undefined;
 		}

[Survived] BlockStatement
extensions/claude-code.ts:463:11
 		let event: HookEvent;
 		try {
 			event = JSON.parse(raw) as HookEvent;
-		} catch {
-			return undefined;
-		}
+		} catch {}
 		return handleHook(event, host);
 	});
