[Survived] ArrowFunction
src/agent-port-cli.ts:17:9
 }
 
 export const defaultIo: Io = {
-	write: (s) => process.stdout.write(s),
+	write: () => undefined,
 	error: (s) => console.error(s),
 	read: (path) => readFileSync(path, "utf8"),

[Survived] ArrowFunction
src/agent-port-cli.ts:18:9
 
 export const defaultIo: Io = {
 	write: (s) => process.stdout.write(s),
-	error: (s) => console.error(s),
+	error: () => undefined,
 	read: (path) => readFileSync(path, "utf8"),
 	list: (dir) => readdirSync(dir),

[Survived] ArrowFunction
src/agent-port-cli.ts:19:8
 export const defaultIo: Io = {
 	write: (s) => process.stdout.write(s),
 	error: (s) => console.error(s),
-	read: (path) => readFileSync(path, "utf8"),
+	read: () => undefined,
 	list: (dir) => readdirSync(dir),
 	save: (path, contents) => {

[Survived] ArrowFunction
src/agent-port-cli.ts:20:8
 	write: (s) => process.stdout.write(s),
 	error: (s) => console.error(s),
 	read: (path) => readFileSync(path, "utf8"),
-	list: (dir) => readdirSync(dir),
+	list: () => undefined,
 	save: (path, contents) => {
 		mkdirSync(join(path, ".."), { recursive: true });

[NoCoverage] BlockStatement
src/agent-port-cli.ts:21:28
 	error: (s) => console.error(s),
 	read: (path) => readFileSync(path, "utf8"),
 	list: (dir) => readdirSync(dir),
-	save: (path, contents) => {
-		mkdirSync(join(path, ".."), { recursive: true });
-		writeFileSync(path, contents);
-	},
+	save: (path, contents) => {},
 };
 

[NoCoverage] BooleanLiteral
src/agent-port-cli.ts:22:44
 	read: (path) => readFileSync(path, "utf8"),
 	list: (dir) => readdirSync(dir),
 	save: (path, contents) => {
-		mkdirSync(join(path, ".."), { recursive: true });
+		mkdirSync(join(path, ".."), { recursive: false });
 		writeFileSync(path, contents);
 	},

[NoCoverage] StringLiteral
src/agent-port-cli.ts:22:24
 	read: (path) => readFileSync(path, "utf8"),
 	list: (dir) => readdirSync(dir),
 	save: (path, contents) => {
-		mkdirSync(join(path, ".."), { recursive: true });
+		mkdirSync(join(path, ""), { recursive: true });
 		writeFileSync(path, contents);
 	},

[NoCoverage] CallExpression
src/agent-port-cli.ts:23:3
 	list: (dir) => readdirSync(dir),
 	save: (path, contents) => {
 		mkdirSync(join(path, ".."), { recursive: true });
-		writeFileSync(path, contents);
+		;
 	},
 };

[Killed] BooleanLiteral
src/agent-port-cli.ts:39:6
 
 export function main(argv: string[], io: Io = defaultIo): number {
 	const [source, out] = argv;
-	if (!source || !out || source === "-h" || source === "--help") {
+	if (source || !out || source === "-h" || source === "--help") {
 		io.write(USAGE);
 		return source && out ? 0 : 2;
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[Killed] LogicalOperator
src/agent-port-cli.ts:39:6
 
 export function main(argv: string[], io: Io = defaultIo): number {
 	const [source, out] = argv;
-	if (!source || !out || source === "-h" || source === "--help") {
+	if ((!source || !out || source === "-h") && source === "--help") {
 		io.write(USAGE);
 		return source && out ? 0 : 2;
killedBy: test/agent-port.test.ts
statusReason: missing arguments and empty directories exit 2 rather than writing nothing quietly: missing arguments and empty directories exit 2 rather than writing nothing quietly

[Killed] CallExpression
src/agent-port-cli.ts:40:3
 export function main(argv: string[], io: Io = defaultIo): number {
 	const [source, out] = argv;
 	if (!source || !out || source === "-h" || source === "--help") {
-		io.write(USAGE);
+		;
 		return source && out ? 0 : 2;
 	}
killedBy: test/agent-port.test.ts
statusReason: missing arguments and empty directories exit 2 rather than writing nothing quietly: missing arguments and empty directories exit 2 rather than writing nothing quietly

[Killed] ConditionalExpression
src/agent-port-cli.ts:41:10
 	const [source, out] = argv;
 	if (!source || !out || source === "-h" || source === "--help") {
 		io.write(USAGE);
-		return source && out ? 0 : 2;
+		return true ? 0 : 2;
 	}
 
killedBy: test/agent-port.test.ts
statusReason: missing arguments and empty directories exit 2 rather than writing nothing quietly: missing arguments and empty directories exit 2 rather than writing nothing quietly

[Survived] LogicalOperator
src/agent-port-cli.ts:41:10
 	const [source, out] = argv;
 	if (!source || !out || source === "-h" || source === "--help") {
 		io.write(USAGE);
-		return source && out ? 0 : 2;
+		return source || out ? 0 : 2;
 	}
 

[Killed] BlockStatement
src/agent-port-cli.ts:45:6
 	}
 
 	let files: string[];
-	try {
-		files = io.list(source).filter((f) => f.endsWith(".md")).sort();
-	} catch (err) {
+	try {} catch (err) {
 		io.error(`cannot read ${source}: ${err instanceof Error ? err.message : String(err)}`);
 		return 2;
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[Killed] MethodExpression
src/agent-port-cli.ts:46:41
 
 	let files: string[];
 	try {
-		files = io.list(source).filter((f) => f.endsWith(".md")).sort();
+		files = io.list(source).filter((f) => f.startsWith(".md")).sort();
 	} catch (err) {
 		io.error(`cannot read ${source}: ${err instanceof Error ? err.message : String(err)}`);
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[Killed] ArrowFunction
src/agent-port-cli.ts:46:34
 
 	let files: string[];
 	try {
-		files = io.list(source).filter((f) => f.endsWith(".md")).sort();
+		files = io.list(source).filter(() => undefined).sort();
 	} catch (err) {
 		io.error(`cannot read ${source}: ${err instanceof Error ? err.message : String(err)}`);
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[NoCoverage] BlockStatement
src/agent-port-cli.ts:47:16
 	let files: string[];
 	try {
 		files = io.list(source).filter((f) => f.endsWith(".md")).sort();
-	} catch (err) {
-		io.error(`cannot read ${source}: ${err instanceof Error ? err.message : String(err)}`);
-		return 2;
-	}
+	} catch (err) {}
 	if (files.length === 0) {
 		io.error(`no agent files in ${source}`);

[NoCoverage] StringLiteral
src/agent-port-cli.ts:48:12
 	try {
 		files = io.list(source).filter((f) => f.endsWith(".md")).sort();
 	} catch (err) {
-		io.error(`cannot read ${source}: ${err instanceof Error ? err.message : String(err)}`);
+		io.error(``);
 		return 2;
 	}

[Killed] ConditionalExpression
src/agent-port-cli.ts:51:6
 		io.error(`cannot read ${source}: ${err instanceof Error ? err.message : String(err)}`);
 		return 2;
 	}
-	if (files.length === 0) {
+	if (true) {
 		io.error(`no agent files in ${source}`);
 		return 2;
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[Killed] BlockStatement
src/agent-port-cli.ts:51:26
 		io.error(`cannot read ${source}: ${err instanceof Error ? err.message : String(err)}`);
 		return 2;
 	}
-	if (files.length === 0) {
-		io.error(`no agent files in ${source}`);
-		return 2;
-	}
+	if (files.length === 0) {}
 
 	for (const file of files) {
killedBy: test/agent-port.test.ts
statusReason: missing arguments and empty directories exit 2 rather than writing nothing quietly: missing arguments and empty directories exit 2 rather than writing nothing quietly

[Killed] StringLiteral
src/agent-port-cli.ts:52:12
 		return 2;
 	}
 	if (files.length === 0) {
-		io.error(`no agent files in ${source}`);
+		io.error(``);
 		return 2;
 	}
killedBy: test/agent-port.test.ts
statusReason: missing arguments and empty directories exit 2 rather than writing nothing quietly: missing arguments and empty directories exit 2 rather than writing nothing quietly

[Killed] BlockStatement
src/agent-port-cli.ts:56:28
 		return 2;
 	}
 
-	for (const file of files) {
-		let ported;
-		try {
-			ported = portAgent(io.read(join(source, file)));
-		} catch (err) {
-			// Naming the file matters — the error text only knows the agent's own name.
-			io.error(`${file}: ${err instanceof PortError ? err.message : String(err)}`);
-			return 1;
-		}
-		// Written under the agent's own name, not the source filename, so the file a
-		// matcher or phase map refers to is the file on disk.
-		io.save(join(out, `${ported.name}.md`), renderAgent(ported));
-		io.write(`${ported.name}  ${ported.tools.join(", ") || "(no tools)"}\n`);
-	}
+	for (const file of files) {}
 	io.write(`\n${files.length} agent${files.length === 1 ? "" : "s"} → ${out}\n`);
 	return 0;
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[Killed] BlockStatement
src/agent-port-cli.ts:58:7
 
 	for (const file of files) {
 		let ported;
-		try {
-			ported = portAgent(io.read(join(source, file)));
-		} catch (err) {
+		try {} catch (err) {
 			// Naming the file matters — the error text only knows the agent's own name.
 			io.error(`${file}: ${err instanceof PortError ? err.message : String(err)}`);
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[Killed] BlockStatement
src/agent-port-cli.ts:60:17
 		let ported;
 		try {
 			ported = portAgent(io.read(join(source, file)));
-		} catch (err) {
-			// Naming the file matters — the error text only knows the agent's own name.
-			io.error(`${file}: ${err instanceof PortError ? err.message : String(err)}`);
-			return 1;
-		}
+		} catch (err) {}
 		// Written under the agent's own name, not the source filename, so the file a
 		// matcher or phase map refers to is the file on disk.
killedBy: test/agent-port.test.ts
statusReason: one bad agent fails the whole run, naming the file: one bad agent fails the whole run, naming the file

[Killed] ConditionalExpression
src/agent-port-cli.ts:68:31
 		// Written under the agent's own name, not the source filename, so the file a
 		// matcher or phase map refers to is the file on disk.
 		io.save(join(out, `${ported.name}.md`), renderAgent(ported));
-		io.write(`${ported.name}  ${ported.tools.join(", ") || "(no tools)"}\n`);
+		io.write(`${ported.name}  ${false}\n`);
 	}
 	io.write(`\n${files.length} agent${files.length === 1 ? "" : "s"} → ${out}\n`);
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[Killed] ConditionalExpression
src/agent-port-cli.ts:68:31
 		// Written under the agent's own name, not the source filename, so the file a
 		// matcher or phase map refers to is the file on disk.
 		io.save(join(out, `${ported.name}.md`), renderAgent(ported));
-		io.write(`${ported.name}  ${ported.tools.join(", ") || "(no tools)"}\n`);
+		io.write(`${ported.name}  ${true}\n`);
 	}
 	io.write(`\n${files.length} agent${files.length === 1 ? "" : "s"} → ${out}\n`);
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[Killed] ConditionalExpression
src/agent-port-cli.ts:70:37
 		io.save(join(out, `${ported.name}.md`), renderAgent(ported));
 		io.write(`${ported.name}  ${ported.tools.join(", ") || "(no tools)"}\n`);
 	}
-	io.write(`\n${files.length} agent${files.length === 1 ? "" : "s"} → ${out}\n`);
+	io.write(`\n${files.length} agent${false ? "" : "s"} → ${out}\n`);
 	return 0;
 }
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[Killed] EqualityOperator
src/agent-port-cli.ts:70:37
 		io.save(join(out, `${ported.name}.md`), renderAgent(ported));
 		io.write(`${ported.name}  ${ported.tools.join(", ") || "(no tools)"}\n`);
 	}
-	io.write(`\n${files.length} agent${files.length === 1 ? "" : "s"} → ${out}\n`);
+	io.write(`\n${files.length} agent${files.length !== 1 ? "" : "s"} → ${out}\n`);
 	return 0;
 }
killedBy: test/agent-port.test.ts
statusReason: the command writes one file per agent, named after the agent: the command writes one file per agent, named after the agent

[NoCoverage] BlockStatement
src/agent-port-cli.ts:74:90
 	return 0;
 }
 
-if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {
-	process.exit(main(process.argv.slice(2)));
-}
+if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {}
 

[Survived] ConditionalExpression
src/agent-port-cli.ts:74:5
 	return 0;
 }
 
-if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {
+if (false) {
 	process.exit(main(process.argv.slice(2)));
 }

[NoCoverage] MethodExpression
src/agent-port-cli.ts:75:20
 }
 
 if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {
-	process.exit(main(process.argv.slice(2)));
+	process.exit(main(process.argv));
 }
 
