[Killed] StringLiteral
src/blind.ts:19:40
 export const BLIND_TARGETS = new Set(["craft-evaluator", "craft-security-review"]);
 
 /** Payload fields that may carry the task text, in the order we try them. */
-export const PAYLOAD_FIELDS = ["task", "prompt", "input", "message", "instructions"];
+export const PAYLOAD_FIELDS = ["task", "", "input", "message", "instructions"];
 
 /**
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] StringLiteral
src/blind.ts:19:32
 export const BLIND_TARGETS = new Set(["craft-evaluator", "craft-security-review"]);
 
 /** Payload fields that may carry the task text, in the order we try them. */
-export const PAYLOAD_FIELDS = ["task", "prompt", "input", "message", "instructions"];
+export const PAYLOAD_FIELDS = ["", "prompt", "input", "message", "instructions"];
 
 /**
killedBy: test/blind.test.ts
statusReason: scrubPayload mutates in place across known fields: scrubPayload mutates in place across known fields

[Killed] ArrayDeclaration
src/blind.ts:27:2
  * would be louder and harder to read for the same benefit.
  */
 const AGENT_ROLE: Array<[RegExp, string]> = [
-	[/\bcraft-planner\b/gi, "the planning step"],
+	[],
 	[/\bcraft-counsel\b/gi, "plan review"],
 	[/\bcraft-plan-(?:feasibility|scope|security)\b/gi, "plan review"],
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Survived] StringLiteral
src/blind.ts:29:54
 const AGENT_ROLE: Array<[RegExp, string]> = [
 	[/\bcraft-planner\b/gi, "the planning step"],
 	[/\bcraft-counsel\b/gi, "plan review"],
-	[/\bcraft-plan-(?:feasibility|scope|security)\b/gi, "plan review"],
+	[/\bcraft-plan-(?:feasibility|scope|security)\b/gi, ""],
 	[/\bcraft-code-simplifier\b/gi, "the cleanup step"],
 	[/\bcraft-builder\b/gi, "the implementation step"],

[Killed] StringLiteral
src/blind.ts:31:26
 	[/\bcraft-counsel\b/gi, "plan review"],
 	[/\bcraft-plan-(?:feasibility|scope|security)\b/gi, "plan review"],
 	[/\bcraft-code-simplifier\b/gi, "the cleanup step"],
-	[/\bcraft-builder\b/gi, "the implementation step"],
+	[/\bcraft-builder\b/gi, ""],
 	[/\bcraft-sharpener\b/gi, "the documentation step"],
 	[/\bnode-conductor\b/gi, "the conductor"],
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ArrayDeclaration
src/blind.ts:32:2
 	[/\bcraft-plan-(?:feasibility|scope|security)\b/gi, "plan review"],
 	[/\bcraft-code-simplifier\b/gi, "the cleanup step"],
 	[/\bcraft-builder\b/gi, "the implementation step"],
-	[/\bcraft-sharpener\b/gi, "the documentation step"],
+	[],
 	[/\bnode-conductor\b/gi, "the conductor"],
 ];
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Survived] StringLiteral
src/blind.ts:32:28
 	[/\bcraft-plan-(?:feasibility|scope|security)\b/gi, "plan review"],
 	[/\bcraft-code-simplifier\b/gi, "the cleanup step"],
 	[/\bcraft-builder\b/gi, "the implementation step"],
-	[/\bcraft-sharpener\b/gi, "the documentation step"],
+	[/\bcraft-sharpener\b/gi, ""],
 	[/\bnode-conductor\b/gi, "the conductor"],
 ];

[Survived] StringLiteral
src/blind.ts:33:27
 	[/\bcraft-code-simplifier\b/gi, "the cleanup step"],
 	[/\bcraft-builder\b/gi, "the implementation step"],
 	[/\bcraft-sharpener\b/gi, "the documentation step"],
-	[/\bnode-conductor\b/gi, "the conductor"],
+	[/\bnode-conductor\b/gi, ""],
 ];
 

[Killed] ArrayDeclaration
src/blind.ts:40:34
  * Model identity. Provider-qualified ids first, then bare family names, so
  * `zai/glm-5.2` collapses in one hit rather than leaving a dangling `glm-5.2`.
  */
-const MODEL_PATTERNS: RegExp[] = [
-	/\b(?:openai-codex|openai|anthropic|zai|xai|google|deepseek|mistralai|mistral|meta|openrouter|groq|ollama)\/[\w.\-:]+/gi,
-	// Version suffixes stop at the last word char so a sentence-final period survives.
-	/\b(?:gpt|claude|glm|grok|gemini|llama|qwen|deepseek|mistral|codestral|kimi)-\w+(?:\.\w+)*/gi,
-	/\b(?:opus|sonnet|haiku|fable|terra|sol|luna)-\d+(?:\.\d+)*\b/gi,
-	/\bo[1-9]-(?:mini|preview|pro)\b/gi,
-];
+const MODEL_PATTERNS: RegExp[] = [];
 
 /** DAG bookkeeping that reveals the node/branch a change came from. */
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] Regex
src/blind.ts:43:2
 const MODEL_PATTERNS: RegExp[] = [
 	/\b(?:openai-codex|openai|anthropic|zai|xai|google|deepseek|mistralai|mistral|meta|openrouter|groq|ollama)\/[\w.\-:]+/gi,
 	// Version suffixes stop at the last word char so a sentence-final period survives.
-	/\b(?:gpt|claude|glm|grok|gemini|llama|qwen|deepseek|mistral|codestral|kimi)-\w+(?:\.\w+)*/gi,
+	/\b(?:gpt|claude|glm|grok|gemini|llama|qwen|deepseek|mistral|codestral|kimi)-\W+(?:\.\w+)*/gi,
 	/\b(?:opus|sonnet|haiku|fable|terra|sol|luna)-\d+(?:\.\d+)*\b/gi,
 	/\bo[1-9]-(?:mini|preview|pro)\b/gi,
killedBy: test/blind.test.ts
statusReason: strips provider-qualified and bare model ids: strips provider-qualified and bare model ids

[Survived] Regex
src/blind.ts:43:2
 const MODEL_PATTERNS: RegExp[] = [
 	/\b(?:openai-codex|openai|anthropic|zai|xai|google|deepseek|mistralai|mistral|meta|openrouter|groq|ollama)\/[\w.\-:]+/gi,
 	// Version suffixes stop at the last word char so a sentence-final period survives.
-	/\b(?:gpt|claude|glm|grok|gemini|llama|qwen|deepseek|mistral|codestral|kimi)-\w+(?:\.\w+)*/gi,
+	/\b(?:gpt|claude|glm|grok|gemini|llama|qwen|deepseek|mistral|codestral|kimi)-\w+(?:\.\w)*/gi,
 	/\b(?:opus|sonnet|haiku|fable|terra|sol|luna)-\d+(?:\.\d+)*\b/gi,
 	/\bo[1-9]-(?:mini|preview|pro)\b/gi,

[Survived] Regex
src/blind.ts:44:2
 	/\b(?:openai-codex|openai|anthropic|zai|xai|google|deepseek|mistralai|mistral|meta|openrouter|groq|ollama)\/[\w.\-:]+/gi,
 	// Version suffixes stop at the last word char so a sentence-final period survives.
 	/\b(?:gpt|claude|glm|grok|gemini|llama|qwen|deepseek|mistral|codestral|kimi)-\w+(?:\.\w+)*/gi,
-	/\b(?:opus|sonnet|haiku|fable|terra|sol|luna)-\d+(?:\.\d+)*\b/gi,
+	/\b(?:opus|sonnet|haiku|fable|terra|sol|luna)-\d+(?:\.\d)*\b/gi,
 	/\bo[1-9]-(?:mini|preview|pro)\b/gi,
 ];

[Survived] Regex
src/blind.ts:44:2
 	/\b(?:openai-codex|openai|anthropic|zai|xai|google|deepseek|mistralai|mistral|meta|openrouter|groq|ollama)\/[\w.\-:]+/gi,
 	// Version suffixes stop at the last word char so a sentence-final period survives.
 	/\b(?:gpt|claude|glm|grok|gemini|llama|qwen|deepseek|mistral|codestral|kimi)-\w+(?:\.\w+)*/gi,
-	/\b(?:opus|sonnet|haiku|fable|terra|sol|luna)-\d+(?:\.\d+)*\b/gi,
+	/\b(?:opus|sonnet|haiku|fable|terra|sol|luna)-\d(?:\.\d+)*\b/gi,
 	/\bo[1-9]-(?:mini|preview|pro)\b/gi,
 ];

[Survived] Regex
src/blind.ts:45:2
 	// Version suffixes stop at the last word char so a sentence-final period survives.
 	/\b(?:gpt|claude|glm|grok|gemini|llama|qwen|deepseek|mistral|codestral|kimi)-\w+(?:\.\w+)*/gi,
 	/\b(?:opus|sonnet|haiku|fable|terra|sol|luna)-\d+(?:\.\d+)*\b/gi,
-	/\bo[1-9]-(?:mini|preview|pro)\b/gi,
+	/\bo[^1-9]-(?:mini|preview|pro)\b/gi,
 ];
 

[Killed] Regex
src/blind.ts:50:3
 
 /** DAG bookkeeping that reveals the node/branch a change came from. */
 const DAG_PATTERNS: Array<[RegExp, string]> = [
-	[/(?:^|(?<=\s))\[n\d+\]\s*/gm, ""],
+	[/(?:(?<=\s))\[n\d+\]\s*/gm, ""],
 	[/\btmp\/worktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
 	[/\bworktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
killedBy: test/blind.test.ts
statusReason: strips DAG node, branch, and worktree identity: strips DAG node, branch, and worktree identity

[Survived] Regex
src/blind.ts:51:3
 /** DAG bookkeeping that reveals the node/branch a change came from. */
 const DAG_PATTERNS: Array<[RegExp, string]> = [
 	[/(?:^|(?<=\s))\[n\d+\]\s*/gm, ""],
-	[/\btmp\/worktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
+	[/\btmp\/worktree-n\D+(?:-attempt-\d+)?\b/gi, "the worktree"],
 	[/\bworktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
 	[/\bdag\/n\d+(?:-attempt-\d+)?\b/gi, "the branch"],

[Survived] Regex
src/blind.ts:51:3
 /** DAG bookkeeping that reveals the node/branch a change came from. */
 const DAG_PATTERNS: Array<[RegExp, string]> = [
 	[/(?:^|(?<=\s))\[n\d+\]\s*/gm, ""],
-	[/\btmp\/worktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
+	[/\btmp\/worktree-n\d+(?:-attempt-\d+)\b/gi, "the worktree"],
 	[/\bworktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
 	[/\bdag\/n\d+(?:-attempt-\d+)?\b/gi, "the branch"],

[Survived] Regex
src/blind.ts:52:3
 const DAG_PATTERNS: Array<[RegExp, string]> = [
 	[/(?:^|(?<=\s))\[n\d+\]\s*/gm, ""],
 	[/\btmp\/worktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
-	[/\bworktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
+	[/\bworktree-n\d+(?:-attempt-\d+)\b/gi, "the worktree"],
 	[/\bdag\/n\d+(?:-attempt-\d+)?\b/gi, "the branch"],
 ];

[Survived] Regex
src/blind.ts:52:3
 const DAG_PATTERNS: Array<[RegExp, string]> = [
 	[/(?:^|(?<=\s))\[n\d+\]\s*/gm, ""],
 	[/\btmp\/worktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
-	[/\bworktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
+	[/\bworktree-n\d(?:-attempt-\d+)?\b/gi, "the worktree"],
 	[/\bdag\/n\d+(?:-attempt-\d+)?\b/gi, "the branch"],
 ];

[Killed] Regex
src/blind.ts:53:3
 	[/(?:^|(?<=\s))\[n\d+\]\s*/gm, ""],
 	[/\btmp\/worktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
 	[/\bworktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
-	[/\bdag\/n\d+(?:-attempt-\d+)?\b/gi, "the branch"],
+	[/\bdag\/n\d+(?:-attempt-\d+)\b/gi, "the branch"],
 ];
 
killedBy: test/blind.test.ts
statusReason: strips DAG node, branch, and worktree identity: strips DAG node, branch, and worktree identity

[Killed] Regex
src/blind.ts:53:3
 	[/(?:^|(?<=\s))\[n\d+\]\s*/gm, ""],
 	[/\btmp\/worktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
 	[/\bworktree-n\d+(?:-attempt-\d+)?\b/gi, "the worktree"],
-	[/\bdag\/n\d+(?:-attempt-\d+)?\b/gi, "the branch"],
+	[/\bdag\/n\D+(?:-attempt-\d+)?\b/gi, "the branch"],
 ];
 
killedBy: test/blind.test.ts
statusReason: strips DAG node, branch, and worktree identity: strips DAG node, branch, and worktree identity

[Killed] BooleanLiteral
src/blind.ts:69:6
  * leak, so it is left alone.
  */
 export function scrub(text: string, self?: string): ScrubResult {
-	if (!text) return { text, hits: [] };
+	if (text) return { text, hits: [] };
 	const hits: string[] = [];
 	let out = text;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
src/blind.ts:69:6
  * leak, so it is left alone.
  */
 export function scrub(text: string, self?: string): ScrubResult {
-	if (!text) return { text, hits: [] };
+	if (true) return { text, hits: [] };
 	const hits: string[] = [];
 	let out = text;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BlockStatement
src/blind.ts:73:36
 	const hits: string[] = [];
 	let out = text;
 
-	const record = (label: string) => {
-		if (!hits.includes(label)) hits.push(label);
-	};
+	const record = (label: string) => {};
 
 	for (const [pattern, replacement] of AGENT_ROLE) {
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BooleanLiteral
src/blind.ts:74:7
 	let out = text;
 
 	const record = (label: string) => {
-		if (!hits.includes(label)) hits.push(label);
+		if (hits.includes(label)) hits.push(label);
 	};
 
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] CallExpression
src/blind.ts:74:30
 	let out = text;
 
 	const record = (label: string) => {
-		if (!hits.includes(label)) hits.push(label);
+		if (!hits.includes(label)) ;
 	};
 
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BlockStatement
src/blind.ts:77:51
 		if (!hits.includes(label)) hits.push(label);
 	};
 
-	for (const [pattern, replacement] of AGENT_ROLE) {
-		if (self && pattern.source.includes(self)) continue;
-		out = out.replace(pattern, (m) => {
-			record(m.toLowerCase());
-			return replacement;
-		});
-	}
+	for (const [pattern, replacement] of AGENT_ROLE) {}
 
 	for (const pattern of MODEL_PATTERNS) {
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
src/blind.ts:78:7
 	};
 
 	for (const [pattern, replacement] of AGENT_ROLE) {
-		if (self && pattern.source.includes(self)) continue;
+		if (true) continue;
 		out = out.replace(pattern, (m) => {
 			record(m.toLowerCase());
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] LogicalOperator
src/blind.ts:78:7
 	};
 
 	for (const [pattern, replacement] of AGENT_ROLE) {
-		if (self && pattern.source.includes(self)) continue;
+		if (self || pattern.source.includes(self)) continue;
 		out = out.replace(pattern, (m) => {
 			record(m.toLowerCase());
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BlockStatement
src/blind.ts:79:37
 
 	for (const [pattern, replacement] of AGENT_ROLE) {
 		if (self && pattern.source.includes(self)) continue;
-		out = out.replace(pattern, (m) => {
-			record(m.toLowerCase());
-			return replacement;
-		});
+		out = out.replace(pattern, (m) => {});
 	}
 
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] MethodExpression
src/blind.ts:80:11
 	for (const [pattern, replacement] of AGENT_ROLE) {
 		if (self && pattern.source.includes(self)) continue;
 		out = out.replace(pattern, (m) => {
-			record(m.toLowerCase());
+			record(m.toUpperCase());
 			return replacement;
 		});
killedBy: test/blind.test.ts
statusReason: strips phase agent names but keeps the sentence readable: strips phase agent names but keeps the sentence readable

[Killed] BlockStatement
src/blind.ts:85:40
 		});
 	}
 
-	for (const pattern of MODEL_PATTERNS) {
-		out = out.replace(pattern, (m) => {
-			record(m.toLowerCase());
-			return "a model";
-		});
-	}
+	for (const pattern of MODEL_PATTERNS) {}
 
 	for (const [pattern, replacement] of DAG_PATTERNS) {
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BlockStatement
src/blind.ts:86:37
 	}
 
 	for (const pattern of MODEL_PATTERNS) {
-		out = out.replace(pattern, (m) => {
-			record(m.toLowerCase());
-			return "a model";
-		});
+		out = out.replace(pattern, (m) => {});
 	}
 
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BlockStatement
src/blind.ts:92:53
 		});
 	}
 
-	for (const [pattern, replacement] of DAG_PATTERNS) {
-		out = out.replace(pattern, (m) => {
-			record(m.trim().toLowerCase());
-			return replacement;
-		});
-	}
+	for (const [pattern, replacement] of DAG_PATTERNS) {}
 
 	return { text: out, hits };
killedBy: test/blind.test.ts
statusReason: strips DAG node, branch, and worktree identity: strips DAG node, branch, and worktree identity

[Killed] BlockStatement
src/blind.ts:93:37
 	}
 
 	for (const [pattern, replacement] of DAG_PATTERNS) {
-		out = out.replace(pattern, (m) => {
-			record(m.trim().toLowerCase());
-			return replacement;
-		});
+		out = out.replace(pattern, (m) => {});
 	}
 
killedBy: test/blind.test.ts
statusReason: strips DAG node, branch, and worktree identity: strips DAG node, branch, and worktree identity

[Survived] MethodExpression
src/blind.ts:94:11
 
 	for (const [pattern, replacement] of DAG_PATTERNS) {
 		out = out.replace(pattern, (m) => {
-			record(m.trim().toLowerCase());
+			record(m.toLowerCase());
 			return replacement;
 		});

[Survived] MethodExpression
src/blind.ts:94:11
 
 	for (const [pattern, replacement] of DAG_PATTERNS) {
 		out = out.replace(pattern, (m) => {
-			record(m.trim().toLowerCase());
+			record(m.trim().toUpperCase());
 			return replacement;
 		});

[Killed] ObjectLiteral
src/blind.ts:99:9
 		});
 	}
 
-	return { text: out, hits };
+	return {};
 }
 
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BlockStatement
src/blind.ts:117:48
 export const EXEMPT_CLOSE = "<!--/craft:verbatim-->";
 
 /** Wrap a block so `scrubPayload` passes it through untouched. */
-export function verbatim(text: string): string {
-	return `${EXEMPT_OPEN}\n${text}\n${EXEMPT_CLOSE}`;
-}
+export function verbatim(text: string): string {}
 
 /**
killedBy: test/blind.test.ts
statusReason: splitExempt separates prose from marked regions: splitExempt separates prose from marked regions

[Killed] StringLiteral
src/blind.ts:118:9
 
 /** Wrap a block so `scrubPayload` passes it through untouched. */
 export function verbatim(text: string): string {
-	return `${EXEMPT_OPEN}\n${text}\n${EXEMPT_CLOSE}`;
+	return ``;
 }
 
killedBy: test/blind.test.ts
statusReason: splitExempt separates prose from marked regions: splitExempt separates prose from marked regions

[Killed] BlockStatement
src/blind.ts:127:85
  * is a defect the breach counter reports, while wrongly scrubbing a survivor
  * silently destroys evidence.
  */
-export function splitExempt(text: string): Array<{ text: string; exempt: boolean }> {
-	const parts: Array<{ text: string; exempt: boolean }> = [];
-	let rest = text;
-	while (rest.length > 0) {
-		const open = rest.indexOf(EXEMPT_OPEN);
-		if (open === -1) {
-			parts.push({ text: rest, exempt: false });
-			break;
-		}
-		if (open > 0) parts.push({ text: rest.slice(0, open), exempt: false });
-		const after = open + EXEMPT_OPEN.length;
-		const close = rest.indexOf(EXEMPT_CLOSE, after);
-		if (close === -1) {
-			parts.push({ text: rest.slice(open), exempt: true });
-			break;
-		}
-		parts.push({ text: rest.slice(open, close + EXEMPT_CLOSE.length), exempt: true });
-		rest = rest.slice(close + EXEMPT_CLOSE.length);
-	}
-	return parts;
-}
+export function splitExempt(text: string): Array<{ text: string; exempt: boolean }> {}
 
 /**
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ArrayDeclaration
src/blind.ts:128:58
  * silently destroys evidence.
  */
 export function splitExempt(text: string): Array<{ text: string; exempt: boolean }> {
-	const parts: Array<{ text: string; exempt: boolean }> = [];
+	const parts: Array<{ text: string; exempt: boolean }> = ["Stryker was here"];
 	let rest = text;
 	while (rest.length > 0) {
killedBy: test/blind.test.ts
statusReason: splitExempt separates prose from marked regions: splitExempt separates prose from marked regions

[Killed] ConditionalExpression
src/blind.ts:130:9
 export function splitExempt(text: string): Array<{ text: string; exempt: boolean }> {
 	const parts: Array<{ text: string; exempt: boolean }> = [];
 	let rest = text;
-	while (rest.length > 0) {
+	while (false) {
 		const open = rest.indexOf(EXEMPT_OPEN);
 		if (open === -1) {
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] EqualityOperator
src/blind.ts:130:9
 export function splitExempt(text: string): Array<{ text: string; exempt: boolean }> {
 	const parts: Array<{ text: string; exempt: boolean }> = [];
 	let rest = text;
-	while (rest.length > 0) {
+	while (rest.length <= 0) {
 		const open = rest.indexOf(EXEMPT_OPEN);
 		if (open === -1) {
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] EqualityOperator
src/blind.ts:132:7
 	let rest = text;
 	while (rest.length > 0) {
 		const open = rest.indexOf(EXEMPT_OPEN);
-		if (open === -1) {
+		if (open !== -1) {
 			parts.push({ text: rest, exempt: false });
 			break;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
src/blind.ts:132:7
 	let rest = text;
 	while (rest.length > 0) {
 		const open = rest.indexOf(EXEMPT_OPEN);
-		if (open === -1) {
+		if (true) {
 			parts.push({ text: rest, exempt: false });
 			break;
killedBy: test/blind.test.ts
statusReason: splitExempt separates prose from marked regions: splitExempt separates prose from marked regions

[Killed] BooleanLiteral
src/blind.ts:133:37
 	while (rest.length > 0) {
 		const open = rest.indexOf(EXEMPT_OPEN);
 		if (open === -1) {
-			parts.push({ text: rest, exempt: false });
+			parts.push({ text: rest, exempt: true });
 			break;
 		}
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BooleanLiteral
src/blind.ts:136:65
 			parts.push({ text: rest, exempt: false });
 			break;
 		}
-		if (open > 0) parts.push({ text: rest.slice(0, open), exempt: false });
+		if (open > 0) parts.push({ text: rest.slice(0, open), exempt: true });
 		const after = open + EXEMPT_OPEN.length;
 		const close = rest.indexOf(EXEMPT_CLOSE, after);
killedBy: test/blind.test.ts
statusReason: splitExempt separates prose from marked regions: splitExempt separates prose from marked regions

[Killed] ConditionalExpression
src/blind.ts:136:7
 			parts.push({ text: rest, exempt: false });
 			break;
 		}
-		if (open > 0) parts.push({ text: rest.slice(0, open), exempt: false });
+		if (false) parts.push({ text: rest.slice(0, open), exempt: false });
 		const after = open + EXEMPT_OPEN.length;
 		const close = rest.indexOf(EXEMPT_CLOSE, after);
killedBy: test/blind.test.ts
statusReason: splitExempt separates prose from marked regions: splitExempt separates prose from marked regions

[Survived] ArithmeticOperator
src/blind.ts:137:17
 			break;
 		}
 		if (open > 0) parts.push({ text: rest.slice(0, open), exempt: false });
-		const after = open + EXEMPT_OPEN.length;
+		const after = open - EXEMPT_OPEN.length;
 		const close = rest.indexOf(EXEMPT_CLOSE, after);
 		if (close === -1) {

[Killed] ConditionalExpression
src/blind.ts:139:7
 		if (open > 0) parts.push({ text: rest.slice(0, open), exempt: false });
 		const after = open + EXEMPT_OPEN.length;
 		const close = rest.indexOf(EXEMPT_CLOSE, after);
-		if (close === -1) {
+		if (true) {
 			parts.push({ text: rest.slice(open), exempt: true });
 			break;
killedBy: test/blind.test.ts
statusReason: splitExempt separates prose from marked regions: splitExempt separates prose from marked regions

[Killed] BlockStatement
src/blind.ts:139:21
 		if (open > 0) parts.push({ text: rest.slice(0, open), exempt: false });
 		const after = open + EXEMPT_OPEN.length;
 		const close = rest.indexOf(EXEMPT_CLOSE, after);
-		if (close === -1) {
-			parts.push({ text: rest.slice(open), exempt: true });
-			break;
-		}
+		if (close === -1) {}
 		parts.push({ text: rest.slice(open, close + EXEMPT_CLOSE.length), exempt: true });
 		rest = rest.slice(close + EXEMPT_CLOSE.length);
killedBy: test/blind.test.ts
statusReason: an unclosed marker leaves the remainder verbatim rather than scrubbing it: an unclosed marker leaves the remainder verbatim rather than scrubbing it

[Killed] BooleanLiteral
src/blind.ts:140:49
 		const after = open + EXEMPT_OPEN.length;
 		const close = rest.indexOf(EXEMPT_CLOSE, after);
 		if (close === -1) {
-			parts.push({ text: rest.slice(open), exempt: true });
+			parts.push({ text: rest.slice(open), exempt: false });
 			break;
 		}
killedBy: test/blind.test.ts
statusReason: an unclosed marker leaves the remainder verbatim rather than scrubbing it: an unclosed marker leaves the remainder verbatim rather than scrubbing it

[Survived] MethodExpression
src/blind.ts:140:23
 		const after = open + EXEMPT_OPEN.length;
 		const close = rest.indexOf(EXEMPT_CLOSE, after);
 		if (close === -1) {
-			parts.push({ text: rest.slice(open), exempt: true });
+			parts.push({ text: rest, exempt: true });
 			break;
 		}

[Killed] MethodExpression
src/blind.ts:143:22
 			parts.push({ text: rest.slice(open), exempt: true });
 			break;
 		}
-		parts.push({ text: rest.slice(open, close + EXEMPT_CLOSE.length), exempt: true });
+		parts.push({ text: rest, exempt: true });
 		rest = rest.slice(close + EXEMPT_CLOSE.length);
 	}
killedBy: test/blind.test.ts
statusReason: a mutant replacement naming an agent survives scrubbing intact: a mutant replacement naming an agent survives scrubbing intact

[Killed] ArithmeticOperator
src/blind.ts:143:39
 			parts.push({ text: rest.slice(open), exempt: true });
 			break;
 		}
-		parts.push({ text: rest.slice(open, close + EXEMPT_CLOSE.length), exempt: true });
+		parts.push({ text: rest.slice(open, close - EXEMPT_CLOSE.length), exempt: true });
 		rest = rest.slice(close + EXEMPT_CLOSE.length);
 	}
killedBy: test/blind.test.ts
statusReason: splitExempt separates prose from marked regions: splitExempt separates prose from marked regions

[Killed] ArithmeticOperator
src/blind.ts:144:21
 			break;
 		}
 		parts.push({ text: rest.slice(open, close + EXEMPT_CLOSE.length), exempt: true });
-		rest = rest.slice(close + EXEMPT_CLOSE.length);
+		rest = rest.slice(close - EXEMPT_CLOSE.length);
 	}
 	return parts;
killedBy: test/blind.test.ts
statusReason: splitExempt separates prose from marked regions: splitExempt separates prose from marked regions

[Timeout] MethodExpression
src/blind.ts:144:10
 			break;
 		}
 		parts.push({ text: rest.slice(open, close + EXEMPT_CLOSE.length), exempt: true });
-		rest = rest.slice(close + EXEMPT_CLOSE.length);
+		rest = rest;
 	}
 	return parts;

[Killed] BlockStatement
src/blind.ts:156:87
  *
  * Regions between the verbatim markers are copied through unchanged.
  */
-export function scrubPayload(input: Record<string, unknown>, self?: string): string[] {
-	const hits: string[] = [];
-	for (const field of PAYLOAD_FIELDS) {
-		const value = input[field];
-		if (typeof value !== "string" || !value) continue;
-		const segments = splitExempt(value);
-		let changed = false;
-		const rebuilt = segments
-			.map((seg) => {
-				if (seg.exempt) return seg.text;
-				const result = scrub(seg.text, self);
-				if (result.hits.length === 0) return seg.text;
-				changed = true;
-				for (const h of result.hits) if (!hits.includes(h)) hits.push(h);
-				return result.text;
-			})
-			.join("");
-		if (changed) input[field] = rebuilt;
-	}
-	return hits;
-}
+export function scrubPayload(input: Record<string, unknown>, self?: string): string[] {}
 
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BlockStatement
src/blind.ts:158:38
  */
 export function scrubPayload(input: Record<string, unknown>, self?: string): string[] {
 	const hits: string[] = [];
-	for (const field of PAYLOAD_FIELDS) {
-		const value = input[field];
-		if (typeof value !== "string" || !value) continue;
-		const segments = splitExempt(value);
-		let changed = false;
-		const rebuilt = segments
-			.map((seg) => {
-				if (seg.exempt) return seg.text;
-				const result = scrub(seg.text, self);
-				if (result.hits.length === 0) return seg.text;
-				changed = true;
-				for (const h of result.hits) if (!hits.includes(h)) hits.push(h);
-				return result.text;
-			})
-			.join("");
-		if (changed) input[field] = rebuilt;
-	}
+	for (const field of PAYLOAD_FIELDS) {}
 	return hits;
 }
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
src/blind.ts:160:7
 	const hits: string[] = [];
 	for (const field of PAYLOAD_FIELDS) {
 		const value = input[field];
-		if (typeof value !== "string" || !value) continue;
+		if (true) continue;
 		const segments = splitExempt(value);
 		let changed = false;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned
