[Killed] EqualityOperator
src/blind.ts:160:7
 	const hits: string[] = [];
 	for (const field of PAYLOAD_FIELDS) {
 		const value = input[field];
-		if (typeof value !== "string" || !value) continue;
+		if (typeof value === "string" || !value) continue;
 		const segments = splitExempt(value);
 		let changed = false;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Survived] BooleanLiteral
src/blind.ts:162:17
 		const value = input[field];
 		if (typeof value !== "string" || !value) continue;
 		const segments = splitExempt(value);
-		let changed = false;
+		let changed = true;
 		const rebuilt = segments
 			.map((seg) => {

[Killed] BlockStatement
src/blind.ts:164:18
 		const segments = splitExempt(value);
 		let changed = false;
 		const rebuilt = segments
-			.map((seg) => {
-				if (seg.exempt) return seg.text;
-				const result = scrub(seg.text, self);
-				if (result.hits.length === 0) return seg.text;
-				changed = true;
-				for (const h of result.hits) if (!hits.includes(h)) hits.push(h);
-				return result.text;
-			})
+			.map((seg) => {})
 			.join("");
 		if (changed) input[field] = rebuilt;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
src/blind.ts:165:9
 		let changed = false;
 		const rebuilt = segments
 			.map((seg) => {
-				if (seg.exempt) return seg.text;
+				if (false) return seg.text;
 				const result = scrub(seg.text, self);
 				if (result.hits.length === 0) return seg.text;
killedBy: test/blind.test.ts
statusReason: an exempt region does not suppress scrubbing of later prose: an exempt region does not suppress scrubbing of later prose

[Killed] ConditionalExpression
src/blind.ts:165:9
 		let changed = false;
 		const rebuilt = segments
 			.map((seg) => {
-				if (seg.exempt) return seg.text;
+				if (true) return seg.text;
 				const result = scrub(seg.text, self);
 				if (result.hits.length === 0) return seg.text;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] EqualityOperator
src/blind.ts:167:9
 			.map((seg) => {
 				if (seg.exempt) return seg.text;
 				const result = scrub(seg.text, self);
-				if (result.hits.length === 0) return seg.text;
+				if (result.hits.length !== 0) return seg.text;
 				changed = true;
 				for (const h of result.hits) if (!hits.includes(h)) hits.push(h);
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
src/blind.ts:167:9
 			.map((seg) => {
 				if (seg.exempt) return seg.text;
 				const result = scrub(seg.text, self);
-				if (result.hits.length === 0) return seg.text;
+				if (true) return seg.text;
 				changed = true;
 				for (const h of result.hits) if (!hits.includes(h)) hits.push(h);
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BooleanLiteral
src/blind.ts:168:15
 				if (seg.exempt) return seg.text;
 				const result = scrub(seg.text, self);
 				if (result.hits.length === 0) return seg.text;
-				changed = true;
+				changed = false;
 				for (const h of result.hits) if (!hits.includes(h)) hits.push(h);
 				return result.text;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] BooleanLiteral
src/blind.ts:169:38
 				const result = scrub(seg.text, self);
 				if (result.hits.length === 0) return seg.text;
 				changed = true;
-				for (const h of result.hits) if (!hits.includes(h)) hits.push(h);
+				for (const h of result.hits) if (hits.includes(h)) hits.push(h);
 				return result.text;
 			})
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] CallExpression
src/blind.ts:169:57
 				const result = scrub(seg.text, self);
 				if (result.hits.length === 0) return seg.text;
 				changed = true;
-				for (const h of result.hits) if (!hits.includes(h)) hits.push(h);
+				for (const h of result.hits) if (!hits.includes(h)) ;
 				return result.text;
 			})
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Killed] ConditionalExpression
src/blind.ts:173:7
 				return result.text;
 			})
 			.join("");
-		if (changed) input[field] = rebuilt;
+		if (false) input[field] = rebuilt;
 	}
 	return hits;
killedBy: test/claude-code.test.ts
statusReason: a reviewer's payload is scrubbed before the subagent is spawned: a reviewer's payload is scrubbed before the subagent is spawned

[Survived] ConditionalExpression
src/blind.ts:173:7
 				return result.text;
 			})
 			.join("");
-		if (changed) input[field] = rebuilt;
+		if (true) input[field] = rebuilt;
 	}
 	return hits;
