[Killed] StringLiteral
src/cli.ts:185:18
 				counsel_status: arg("--counsel-status", rest),
 				blocking_findings: num("--blocking-findings", rest),
 				probe_required: has("--probe-required", rest) ? true : undefined,
-				verdict: arg("--verdict", rest),
+				verdict: arg("", rest),
 				t_status: arg("--t-status", rest),
 				p0_count: num("--p0", rest),
killedBy: test/cli.test.ts
statusReason: A cannot exit with a pass verdict while verification is red: A cannot exit with a pass verdict while verification is red

[Survived] StringLiteral
src/cli.ts:186:19
 				blocking_findings: num("--blocking-findings", rest),
 				probe_required: has("--probe-required", rest) ? true : undefined,
 				verdict: arg("--verdict", rest),
-				t_status: arg("--t-status", rest),
+				t_status: arg("", rest),
 				p0_count: num("--p0", rest),
 				non_p0_count: num("--non-p0", rest),

[Survived] StringLiteral
src/cli.ts:193:27
 				decisions: num("--decisions", rest),
 				plan_deviations: num("--plan-deviations", rest),
 				mutants_tested: num("--mutants-tested", rest),
-				mutants_survived: num("--mutants-survived", rest),
+				mutants_survived: num("", rest),
 			});
 			io.write(run.run_id + "\n");

[Survived] StringLiteral
src/cli.ts:195:26
 				mutants_tested: num("--mutants-tested", rest),
 				mutants_survived: num("--mutants-survived", rest),
 			});
-			io.write(run.run_id + "\n");
+			io.write(run.run_id + "");
 			return 0;
 		}

[Killed] ConditionalExpression
src/cli.ts:198:3
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "usage": {
-			const run = store.recordUsage(requireArg("--run", rest, io), {
-				phase: has("--phase", rest) ? parsePhase(rest, io) : undefined,
-				model: arg("--model", rest),
-				provider: arg("--provider", rest),
-				thinking: arg("--thinking", rest),
-				tokens: {
-					input: num("--input", rest) ?? 0,
-					output: num("--output", rest) ?? 0,
-					cacheRead: num("--cache-read", rest) ?? 0,
-					cacheWrite: num("--cache-write", rest) ?? 0,
-				},
-				cost_usd: num("--cost", rest),
-				turns: num("--turns", rest),
-				tool_name: arg("--tool", rest),
-				agent: arg("--agent", rest),
-				subagent: has("--subagent", rest),
-				quota_error: has("--quota-error", rest),
-				timeout: has("--timeout", rest),
-				failover: has("--failover", rest),
-				blinding_scrubs: num("--blinding-scrubs", rest),
-			});
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "usage":
 		case "verify": {
 			const code = num("--exit-code", rest);
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Killed] BlockStatement
src/cli.ts:198:17
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "usage": {
-			const run = store.recordUsage(requireArg("--run", rest, io), {
-				phase: has("--phase", rest) ? parsePhase(rest, io) : undefined,
-				model: arg("--model", rest),
-				provider: arg("--provider", rest),
-				thinking: arg("--thinking", rest),
-				tokens: {
-					input: num("--input", rest) ?? 0,
-					output: num("--output", rest) ?? 0,
-					cacheRead: num("--cache-read", rest) ?? 0,
-					cacheWrite: num("--cache-write", rest) ?? 0,
-				},
-				cost_usd: num("--cost", rest),
-				turns: num("--turns", rest),
-				tool_name: arg("--tool", rest),
-				agent: arg("--agent", rest),
-				subagent: has("--subagent", rest),
-				quota_error: has("--quota-error", rest),
-				timeout: has("--timeout", rest),
-				failover: has("--failover", rest),
-				blinding_scrubs: num("--blinding-scrubs", rest),
-			});
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "usage": {}
 		case "verify": {
 			const code = num("--exit-code", rest);
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Killed] StringLiteral
src/cli.ts:200:16
 		}
 		case "usage": {
 			const run = store.recordUsage(requireArg("--run", rest, io), {
-				phase: has("--phase", rest) ? parsePhase(rest, io) : undefined,
+				phase: has("", rest) ? parsePhase(rest, io) : undefined,
 				model: arg("--model", rest),
 				provider: arg("--provider", rest),
killedBy: test/cli.test.ts
statusReason: usage records tokens, flags, and an explicit phase stamp: usage records tokens, flags, and an explicit phase stamp

[Killed] StringLiteral
src/cli.ts:201:16
 		case "usage": {
 			const run = store.recordUsage(requireArg("--run", rest, io), {
 				phase: has("--phase", rest) ? parsePhase(rest, io) : undefined,
-				model: arg("--model", rest),
+				model: arg("", rest),
 				provider: arg("--provider", rest),
 				thinking: arg("--thinking", rest),
killedBy: test/cli.test.ts
statusReason: models marks a subscription model n/a and prices it notionally: models marks a subscription model n/a and prices it notionally

[Killed] LogicalOperator
src/cli.ts:205:13
 				provider: arg("--provider", rest),
 				thinking: arg("--thinking", rest),
 				tokens: {
-					input: num("--input", rest) ?? 0,
+					input: num("--input", rest) && 0,
 					output: num("--output", rest) ?? 0,
 					cacheRead: num("--cache-read", rest) ?? 0,
killedBy: test/cli.test.ts
statusReason: models marks a subscription model n/a and prices it notionally: models marks a subscription model n/a and prices it notionally

[Killed] StringLiteral
src/cli.ts:205:17
 				provider: arg("--provider", rest),
 				thinking: arg("--thinking", rest),
 				tokens: {
-					input: num("--input", rest) ?? 0,
+					input: num("", rest) ?? 0,
 					output: num("--output", rest) ?? 0,
 					cacheRead: num("--cache-read", rest) ?? 0,
killedBy: test/cli.test.ts
statusReason: models marks a subscription model n/a and prices it notionally: models marks a subscription model n/a and prices it notionally

[Killed] LogicalOperator
src/cli.ts:206:14
 				thinking: arg("--thinking", rest),
 				tokens: {
 					input: num("--input", rest) ?? 0,
-					output: num("--output", rest) ?? 0,
+					output: num("--output", rest) && 0,
 					cacheRead: num("--cache-read", rest) ?? 0,
 					cacheWrite: num("--cache-write", rest) ?? 0,
killedBy: test/cli.test.ts
statusReason: usage records tokens, flags, and an explicit phase stamp: usage records tokens, flags, and an explicit phase stamp

[Killed] LogicalOperator
src/cli.ts:207:17
 				tokens: {
 					input: num("--input", rest) ?? 0,
 					output: num("--output", rest) ?? 0,
-					cacheRead: num("--cache-read", rest) ?? 0,
+					cacheRead: num("--cache-read", rest) && 0,
 					cacheWrite: num("--cache-write", rest) ?? 0,
 				},
killedBy: test/cli.test.ts
statusReason: usage records tokens, flags, and an explicit phase stamp: usage records tokens, flags, and an explicit phase stamp

[Killed] LogicalOperator
src/cli.ts:208:18
 					input: num("--input", rest) ?? 0,
 					output: num("--output", rest) ?? 0,
 					cacheRead: num("--cache-read", rest) ?? 0,
-					cacheWrite: num("--cache-write", rest) ?? 0,
+					cacheWrite: num("--cache-write", rest) && 0,
 				},
 				cost_usd: num("--cost", rest),
killedBy: test/cli.test.ts
statusReason: usage records tokens, flags, and an explicit phase stamp: usage records tokens, flags, and an explicit phase stamp

[Killed] StringLiteral
src/cli.ts:210:19
 					cacheRead: num("--cache-read", rest) ?? 0,
 					cacheWrite: num("--cache-write", rest) ?? 0,
 				},
-				cost_usd: num("--cost", rest),
+				cost_usd: num("", rest),
 				turns: num("--turns", rest),
 				tool_name: arg("--tool", rest),
killedBy: test/cli.test.ts
statusReason: usage records tokens, flags, and an explicit phase stamp: usage records tokens, flags, and an explicit phase stamp

[Survived] StringLiteral
src/cli.ts:212:20
 				},
 				cost_usd: num("--cost", rest),
 				turns: num("--turns", rest),
-				tool_name: arg("--tool", rest),
+				tool_name: arg("", rest),
 				agent: arg("--agent", rest),
 				subagent: has("--subagent", rest),

[Killed] StringLiteral
src/cli.ts:214:19
 				turns: num("--turns", rest),
 				tool_name: arg("--tool", rest),
 				agent: arg("--agent", rest),
-				subagent: has("--subagent", rest),
+				subagent: has("", rest),
 				quota_error: has("--quota-error", rest),
 				timeout: has("--timeout", rest),
killedBy: test/cli.test.ts
statusReason: usage records tokens, flags, and an explicit phase stamp: usage records tokens, flags, and an explicit phase stamp

[Killed] ConditionalExpression
src/cli.ts:223:3
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "verify": {
-			const code = num("--exit-code", rest);
-			if (code === undefined || Number.isNaN(code)) fail(io, "missing or invalid --exit-code");
-			const run = store.recordVerify(requireArg("--run", rest, io), requireArg("--command", rest, io), code);
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "verify":
 		case "pause":
 			store.pauseHitl(requireArg("--run", rest, io));
killedBy: test/cli.test.ts
statusReason: verify requires a numeric exit code: verify requires a numeric exit code

[Killed] BlockStatement
src/cli.ts:223:18
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "verify": {
-			const code = num("--exit-code", rest);
-			if (code === undefined || Number.isNaN(code)) fail(io, "missing or invalid --exit-code");
-			const run = store.recordVerify(requireArg("--run", rest, io), requireArg("--command", rest, io), code);
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "verify": {}
 		case "pause":
 			store.pauseHitl(requireArg("--run", rest, io));
killedBy: test/cli.test.ts
statusReason: verify requires a numeric exit code: verify requires a numeric exit code

[Killed] ConditionalExpression
src/cli.ts:225:8
 		}
 		case "verify": {
 			const code = num("--exit-code", rest);
-			if (code === undefined || Number.isNaN(code)) fail(io, "missing or invalid --exit-code");
+			if (true) fail(io, "missing or invalid --exit-code");
 			const run = store.recordVerify(requireArg("--run", rest, io), requireArg("--command", rest, io), code);
 			io.write(run.run_id + "\n");
killedBy: test/cli.test.ts
statusReason: verify records the command and its exit code: verify records the command and its exit code

[Killed] ConditionalExpression
src/cli.ts:225:8
 		}
 		case "verify": {
 			const code = num("--exit-code", rest);
-			if (code === undefined || Number.isNaN(code)) fail(io, "missing or invalid --exit-code");
+			if (false) fail(io, "missing or invalid --exit-code");
 			const run = store.recordVerify(requireArg("--run", rest, io), requireArg("--command", rest, io), code);
 			io.write(run.run_id + "\n");
killedBy: test/cli.test.ts
statusReason: verify requires a numeric exit code: verify requires a numeric exit code

[Killed] StringLiteral
src/cli.ts:226:77
 		case "verify": {
 			const code = num("--exit-code", rest);
 			if (code === undefined || Number.isNaN(code)) fail(io, "missing or invalid --exit-code");
-			const run = store.recordVerify(requireArg("--run", rest, io), requireArg("--command", rest, io), code);
+			const run = store.recordVerify(requireArg("--run", rest, io), requireArg("", rest, io), code);
 			io.write(run.run_id + "\n");
 			return 0;
killedBy: test/cli.test.ts
statusReason: verify records the command and its exit code: verify records the command and its exit code

[Killed] ConditionalExpression
src/cli.ts:230:3
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "pause":
-			store.pauseHitl(requireArg("--run", rest, io));
-			return 0;
+		case "pause":
 		case "resume":
 			store.resumeHitl(requireArg("--run", rest, io));
killedBy: test/cli.test.ts
statusReason: pause and resume bracket a HITL wait: pause and resume bracket a HITL wait

[Killed] StringLiteral
src/cli.ts:230:8
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "pause":
+		case "":
 			store.pauseHitl(requireArg("--run", rest, io));
 			return 0;
killedBy: test/cli.test.ts
statusReason: pause and resume bracket a HITL wait: pause and resume bracket a HITL wait

[Killed] StringLiteral
src/cli.ts:231:31
 			return 0;
 		}
 		case "pause":
-			store.pauseHitl(requireArg("--run", rest, io));
+			store.pauseHitl(requireArg("", rest, io));
 			return 0;
 		case "resume":
killedBy: test/cli.test.ts
statusReason: pause and resume bracket a HITL wait: pause and resume bracket a HITL wait

[Killed] ConditionalExpression
src/cli.ts:233:3
 		case "pause":
 			store.pauseHitl(requireArg("--run", rest, io));
 			return 0;
-		case "resume":
-			store.resumeHitl(requireArg("--run", rest, io));
-			return 0;
+		case "resume":
 		case "mode":
 			store.setMode(requireArg("--run", rest, io), parseMode(rest, io));
killedBy: test/cli.test.ts
statusReason: pause and resume bracket a HITL wait: pause and resume bracket a HITL wait

[Killed] StringLiteral
src/cli.ts:233:8
 		case "pause":
 			store.pauseHitl(requireArg("--run", rest, io));
 			return 0;
-		case "resume":
+		case "":
 			store.resumeHitl(requireArg("--run", rest, io));
 			return 0;
killedBy: test/cli.test.ts
statusReason: pause and resume bracket a HITL wait: pause and resume bracket a HITL wait

[Killed] ConditionalExpression
src/cli.ts:236:3
 		case "resume":
 			store.resumeHitl(requireArg("--run", rest, io));
 			return 0;
-		case "mode":
-			store.setMode(requireArg("--run", rest, io), parseMode(rest, io));
-			return 0;
+		case "mode":
 		case "kind":
 			store.setKind(requireArg("--run", rest, io), parseKind(rest, io));
killedBy: test/cli.test.ts
statusReason: mode and kind can be corrected after start: mode and kind can be corrected after start

[Killed] ConditionalExpression
src/cli.ts:239:3
 		case "mode":
 			store.setMode(requireArg("--run", rest, io), parseMode(rest, io));
 			return 0;
-		case "kind":
-			store.setKind(requireArg("--run", rest, io), parseKind(rest, io));
-			return 0;
+		case "kind":
 		case "host":
 			store.setHost(requireArg("--run", rest, io), parseHost(rest, io));
killedBy: test/cli.test.ts
statusReason: mode and kind can be corrected after start: mode and kind can be corrected after start

[Killed] ConditionalExpression
src/cli.ts:242:3
 		case "kind":
 			store.setKind(requireArg("--run", rest, io), parseKind(rest, io));
 			return 0;
-		case "host":
-			store.setHost(requireArg("--run", rest, io), parseHost(rest, io));
-			return 0;
+		case "host":
 		case "end": {
 			const outcome = (arg("--outcome", rest) as Outcome | undefined) ?? "completed";
killedBy: test/cli.test.ts
statusReason: totals headings name the harness, and host corrects a mislabelled run: totals headings name the harness, and host corrects a mislabelled run

[Killed] ConditionalExpression
src/cli.ts:245:3
 		case "host":
 			store.setHost(requireArg("--run", rest, io), parseHost(rest, io));
 			return 0;
-		case "end": {
-			const outcome = (arg("--outcome", rest) as Outcome | undefined) ?? "completed";
-			store.endRun(requireArg("--run", rest, io), outcome);
-			return 0;
-		}
+		case "end":
 		case "current": {
 			const cwd = arg("--cwd", rest) ?? io.cwd();
killedBy: test/cli.test.ts
statusReason: end defaults to completed and accepts an explicit outcome: end defaults to completed and accepts an explicit outcome

[Killed] BlockStatement
src/cli.ts:245:15
 		case "host":
 			store.setHost(requireArg("--run", rest, io), parseHost(rest, io));
 			return 0;
-		case "end": {
-			const outcome = (arg("--outcome", rest) as Outcome | undefined) ?? "completed";
-			store.endRun(requireArg("--run", rest, io), outcome);
-			return 0;
-		}
+		case "end": {}
 		case "current": {
 			const cwd = arg("--cwd", rest) ?? io.cwd();
killedBy: test/cli.test.ts
statusReason: end defaults to completed and accepts an explicit outcome: end defaults to completed and accepts an explicit outcome

[Killed] LogicalOperator
src/cli.ts:246:20
 			store.setHost(requireArg("--run", rest, io), parseHost(rest, io));
 			return 0;
 		case "end": {
-			const outcome = (arg("--outcome", rest) as Outcome | undefined) ?? "completed";
+			const outcome = arg("--outcome", rest) as Outcome | undefined && "completed";
 			store.endRun(requireArg("--run", rest, io), outcome);
 			return 0;
killedBy: test/cli.test.ts
statusReason: end defaults to completed and accepts an explicit outcome: end defaults to completed and accepts an explicit outcome

[Killed] StringLiteral
src/cli.ts:247:28
 			return 0;
 		case "end": {
 			const outcome = (arg("--outcome", rest) as Outcome | undefined) ?? "completed";
-			store.endRun(requireArg("--run", rest, io), outcome);
+			store.endRun(requireArg("", rest, io), outcome);
 			return 0;
 		}
killedBy: test/cli.test.ts
statusReason: end defaults to completed and accepts an explicit outcome: end defaults to completed and accepts an explicit outcome

[Killed] ConditionalExpression
src/cli.ts:250:3
 			store.endRun(requireArg("--run", rest, io), outcome);
 			return 0;
 		}
-		case "current": {
-			const cwd = arg("--cwd", rest) ?? io.cwd();
-			const run = store.latestOpenForCwd(cwd);
-			if (!run) return 1;
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "current":
 		case "show": {
 			const id = arg("--run", rest);
killedBy: test/cli.test.ts
statusReason: current exits 1 when no run is open for the directory: current exits 1 when no run is open for the directory

[Killed] BlockStatement
src/cli.ts:250:19
 			store.endRun(requireArg("--run", rest, io), outcome);
 			return 0;
 		}
-		case "current": {
-			const cwd = arg("--cwd", rest) ?? io.cwd();
-			const run = store.latestOpenForCwd(cwd);
-			if (!run) return 1;
-			io.write(run.run_id + "\n");
-			return 0;
-		}
+		case "current": {}
 		case "show": {
 			const id = arg("--run", rest);
killedBy: test/cli.test.ts
statusReason: current exits 1 when no run is open for the directory: current exits 1 when no run is open for the directory

[Killed] LogicalOperator
src/cli.ts:251:16
 			return 0;
 		}
 		case "current": {
-			const cwd = arg("--cwd", rest) ?? io.cwd();
+			const cwd = arg("--cwd", rest) && io.cwd();
 			const run = store.latestOpenForCwd(cwd);
 			if (!run) return 1;
killedBy: test/cli.test.ts
statusReason: current prints the open run for a directory: current prints the open run for a directory

[Killed] BooleanLiteral
src/cli.ts:253:8
 		case "current": {
 			const cwd = arg("--cwd", rest) ?? io.cwd();
 			const run = store.latestOpenForCwd(cwd);
-			if (!run) return 1;
+			if (run) return 1;
 			io.write(run.run_id + "\n");
 			return 0;
killedBy: test/cli.test.ts
statusReason: current exits 1 when no run is open for the directory: current exits 1 when no run is open for the directory

[Killed] ConditionalExpression
src/cli.ts:253:8
 		case "current": {
 			const cwd = arg("--cwd", rest) ?? io.cwd();
 			const run = store.latestOpenForCwd(cwd);
-			if (!run) return 1;
+			if (false) return 1;
 			io.write(run.run_id + "\n");
 			return 0;
killedBy: test/cli.test.ts
statusReason: current exits 1 when no run is open for the directory: current exits 1 when no run is open for the directory

[Killed] ConditionalExpression
src/cli.ts:257:3
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "show": {
-			const id = arg("--run", rest);
-			const last = num("--last", rest);
-			let runs = store.loadAll();
-			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
-			if (last) runs = runs.slice(-last);
-			io.write(summarize(runs) + "\n");
-			return 0;
-		}
+		case "show":
 		case "pin-versions": {
 			// Inference is recomputed on every read, so a classifier change silently
killedBy: test/cli.test.ts
statusReason: show reports nothing gracefully when there are no runs: show reports nothing gracefully when there are no runs

[Killed] BlockStatement
src/cli.ts:257:16
 			io.write(run.run_id + "\n");
 			return 0;
 		}
-		case "show": {
-			const id = arg("--run", rest);
-			const last = num("--last", rest);
-			let runs = store.loadAll();
-			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
-			if (last) runs = runs.slice(-last);
-			io.write(summarize(runs) + "\n");
-			return 0;
-		}
+		case "show": {}
 		case "pin-versions": {
 			// Inference is recomputed on every read, so a classifier change silently
killedBy: test/cli.test.ts
statusReason: show reports nothing gracefully when there are no runs: show reports nothing gracefully when there are no runs

[Killed] StringLiteral
src/cli.ts:259:21
 		}
 		case "show": {
 			const id = arg("--run", rest);
-			const last = num("--last", rest);
+			const last = num("", rest);
 			let runs = store.loadAll();
 			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
killedBy: test/cli.test.ts
statusReason: show --last keeps only the most recent runs: show --last keeps only the most recent runs

[Killed] ConditionalExpression
src/cli.ts:261:8
 			const id = arg("--run", rest);
 			const last = num("--last", rest);
 			let runs = store.loadAll();
-			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
+			if (true) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
 			if (last) runs = runs.slice(-last);
 			io.write(summarize(runs) + "\n");
killedBy: test/cli.test.ts
statusReason: show --last keeps only the most recent runs: show --last keeps only the most recent runs

[Survived] MethodExpression
src/cli.ts:261:57
 			const id = arg("--run", rest);
 			const last = num("--last", rest);
 			let runs = store.loadAll();
-			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
+			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.endsWith(id));
 			if (last) runs = runs.slice(-last);
 			io.write(summarize(runs) + "\n");

[Killed] ConditionalExpression
src/cli.ts:262:8
 			const last = num("--last", rest);
 			let runs = store.loadAll();
 			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
-			if (last) runs = runs.slice(-last);
+			if (false) runs = runs.slice(-last);
 			io.write(summarize(runs) + "\n");
 			return 0;
killedBy: test/cli.test.ts
statusReason: show --last keeps only the most recent runs: show --last keeps only the most recent runs

[Killed] MethodExpression
src/cli.ts:262:21
 			const last = num("--last", rest);
 			let runs = store.loadAll();
 			if (id) runs = runs.filter((r) => r.run_id === id || r.run_id.startsWith(id));
-			if (last) runs = runs.slice(-last);
+			if (last) runs = runs;
 			io.write(summarize(runs) + "\n");
 			return 0;
killedBy: test/cli.test.ts
statusReason: show --last keeps only the most recent runs: show --last keeps only the most recent runs

[Killed] BlockStatement
src/cli.ts:266:24
 			io.write(summarize(runs) + "\n");
 			return 0;
 		}
-		case "pin-versions": {
-			// Inference is recomputed on every read, so a classifier change silently
-			// re-dates historical runs. Pinning freezes what the classifier concluded
-			// today. The stored event keeps `source: inferred`, so a pinned guess is
-			// never mistaken for something the skill declared.
-			const runs = store.loadAll();
-			const target = runs.filter((r) => r.craft_version && r.craft_version_source === "inferred");
-			if (target.length === 0) {
-				io.write("nothing to pin — no run carries an inferred version\n");
-				return 0;
-			}
-			const apply = has("--apply", rest);
-			for (const r of target) {
-				io.write(`${r.run_id.slice(0, 8)}  v${r.craft_version}  ${r.repo ?? r.cwd}\n`);
-				if (apply) store.setCraftVersion(r.run_id, r.craft_version!, "inferred");
-			}
-			io.write(
-				apply
-					? `\npinned ${target.length} run${target.length === 1 ? "" : "s"} — still marked inferred, not declared\n`
-					: `\n${target.length} run${target.length === 1 ? "" : "s"} would be pinned. Re-run with --apply to write.\n`,
-			);
-			return 0;
-		}
+		case "pin-versions": {}
 		case "doctor": {
 			const complaints = diagnose(store.loadAll(), io.now(), num("--stale-hours", rest) ?? 12);
killedBy: test/cli.test.ts
statusReason: pin-versions writes nothing without --apply: pin-versions writes nothing without --apply

[Killed] ConditionalExpression
src/cli.ts:266:3
 			io.write(summarize(runs) + "\n");
 			return 0;
 		}
-		case "pin-versions": {
-			// Inference is recomputed on every read, so a classifier change silently
-			// re-dates historical runs. Pinning freezes what the classifier concluded
-			// today. The stored event keeps `source: inferred`, so a pinned guess is
-			// never mistaken for something the skill declared.
-			const runs = store.loadAll();
-			const target = runs.filter((r) => r.craft_version && r.craft_version_source === "inferred");
-			if (target.length === 0) {
-				io.write("nothing to pin — no run carries an inferred version\n");
-				return 0;
-			}
-			const apply = has("--apply", rest);
-			for (const r of target) {
-				io.write(`${r.run_id.slice(0, 8)}  v${r.craft_version}  ${r.repo ?? r.cwd}\n`);
-				if (apply) store.setCraftVersion(r.run_id, r.craft_version!, "inferred");
-			}
-			io.write(
-				apply
-					? `\npinned ${target.length} run${target.length === 1 ? "" : "s"} — still marked inferred, not declared\n`
-					: `\n${target.length} run${target.length === 1 ? "" : "s"} would be pinned. Re-run with --apply to write.\n`,
-			);
-			return 0;
-		}
+		case "pin-versions":
 		case "doctor": {
 			const complaints = diagnose(store.loadAll(), io.now(), num("--stale-hours", rest) ?? 12);
killedBy: test/cli.test.ts
statusReason: pin-versions writes nothing without --apply: pin-versions writes nothing without --apply

[Killed] ArrowFunction
src/cli.ts:272:31
 			// today. The stored event keeps `source: inferred`, so a pinned guess is
 			// never mistaken for something the skill declared.
 			const runs = store.loadAll();
-			const target = runs.filter((r) => r.craft_version && r.craft_version_source === "inferred");
+			const target = runs.filter(() => undefined);
 			if (target.length === 0) {
 				io.write("nothing to pin — no run carries an inferred version\n");
killedBy: test/cli.test.ts
statusReason: pin-versions writes nothing without --apply: pin-versions writes nothing without --apply

[Killed] EqualityOperator
src/cli.ts:272:57
 			// today. The stored event keeps `source: inferred`, so a pinned guess is
 			// never mistaken for something the skill declared.
 			const runs = store.loadAll();
-			const target = runs.filter((r) => r.craft_version && r.craft_version_source === "inferred");
+			const target = runs.filter((r) => r.craft_version && r.craft_version_source !== "inferred");
 			if (target.length === 0) {
 				io.write("nothing to pin — no run carries an inferred version\n");
killedBy: test/cli.test.ts
statusReason: pin-versions writes nothing without --apply: pin-versions writes nothing without --apply

[Killed] ConditionalExpression
src/cli.ts:273:8
 			// never mistaken for something the skill declared.
 			const runs = store.loadAll();
 			const target = runs.filter((r) => r.craft_version && r.craft_version_source === "inferred");
-			if (target.length === 0) {
+			if (true) {
 				io.write("nothing to pin — no run carries an inferred version\n");
 				return 0;
killedBy: test/cli.test.ts
statusReason: pin-versions writes nothing without --apply: pin-versions writes nothing without --apply

[Killed] EqualityOperator
src/cli.ts:273:8
 			// never mistaken for something the skill declared.
 			const runs = store.loadAll();
 			const target = runs.filter((r) => r.craft_version && r.craft_version_source === "inferred");
-			if (target.length === 0) {
+			if (target.length !== 0) {
 				io.write("nothing to pin — no run carries an inferred version\n");
 				return 0;
killedBy: test/cli.test.ts
statusReason: pin-versions writes nothing without --apply: pin-versions writes nothing without --apply

[Killed] StringLiteral
src/cli.ts:274:14
 			const runs = store.loadAll();
 			const target = runs.filter((r) => r.craft_version && r.craft_version_source === "inferred");
 			if (target.length === 0) {
-				io.write("nothing to pin — no run carries an inferred version\n");
+				io.write("");
 				return 0;
 			}
killedBy: test/cli.test.ts
statusReason: pin-versions leaves declared runs alone and says so when there is nothing to do: pin-versions leaves declared runs alone and says so when there is nothing to do

[Killed] BlockStatement
src/cli.ts:278:28
 				return 0;
 			}
 			const apply = has("--apply", rest);
-			for (const r of target) {
-				io.write(`${r.run_id.slice(0, 8)}  v${r.craft_version}  ${r.repo ?? r.cwd}\n`);
-				if (apply) store.setCraftVersion(r.run_id, r.craft_version!, "inferred");
-			}
+			for (const r of target) {}
 			io.write(
 				apply
killedBy: test/cli.test.ts
statusReason: pin-versions --apply persists the inference with its provenance: pin-versions --apply persists the inference with its provenance

[Survived] MethodExpression
src/cli.ts:279:17
 			}
 			const apply = has("--apply", rest);
 			for (const r of target) {
-				io.write(`${r.run_id.slice(0, 8)}  v${r.craft_version}  ${r.repo ?? r.cwd}\n`);
+				io.write(`${r.run_id}  v${r.craft_version}  ${r.repo ?? r.cwd}\n`);
 				if (apply) store.setCraftVersion(r.run_id, r.craft_version!, "inferred");
 			}

[Survived] LogicalOperator
src/cli.ts:279:63
 			}
 			const apply = has("--apply", rest);
 			for (const r of target) {
-				io.write(`${r.run_id.slice(0, 8)}  v${r.craft_version}  ${r.repo ?? r.cwd}\n`);
+				io.write(`${r.run_id.slice(0, 8)}  v${r.craft_version}  ${r.repo && r.cwd}\n`);
 				if (apply) store.setCraftVersion(r.run_id, r.craft_version!, "inferred");
 			}
