[Killed] ConditionalExpression
src/cli.ts:280:9
 			const apply = has("--apply", rest);
 			for (const r of target) {
 				io.write(`${r.run_id.slice(0, 8)}  v${r.craft_version}  ${r.repo ?? r.cwd}\n`);
-				if (apply) store.setCraftVersion(r.run_id, r.craft_version!, "inferred");
+				if (true) store.setCraftVersion(r.run_id, r.craft_version!, "inferred");
 			}
 			io.write(
killedBy: test/cli.test.ts
statusReason: pin-versions writes nothing without --apply: pin-versions writes nothing without --apply

[Killed] ConditionalExpression
src/cli.ts:280:9
 			const apply = has("--apply", rest);
 			for (const r of target) {
 				io.write(`${r.run_id.slice(0, 8)}  v${r.craft_version}  ${r.repo ?? r.cwd}\n`);
-				if (apply) store.setCraftVersion(r.run_id, r.craft_version!, "inferred");
+				if (false) store.setCraftVersion(r.run_id, r.craft_version!, "inferred");
 			}
 			io.write(
killedBy: test/cli.test.ts
statusReason: pin-versions --apply persists the inference with its provenance: pin-versions --apply persists the inference with its provenance

[Survived] ConditionalExpression
src/cli.ts:284:40
 			}
 			io.write(
 				apply
-					? `\npinned ${target.length} run${target.length === 1 ? "" : "s"} — still marked inferred, not declared\n`
+					? `\npinned ${target.length} run${true ? "" : "s"} — still marked inferred, not declared\n`
 					: `\n${target.length} run${target.length === 1 ? "" : "s"} would be pinned. Re-run with --apply to write.\n`,
 			);

[Survived] ConditionalExpression
src/cli.ts:284:40
 			}
 			io.write(
 				apply
-					? `\npinned ${target.length} run${target.length === 1 ? "" : "s"} — still marked inferred, not declared\n`
+					? `\npinned ${target.length} run${false ? "" : "s"} — still marked inferred, not declared\n`
 					: `\n${target.length} run${target.length === 1 ? "" : "s"} would be pinned. Re-run with --apply to write.\n`,
 			);

[Survived] EqualityOperator
src/cli.ts:285:33
 			io.write(
 				apply
 					? `\npinned ${target.length} run${target.length === 1 ? "" : "s"} — still marked inferred, not declared\n`
-					: `\n${target.length} run${target.length === 1 ? "" : "s"} would be pinned. Re-run with --apply to write.\n`,
+					: `\n${target.length} run${target.length !== 1 ? "" : "s"} would be pinned. Re-run with --apply to write.\n`,
 			);
 			return 0;

[Survived] ConditionalExpression
src/cli.ts:285:33
 			io.write(
 				apply
 					? `\npinned ${target.length} run${target.length === 1 ? "" : "s"} — still marked inferred, not declared\n`
-					: `\n${target.length} run${target.length === 1 ? "" : "s"} would be pinned. Re-run with --apply to write.\n`,
+					: `\n${target.length} run${false ? "" : "s"} would be pinned. Re-run with --apply to write.\n`,
 			);
 			return 0;

[Killed] BlockStatement
src/cli.ts:289:18
 			);
 			return 0;
 		}
-		case "doctor": {
-			const complaints = diagnose(store.loadAll(), io.now(), num("--stale-hours", rest) ?? 12);
-			if (complaints.length === 0) {
-				io.write("no data-quality problems found\n");
-				return 0;
-			}
-			for (const c of complaints) {
-				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "";
-				const cost = c.cost_usd > 0 ? ` [$${c.cost_usd.toFixed(2)}]` : "";
-				io.write(`${c.kind.padEnd(15)} ${id}${c.detail}${cost}\n`);
-			}
-			// Nonzero so `craft-metrics doctor` can gate a script.
-			return 1;
-		}
+		case "doctor": {}
 		case "totals": {
 			const runs = store.loadAll();
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Killed] ConditionalExpression
src/cli.ts:289:3
 			);
 			return 0;
 		}
-		case "doctor": {
-			const complaints = diagnose(store.loadAll(), io.now(), num("--stale-hours", rest) ?? 12);
-			if (complaints.length === 0) {
-				io.write("no data-quality problems found\n");
-				return 0;
-			}
-			for (const c of complaints) {
-				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "";
-				const cost = c.cost_usd > 0 ? ` [$${c.cost_usd.toFixed(2)}]` : "";
-				io.write(`${c.kind.padEnd(15)} ${id}${c.detail}${cost}\n`);
-			}
-			// Nonzero so `craft-metrics doctor` can gate a script.
-			return 1;
-		}
+		case "doctor":
 		case "totals": {
 			const runs = store.loadAll();
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Survived] LogicalOperator
src/cli.ts:290:59
 			return 0;
 		}
 		case "doctor": {
-			const complaints = diagnose(store.loadAll(), io.now(), num("--stale-hours", rest) ?? 12);
+			const complaints = diagnose(store.loadAll(), io.now(), num("--stale-hours", rest) && 12);
 			if (complaints.length === 0) {
 				io.write("no data-quality problems found\n");

[Killed] BlockStatement
src/cli.ts:291:33
 		}
 		case "doctor": {
 			const complaints = diagnose(store.loadAll(), io.now(), num("--stale-hours", rest) ?? 12);
-			if (complaints.length === 0) {
-				io.write("no data-quality problems found\n");
-				return 0;
-			}
+			if (complaints.length === 0) {}
 			for (const c of complaints) {
 				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "";
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Killed] ConditionalExpression
src/cli.ts:291:8
 		}
 		case "doctor": {
 			const complaints = diagnose(store.loadAll(), io.now(), num("--stale-hours", rest) ?? 12);
-			if (complaints.length === 0) {
+			if (true) {
 				io.write("no data-quality problems found\n");
 				return 0;
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Killed] BlockStatement
src/cli.ts:295:32
 				io.write("no data-quality problems found\n");
 				return 0;
 			}
-			for (const c of complaints) {
-				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "";
-				const cost = c.cost_usd > 0 ? ` [$${c.cost_usd.toFixed(2)}]` : "";
-				io.write(`${c.kind.padEnd(15)} ${id}${c.detail}${cost}\n`);
-			}
+			for (const c of complaints) {}
 			// Nonzero so `craft-metrics doctor` can gate a script.
 			return 1;
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Survived] MethodExpression
src/cli.ts:296:30
 				return 0;
 			}
 			for (const c of complaints) {
-				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "";
+				const id = c.run_id ? `${c.run_id} ` : "";
 				const cost = c.cost_usd > 0 ? ` [$${c.cost_usd.toFixed(2)}]` : "";
 				io.write(`${c.kind.padEnd(15)} ${id}${c.detail}${cost}\n`);

[Survived] StringLiteral
src/cli.ts:296:56
 				return 0;
 			}
 			for (const c of complaints) {
-				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "";
+				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "Stryker was here!";
 				const cost = c.cost_usd > 0 ? ` [$${c.cost_usd.toFixed(2)}]` : "";
 				io.write(`${c.kind.padEnd(15)} ${id}${c.detail}${cost}\n`);

[Survived] EqualityOperator
src/cli.ts:297:18
 			}
 			for (const c of complaints) {
 				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "";
-				const cost = c.cost_usd > 0 ? ` [$${c.cost_usd.toFixed(2)}]` : "";
+				const cost = c.cost_usd <= 0 ? ` [$${c.cost_usd.toFixed(2)}]` : "";
 				io.write(`${c.kind.padEnd(15)} ${id}${c.detail}${cost}\n`);
 			}

[Survived] ConditionalExpression
src/cli.ts:297:18
 			}
 			for (const c of complaints) {
 				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "";
-				const cost = c.cost_usd > 0 ? ` [$${c.cost_usd.toFixed(2)}]` : "";
+				const cost = true ? ` [$${c.cost_usd.toFixed(2)}]` : "";
 				io.write(`${c.kind.padEnd(15)} ${id}${c.detail}${cost}\n`);
 			}

[Killed] StringLiteral
src/cli.ts:298:14
 			for (const c of complaints) {
 				const id = c.run_id ? `${c.run_id.slice(0, 8)} ` : "";
 				const cost = c.cost_usd > 0 ? ` [$${c.cost_usd.toFixed(2)}]` : "";
-				io.write(`${c.kind.padEnd(15)} ${id}${c.detail}${cost}\n`);
+				io.write(``);
 			}
 			// Nonzero so `craft-metrics doctor` can gate a script.
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Survived] CallExpression
src/cli.ts:307:5
 			const runs = store.loadAll();
 			const header = "phase          n     cost     notional      time      turns      in     out   cache\n";
 			const writeTable = (totals: Map<PhaseName, PhaseTotal>) => {
-				io.write(header);
+				;
 				for (const [name, t] of totals) {
 					io.write(

[Killed] ConditionalExpression
src/cli.ts:318:8
 			// shape — v3's three-agent counsel panel against v4's single reviewer, or
 			// Pi's routing against Claude Code's — and reads as one coherent number
 			// when it is not. `--all` opts back into the blend.
-			if (has("--all", rest)) {
+			if (true) {
 				writeTable(phaseTotals(runs));
 			} else {
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] ConditionalExpression
src/cli.ts:318:8
 			// shape — v3's three-agent counsel panel against v4's single reviewer, or
 			// Pi's routing against Claude Code's — and reads as one coherent number
 			// when it is not. `--all` opts back into the blend.
-			if (has("--all", rest)) {
+			if (false) {
 				writeTable(phaseTotals(runs));
 			} else {
killedBy: test/cli.test.ts
statusReason: totals --all blends versions into a single table: totals --all blends versions into a single table

[Survived] CallExpression
src/cli.ts:319:5
 			// Pi's routing against Claude Code's — and reads as one coherent number
 			// when it is not. `--all` opts back into the blend.
 			if (has("--all", rest)) {
-				writeTable(phaseTotals(runs));
+				;
 			} else {
 				for (const g of phaseTotalsByGroup(runs)) {

[Killed] BlockStatement
src/cli.ts:320:11
 			// when it is not. `--all` opts back into the blend.
 			if (has("--all", rest)) {
 				writeTable(phaseTotals(runs));
-			} else {
-				for (const g of phaseTotalsByGroup(runs)) {
-					const mark = g.inferred > 0 ? ` (${g.inferred} inferred)` : "";
-					// "vunknown" reads as a version number; an unclassified run has none.
-					const label = g.craft_version === "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
-					io.write(`\n── ${label} · ${g.host} — ${g.n} run${g.n === 1 ? "" : "s"}${mark}\n`);
-					writeTable(g.totals);
-				}
-			}
+			} else {}
 			io.write(
 				"\n`cost` is what you paid; `notional` is what the tokens are worth at list price\n" +
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] BlockStatement
src/cli.ts:321:47
 			if (has("--all", rest)) {
 				writeTable(phaseTotals(runs));
 			} else {
-				for (const g of phaseTotalsByGroup(runs)) {
-					const mark = g.inferred > 0 ? ` (${g.inferred} inferred)` : "";
-					// "vunknown" reads as a version number; an unclassified run has none.
-					const label = g.craft_version === "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
-					io.write(`\n── ${label} · ${g.host} — ${g.n} run${g.n === 1 ? "" : "s"}${mark}\n`);
-					writeTable(g.totals);
-				}
+				for (const g of phaseTotalsByGroup(runs)) {}
 			}
 			io.write(
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] EqualityOperator
src/cli.ts:322:19
 				writeTable(phaseTotals(runs));
 			} else {
 				for (const g of phaseTotalsByGroup(runs)) {
-					const mark = g.inferred > 0 ? ` (${g.inferred} inferred)` : "";
+					const mark = g.inferred <= 0 ? ` (${g.inferred} inferred)` : "";
 					// "vunknown" reads as a version number; an unclassified run has none.
 					const label = g.craft_version === "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] ConditionalExpression
src/cli.ts:322:19
 				writeTable(phaseTotals(runs));
 			} else {
 				for (const g of phaseTotalsByGroup(runs)) {
-					const mark = g.inferred > 0 ? ` (${g.inferred} inferred)` : "";
+					const mark = false ? ` (${g.inferred} inferred)` : "";
 					// "vunknown" reads as a version number; an unclassified run has none.
 					const label = g.craft_version === "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] EqualityOperator
src/cli.ts:324:20
 				for (const g of phaseTotalsByGroup(runs)) {
 					const mark = g.inferred > 0 ? ` (${g.inferred} inferred)` : "";
 					// "vunknown" reads as a version number; an unclassified run has none.
-					const label = g.craft_version === "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
+					const label = g.craft_version !== "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
 					io.write(`\n── ${label} · ${g.host} — ${g.n} run${g.n === 1 ? "" : "s"}${mark}\n`);
 					writeTable(g.totals);
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Killed] ConditionalExpression
src/cli.ts:324:20
 				for (const g of phaseTotalsByGroup(runs)) {
 					const mark = g.inferred > 0 ? ` (${g.inferred} inferred)` : "";
 					// "vunknown" reads as a version number; an unclassified run has none.
-					const label = g.craft_version === "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
+					const label = true ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
 					io.write(`\n── ${label} · ${g.host} — ${g.n} run${g.n === 1 ? "" : "s"}${mark}\n`);
 					writeTable(g.totals);
killedBy: test/cli.test.ts
statusReason: totals splits by workflow version and labels inferred ones: totals splits by workflow version and labels inferred ones

[Survived] EqualityOperator
src/cli.ts:325:56
 					const mark = g.inferred > 0 ? ` (${g.inferred} inferred)` : "";
 					// "vunknown" reads as a version number; an unclassified run has none.
 					const label = g.craft_version === "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
-					io.write(`\n── ${label} · ${g.host} — ${g.n} run${g.n === 1 ? "" : "s"}${mark}\n`);
+					io.write(`\n── ${label} · ${g.host} — ${g.n} run${g.n !== 1 ? "" : "s"}${mark}\n`);
 					writeTable(g.totals);
 				}

[Survived] ConditionalExpression
src/cli.ts:325:56
 					const mark = g.inferred > 0 ? ` (${g.inferred} inferred)` : "";
 					// "vunknown" reads as a version number; an unclassified run has none.
 					const label = g.craft_version === "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
-					io.write(`\n── ${label} · ${g.host} — ${g.n} run${g.n === 1 ? "" : "s"}${mark}\n`);
+					io.write(`\n── ${label} · ${g.host} — ${g.n} run${true ? "" : "s"}${mark}\n`);
 					writeTable(g.totals);
 				}

[Survived] CallExpression
src/cli.ts:326:6
 					// "vunknown" reads as a version number; an unclassified run has none.
 					const label = g.craft_version === "unknown" ? "CRAFTS version unknown" : `CRAFTS v${g.craft_version}`;
 					io.write(`\n── ${label} · ${g.host} — ${g.n} run${g.n === 1 ? "" : "s"}${mark}\n`);
-					writeTable(g.totals);
+					;
 				}
 			}

[Survived] StringLiteral
src/cli.ts:330:5
 				}
 			}
 			io.write(
-				"\n`cost` is what you paid; `notional` is what the tokens are worth at list price\n" +
+				"" +
 					"(fills in $0 subscription phases). Compare phases by notional, not cost.\n" +
 					"Split by workflow version and harness — phases changed shape between versions,\n" +

[Killed] ConditionalExpression
src/cli.ts:338:3
 			);
 			return 0;
 		}
-		case "models": {
-			const rows = modelTotals(store.loadAll());
-			if (rows.length === 0) {
-				io.write("no model usage recorded\n");
-				return 0;
-			}
-			io.write(
-				"model                          host         turns      cost   notional      in     out   cache\n",
-			);
-			for (const m of rows) {
-				const cost = m.costless ? "     n/a" : `$${m.cost.toFixed(2).padStart(7)}`;
-				const notional = m.unpriced ? "   unpriced" : `  $${m.notional.toFixed(2).padStart(8)}`;
-				io.write(
-					`${m.model.padEnd(29)} ${m.host.padEnd(11)} ${String(m.turns).padStart(5)}  ${cost}${notional}  ${mtok(m.tokens.input)}  ${mtok(m.tokens.output)}  ${mtok(m.tokens.cacheRead)}\n`,
-				);
-			}
-			if (rows.some((m) => m.costless)) {
-				io.write(
-					"\nn/a = subscription-billed, no per-token price reported. Compare tokens, not cost.\n",
-				);
-			}
-			return 0;
-		}
+		case "models":
 		default:
 			io.error(`unknown command ${cmd}`);
killedBy: test/cli.test.ts
statusReason: models reports nothing gracefully when no model usage exists: models reports nothing gracefully when no model usage exists

[Killed] BlockStatement
src/cli.ts:338:18
 			);
 			return 0;
 		}
-		case "models": {
-			const rows = modelTotals(store.loadAll());
-			if (rows.length === 0) {
-				io.write("no model usage recorded\n");
-				return 0;
-			}
-			io.write(
-				"model                          host         turns      cost   notional      in     out   cache\n",
-			);
-			for (const m of rows) {
-				const cost = m.costless ? "     n/a" : `$${m.cost.toFixed(2).padStart(7)}`;
-				const notional = m.unpriced ? "   unpriced" : `  $${m.notional.toFixed(2).padStart(8)}`;
-				io.write(
-					`${m.model.padEnd(29)} ${m.host.padEnd(11)} ${String(m.turns).padStart(5)}  ${cost}${notional}  ${mtok(m.tokens.input)}  ${mtok(m.tokens.output)}  ${mtok(m.tokens.cacheRead)}\n`,
-				);
-			}
-			if (rows.some((m) => m.costless)) {
-				io.write(
-					"\nn/a = subscription-billed, no per-token price reported. Compare tokens, not cost.\n",
-				);
-			}
-			return 0;
-		}
+		case "models": {}
 		default:
 			io.error(`unknown command ${cmd}`);
killedBy: test/cli.test.ts
statusReason: models reports nothing gracefully when no model usage exists: models reports nothing gracefully when no model usage exists

[Killed] ConditionalExpression
src/cli.ts:340:8
 		}
 		case "models": {
 			const rows = modelTotals(store.loadAll());
-			if (rows.length === 0) {
+			if (true) {
 				io.write("no model usage recorded\n");
 				return 0;
killedBy: test/cli.test.ts
statusReason: models marks a subscription model n/a and prices it notionally: models marks a subscription model n/a and prices it notionally

[Killed] ConditionalExpression
src/cli.ts:340:8
 		}
 		case "models": {
 			const rows = modelTotals(store.loadAll());
-			if (rows.length === 0) {
+			if (false) {
 				io.write("no model usage recorded\n");
 				return 0;
killedBy: test/cli.test.ts
statusReason: models reports nothing gracefully when no model usage exists: models reports nothing gracefully when no model usage exists

[Survived] StringLiteral
src/cli.ts:345:5
 				return 0;
 			}
 			io.write(
-				"model                          host         turns      cost   notional      in     out   cache\n",
+				"",
 			);
 			for (const m of rows) {

[Killed] BlockStatement
src/cli.ts:347:26
 			io.write(
 				"model                          host         turns      cost   notional      in     out   cache\n",
 			);
-			for (const m of rows) {
-				const cost = m.costless ? "     n/a" : `$${m.cost.toFixed(2).padStart(7)}`;
-				const notional = m.unpriced ? "   unpriced" : `  $${m.notional.toFixed(2).padStart(8)}`;
-				io.write(
-					`${m.model.padEnd(29)} ${m.host.padEnd(11)} ${String(m.turns).padStart(5)}  ${cost}${notional}  ${mtok(m.tokens.input)}  ${mtok(m.tokens.output)}  ${mtok(m.tokens.cacheRead)}\n`,
-				);
-			}
+			for (const m of rows) {}
 			if (rows.some((m) => m.costless)) {
 				io.write(
killedBy: test/cli.test.ts
statusReason: models marks a subscription model n/a and prices it notionally: models marks a subscription model n/a and prices it notionally

[Survived] StringLiteral
src/cli.ts:348:31
 				"model                          host         turns      cost   notional      in     out   cache\n",
 			);
 			for (const m of rows) {
-				const cost = m.costless ? "     n/a" : `$${m.cost.toFixed(2).padStart(7)}`;
+				const cost = m.costless ? "" : `$${m.cost.toFixed(2).padStart(7)}`;
 				const notional = m.unpriced ? "   unpriced" : `  $${m.notional.toFixed(2).padStart(8)}`;
 				io.write(

[Killed] StringLiteral
src/cli.ts:351:6
 				const cost = m.costless ? "     n/a" : `$${m.cost.toFixed(2).padStart(7)}`;
 				const notional = m.unpriced ? "   unpriced" : `  $${m.notional.toFixed(2).padStart(8)}`;
 				io.write(
-					`${m.model.padEnd(29)} ${m.host.padEnd(11)} ${String(m.turns).padStart(5)}  ${cost}${notional}  ${mtok(m.tokens.input)}  ${mtok(m.tokens.output)}  ${mtok(m.tokens.cacheRead)}\n`,
+					``,
 				);
 			}
killedBy: test/cli.test.ts
statusReason: models marks a subscription model n/a and prices it notionally: models marks a subscription model n/a and prices it notionally

[Killed] BlockStatement
src/cli.ts:354:38
 					`${m.model.padEnd(29)} ${m.host.padEnd(11)} ${String(m.turns).padStart(5)}  ${cost}${notional}  ${mtok(m.tokens.input)}  ${mtok(m.tokens.output)}  ${mtok(m.tokens.cacheRead)}\n`,
 				);
 			}
-			if (rows.some((m) => m.costless)) {
-				io.write(
-					"\nn/a = subscription-billed, no per-token price reported. Compare tokens, not cost.\n",
-				);
-			}
+			if (rows.some((m) => m.costless)) {}
 			return 0;
 		}
killedBy: test/cli.test.ts
statusReason: models marks a subscription model n/a and prices it notionally: models marks a subscription model n/a and prices it notionally

[Killed] ConditionalExpression
src/cli.ts:354:8
 					`${m.model.padEnd(29)} ${m.host.padEnd(11)} ${String(m.turns).padStart(5)}  ${cost}${notional}  ${mtok(m.tokens.input)}  ${mtok(m.tokens.output)}  ${mtok(m.tokens.cacheRead)}\n`,
 				);
 			}
-			if (rows.some((m) => m.costless)) {
+			if (false) {
 				io.write(
 					"\nn/a = subscription-billed, no per-token price reported. Compare tokens, not cost.\n",
killedBy: test/cli.test.ts
statusReason: models marks a subscription model n/a and prices it notionally: models marks a subscription model n/a and prices it notionally

[Killed] ConditionalExpression
src/cli.ts:361:3
 			}
 			return 0;
 		}
-		default:
-			io.error(`unknown command ${cmd}`);
-			io.write(USAGE);
-			return 2;
+		default:
 	}
 }
killedBy: test/cli.test.ts
statusReason: an unknown command exits 2 and shows usage: an unknown command exits 2 and shows usage

[Killed] CallExpression
src/cli.ts:363:4
 		}
 		default:
 			io.error(`unknown command ${cmd}`);
-			io.write(USAGE);
+			;
 			return 2;
 	}
killedBy: test/cli.test.ts
statusReason: an unknown command exits 2 and shows usage: an unknown command exits 2 and shows usage

[Killed] BlockStatement
src/cli.ts:369:65
 }
 
 /** Entry point: turn an ExitSignal or a thrown error into a process exit code. */
-export function run(argv: string[], io: Io = defaultIo): number {
-	try {
-		return main(argv, io);
-	} catch (err) {
-		if (err instanceof ExitSignal) return err.code;
-		io.error(err instanceof Error ? err.message : String(err));
-		return 2;
-	}
-}
+export function run(argv: string[], io: Io = defaultIo): number {}
 
 // Self-execute only when run as a program, never when a test imports this file.
killedBy: test/cli.test.ts
statusReason: an invalid kind, mode, or phase exits 2 with a specific message: an invalid kind, mode, or phase exits 2 with a specific message

[Killed] BlockStatement
src/cli.ts:370:6
 
 /** Entry point: turn an ExitSignal or a thrown error into a process exit code. */
 export function run(argv: string[], io: Io = defaultIo): number {
-	try {
-		return main(argv, io);
-	} catch (err) {
+	try {} catch (err) {
 		if (err instanceof ExitSignal) return err.code;
 		io.error(err instanceof Error ? err.message : String(err));
killedBy: test/cli.test.ts
statusReason: an invalid kind, mode, or phase exits 2 with a specific message: an invalid kind, mode, or phase exits 2 with a specific message

[Killed] BlockStatement
src/cli.ts:372:16
 export function run(argv: string[], io: Io = defaultIo): number {
 	try {
 		return main(argv, io);
-	} catch (err) {
-		if (err instanceof ExitSignal) return err.code;
-		io.error(err instanceof Error ? err.message : String(err));
-		return 2;
-	}
+	} catch (err) {}
 }
 
killedBy: test/cli.test.ts
statusReason: an invalid kind, mode, or phase exits 2 with a specific message: an invalid kind, mode, or phase exits 2 with a specific message

[Killed] ConditionalExpression
src/cli.ts:373:7
 	try {
 		return main(argv, io);
 	} catch (err) {
-		if (err instanceof ExitSignal) return err.code;
+		if (true) return err.code;
 		io.error(err instanceof Error ? err.message : String(err));
 		return 2;
killedBy: test/cli.test.ts
statusReason: lite mode refuses a counsel phase, surfacing the store's guard as exit 2: lite mode refuses a counsel phase, surfacing the store's guard as exit 2

[Survived] ConditionalExpression
src/cli.ts:373:7
 	try {
 		return main(argv, io);
 	} catch (err) {
-		if (err instanceof ExitSignal) return err.code;
+		if (false) return err.code;
 		io.error(err instanceof Error ? err.message : String(err));
 		return 2;

[Killed] CallExpression
src/cli.ts:374:3
 		return main(argv, io);
 	} catch (err) {
 		if (err instanceof ExitSignal) return err.code;
-		io.error(err instanceof Error ? err.message : String(err));
+		;
 		return 2;
 	}
killedBy: test/cli.test.ts
statusReason: lite mode refuses a counsel phase, surfacing the store's guard as exit 2: lite mode refuses a counsel phase, surfacing the store's guard as exit 2

[Survived] LogicalOperator
src/cli.ts:381:5
 
 // Self-execute only when run as a program, never when a test imports this file.
 // Compared through realpath so the bin shim's resolved path matches.
-if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {
+if (process.argv[1] || realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {
 	process.exit(run(process.argv.slice(2)));
 }

[Survived] ConditionalExpression
src/cli.ts:381:5
 
 // Self-execute only when run as a program, never when a test imports this file.
 // Compared through realpath so the bin shim's resolved path matches.
-if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {
+if (true) {
 	process.exit(run(process.argv.slice(2)));
 }

[NoCoverage] MethodExpression
src/cli.ts:382:19
 // Self-execute only when run as a program, never when a test imports this file.
 // Compared through realpath so the bin shim's resolved path matches.
 if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {
-	process.exit(run(process.argv.slice(2)));
+	process.exit(run(process.argv));
 }
 
