[Survived] ObjectLiteral
src/hooks-install-cli.ts:16:30
 	backup(from: string, to: string): void;
 }
 
-export const defaultIo: Io = {
-	write: (s) => process.stdout.write(s),
-	error: (s) => console.error(s),
-	read: (path) => (existsSync(path) ? readFileSync(path, "utf8") : undefined),
-	save: (path, contents) => {
-		mkdirSync(dirname(path), { recursive: true });
-		writeFileSync(path, contents);
-	},
-	backup: (from, to) => copyFileSync(from, to),
-};
+export const defaultIo: Io = {};
 
 export function defaultCommand(): string {

[Survived] ArrowFunction
src/hooks-install-cli.ts:19:8
 export const defaultIo: Io = {
 	write: (s) => process.stdout.write(s),
 	error: (s) => console.error(s),
-	read: (path) => (existsSync(path) ? readFileSync(path, "utf8") : undefined),
+	read: () => undefined,
 	save: (path, contents) => {
 		mkdirSync(dirname(path), { recursive: true });

[NoCoverage] BlockStatement
src/hooks-install-cli.ts:20:28
 	write: (s) => process.stdout.write(s),
 	error: (s) => console.error(s),
 	read: (path) => (existsSync(path) ? readFileSync(path, "utf8") : undefined),
-	save: (path, contents) => {
-		mkdirSync(dirname(path), { recursive: true });
-		writeFileSync(path, contents);
-	},
+	save: (path, contents) => {},
 	backup: (from, to) => copyFileSync(from, to),
 };

[NoCoverage] BooleanLiteral
src/hooks-install-cli.ts:21:41
 	error: (s) => console.error(s),
 	read: (path) => (existsSync(path) ? readFileSync(path, "utf8") : undefined),
 	save: (path, contents) => {
-		mkdirSync(dirname(path), { recursive: true });
+		mkdirSync(dirname(path), { recursive: false });
 		writeFileSync(path, contents);
 	},

[NoCoverage] CallExpression
src/hooks-install-cli.ts:22:3
 	read: (path) => (existsSync(path) ? readFileSync(path, "utf8") : undefined),
 	save: (path, contents) => {
 		mkdirSync(dirname(path), { recursive: true });
-		writeFileSync(path, contents);
+		;
 	},
 	backup: (from, to) => copyFileSync(from, to),

[Survived] ArrowFunction
src/hooks-install-cli.ts:24:10
 		mkdirSync(dirname(path), { recursive: true });
 		writeFileSync(path, contents);
 	},
-	backup: (from, to) => copyFileSync(from, to),
+	backup: () => undefined,
 };
 

[NoCoverage] BlockStatement
src/hooks-install-cli.ts:27:42
 	backup: (from, to) => copyFileSync(from, to),
 };
 
-export function defaultCommand(): string {
-	return join(homedir(), ".local", "bin", "craft-hook");
-}
+export function defaultCommand(): string {}
 
 export function main(argv: string[], io: Io = defaultIo, command = defaultCommand()): number {

[NoCoverage] StringLiteral
src/hooks-install-cli.ts:28:42
 };
 
 export function defaultCommand(): string {
-	return join(homedir(), ".local", "bin", "craft-hook");
+	return join(homedir(), ".local", "bin", "");
 }
 

[Killed] ConditionalExpression
src/hooks-install-cli.ts:33:6
 
 export function main(argv: string[], io: Io = defaultIo, command = defaultCommand()): number {
 	const path = argv[0];
-	if (!path) {
+	if (false) {
 		io.error("usage: craft-hooks-install <settings.json>");
 		return 2;
killedBy: test/hooks-install.test.ts
statusReason: no path argument exits 2: no path argument exits 2

[Killed] ConditionalExpression
src/hooks-install-cli.ts:33:6
 
 export function main(argv: string[], io: Io = defaultIo, command = defaultCommand()): number {
 	const path = argv[0];
-	if (!path) {
+	if (true) {
 		io.error("usage: craft-hooks-install <settings.json>");
 		return 2;
killedBy: test/hooks-install.test.ts
statusReason: the previous settings file is backed up before it is rewritten: the previous settings file is backed up before it is rewritten

[Killed] StringLiteral
src/hooks-install-cli.ts:34:12
 export function main(argv: string[], io: Io = defaultIo, command = defaultCommand()): number {
 	const path = argv[0];
 	if (!path) {
-		io.error("usage: craft-hooks-install <settings.json>");
+		io.error("");
 		return 2;
 	}
killedBy: test/hooks-install.test.ts
statusReason: no path argument exits 2: no path argument exits 2

[Killed] BlockStatement
src/hooks-install-cli.ts:40:46
 
 	const raw = io.read(path);
 	let settings: Settings = {};
-	if (raw !== undefined && raw.trim() !== "") {
-		try {
-			settings = JSON.parse(raw) as Settings;
-		} catch (err) {
-			// Never overwrite a settings file we could not read — that is the user's
-			// whole configuration, and a parse failure here is far more likely to be a
-			// transient edit than a file worth replacing.
-			io.error(`refusing to touch ${path}: ${err instanceof Error ? err.message : String(err)}`);
-			return 1;
-		}
-	}
+	if (raw !== undefined && raw.trim() !== "") {}
 
 	const { settings: next, added } = withHooks(settings, command);
killedBy: test/hooks-install.test.ts
statusReason: a settings file that will not parse is left completely alone: a settings file that will not parse is left completely alone

[Killed] EqualityOperator
src/hooks-install-cli.ts:40:27
 
 	const raw = io.read(path);
 	let settings: Settings = {};
-	if (raw !== undefined && raw.trim() !== "") {
+	if (raw !== undefined && raw.trim() === "") {
 		try {
 			settings = JSON.parse(raw) as Settings;
killedBy: test/hooks-install.test.ts
statusReason: a settings file that will not parse is left completely alone: a settings file that will not parse is left completely alone

[Killed] BlockStatement
src/hooks-install-cli.ts:41:7
 	const raw = io.read(path);
 	let settings: Settings = {};
 	if (raw !== undefined && raw.trim() !== "") {
-		try {
-			settings = JSON.parse(raw) as Settings;
-		} catch (err) {
+		try {} catch (err) {
 			// Never overwrite a settings file we could not read — that is the user's
 			// whole configuration, and a parse failure here is far more likely to be a
killedBy: test/hooks-install.test.ts
statusReason: a settings file that will not parse is left completely alone: a settings file that will not parse is left completely alone

[Killed] BlockStatement
src/hooks-install-cli.ts:43:17
 	if (raw !== undefined && raw.trim() !== "") {
 		try {
 			settings = JSON.parse(raw) as Settings;
-		} catch (err) {
-			// Never overwrite a settings file we could not read — that is the user's
-			// whole configuration, and a parse failure here is far more likely to be a
-			// transient edit than a file worth replacing.
-			io.error(`refusing to touch ${path}: ${err instanceof Error ? err.message : String(err)}`);
-			return 1;
-		}
+		} catch (err) {}
 	}
 
killedBy: test/hooks-install.test.ts
statusReason: a settings file that will not parse is left completely alone: a settings file that will not parse is left completely alone

[Killed] BlockStatement
src/hooks-install-cli.ts:53:26
 	}
 
 	const { settings: next, added } = withHooks(settings, command);
-	if (added.length === 0) {
-		io.write(`craft hooks already registered in ${path}\n`);
-		return 0;
-	}
+	if (added.length === 0) {}
 
 	if (raw !== undefined) io.backup(path, `${path}.craft-backup`);
killedBy: test/hooks-install.test.ts
statusReason: a second run reports the no-op instead of rewriting the file: a second run reports the no-op instead of rewriting the file

[Killed] EqualityOperator
src/hooks-install-cli.ts:53:6
 	}
 
 	const { settings: next, added } = withHooks(settings, command);
-	if (added.length === 0) {
+	if (added.length !== 0) {
 		io.write(`craft hooks already registered in ${path}\n`);
 		return 0;
killedBy: test/hooks-install.test.ts
statusReason: the previous settings file is backed up before it is rewritten: the previous settings file is backed up before it is rewritten

[Killed] StringLiteral
src/hooks-install-cli.ts:54:12
 
 	const { settings: next, added } = withHooks(settings, command);
 	if (added.length === 0) {
-		io.write(`craft hooks already registered in ${path}\n`);
+		io.write(``);
 		return 0;
 	}
killedBy: test/hooks-install.test.ts
statusReason: a second run reports the no-op instead of rewriting the file: a second run reports the no-op instead of rewriting the file

[Killed] ConditionalExpression
src/hooks-install-cli.ts:58:6
 		return 0;
 	}
 
-	if (raw !== undefined) io.backup(path, `${path}.craft-backup`);
+	if (false) io.backup(path, `${path}.craft-backup`);
 	io.save(path, `${JSON.stringify(next, null, 2)}\n`);
 	for (const event of added) {
killedBy: test/hooks-install.test.ts
statusReason: the previous settings file is backed up before it is rewritten: the previous settings file is backed up before it is rewritten

[Killed] EqualityOperator
src/hooks-install-cli.ts:58:6
 		return 0;
 	}
 
-	if (raw !== undefined) io.backup(path, `${path}.craft-backup`);
+	if (raw === undefined) io.backup(path, `${path}.craft-backup`);
 	io.save(path, `${JSON.stringify(next, null, 2)}\n`);
 	for (const event of added) {
killedBy: test/hooks-install.test.ts
statusReason: the previous settings file is backed up before it is rewritten: the previous settings file is backed up before it is rewritten

[Killed] StringLiteral
src/hooks-install-cli.ts:59:16
 	}
 
 	if (raw !== undefined) io.backup(path, `${path}.craft-backup`);
-	io.save(path, `${JSON.stringify(next, null, 2)}\n`);
+	io.save(path, ``);
 	for (const event of added) {
 		const why = HOOK_EVENTS.find((h) => h.event === event)?.why ?? "";
killedBy: test/hooks-install.test.ts
statusReason: the previous settings file is backed up before it is rewritten: the previous settings file is backed up before it is rewritten

[Survived] BlockStatement
src/hooks-install-cli.ts:60:29
 
 	if (raw !== undefined) io.backup(path, `${path}.craft-backup`);
 	io.save(path, `${JSON.stringify(next, null, 2)}\n`);
-	for (const event of added) {
-		const why = HOOK_EVENTS.find((h) => h.event === event)?.why ?? "";
-		io.write(`+ ${event.padEnd(20)} ${why}\n`);
-	}
+	for (const event of added) {}
 	io.write(`\nregistered ${added.length} hook${added.length === 1 ? "" : "s"} in ${path}\n`);
 	if (raw !== undefined) io.write(`previous settings saved to ${path}.craft-backup\n`);

[Survived] ArrowFunction
src/hooks-install-cli.ts:61:32
 	if (raw !== undefined) io.backup(path, `${path}.craft-backup`);
 	io.save(path, `${JSON.stringify(next, null, 2)}\n`);
 	for (const event of added) {
-		const why = HOOK_EVENTS.find((h) => h.event === event)?.why ?? "";
+		const why = HOOK_EVENTS.find(() => undefined)?.why ?? "";
 		io.write(`+ ${event.padEnd(20)} ${why}\n`);
 	}

[Survived] EqualityOperator
src/hooks-install-cli.ts:61:39
 	if (raw !== undefined) io.backup(path, `${path}.craft-backup`);
 	io.save(path, `${JSON.stringify(next, null, 2)}\n`);
 	for (const event of added) {
-		const why = HOOK_EVENTS.find((h) => h.event === event)?.why ?? "";
+		const why = HOOK_EVENTS.find((h) => h.event !== event)?.why ?? "";
 		io.write(`+ ${event.padEnd(20)} ${why}\n`);
 	}

[Survived] ConditionalExpression
src/hooks-install-cli.ts:64:47
 		const why = HOOK_EVENTS.find((h) => h.event === event)?.why ?? "";
 		io.write(`+ ${event.padEnd(20)} ${why}\n`);
 	}
-	io.write(`\nregistered ${added.length} hook${added.length === 1 ? "" : "s"} in ${path}\n`);
+	io.write(`\nregistered ${added.length} hook${true ? "" : "s"} in ${path}\n`);
 	if (raw !== undefined) io.write(`previous settings saved to ${path}.craft-backup\n`);
 	// Hooks are read at startup, so a running session keeps the old set.

[Survived] ConditionalExpression
src/hooks-install-cli.ts:64:47
 		const why = HOOK_EVENTS.find((h) => h.event === event)?.why ?? "";
 		io.write(`+ ${event.padEnd(20)} ${why}\n`);
 	}
-	io.write(`\nregistered ${added.length} hook${added.length === 1 ? "" : "s"} in ${path}\n`);
+	io.write(`\nregistered ${added.length} hook${false ? "" : "s"} in ${path}\n`);
 	if (raw !== undefined) io.write(`previous settings saved to ${path}.craft-backup\n`);
 	// Hooks are read at startup, so a running session keeps the old set.

[Survived] EqualityOperator
src/hooks-install-cli.ts:65:6
 		io.write(`+ ${event.padEnd(20)} ${why}\n`);
 	}
 	io.write(`\nregistered ${added.length} hook${added.length === 1 ? "" : "s"} in ${path}\n`);
-	if (raw !== undefined) io.write(`previous settings saved to ${path}.craft-backup\n`);
+	if (raw === undefined) io.write(`previous settings saved to ${path}.craft-backup\n`);
 	// Hooks are read at startup, so a running session keeps the old set.
 	io.write("Claude Code reads hooks at startup — restart any open session to pick these up.\n");

[Survived] ConditionalExpression
src/hooks-install-cli.ts:65:6
 		io.write(`+ ${event.padEnd(20)} ${why}\n`);
 	}
 	io.write(`\nregistered ${added.length} hook${added.length === 1 ? "" : "s"} in ${path}\n`);
-	if (raw !== undefined) io.write(`previous settings saved to ${path}.craft-backup\n`);
+	if (true) io.write(`previous settings saved to ${path}.craft-backup\n`);
 	// Hooks are read at startup, so a running session keeps the old set.
 	io.write("Claude Code reads hooks at startup — restart any open session to pick these up.\n");
