[Killed] ArrayDeclaration
src/hooks-install.ts:12:85
  */
 
 /** Which events the adapter needs, and the matcher each one is registered under. */
-export const HOOK_EVENTS: Array<{ event: string; matcher?: string; why: string }> = [
-	{ event: "SessionStart", why: "pick up a run that was already open in this cwd" },
-	{ event: "UserPromptSubmit", why: "open a run when the prompt starts a CRAFTS protocol" },
-	// Narrow on purpose: this is the only handler that rewrites a tool's input, and
-	// it should not be in the path of every Read and Bash in the session.
-	{ event: "PreToolUse", matcher: "Agent|Task", why: "blind a reviewer's payload before the subagent spawns" },
-	{ event: "PostToolUse", why: "bill the turns and count the tool call" },
-	{ event: "PostToolUseFailure", why: "same, plus classify quota / timeout / failover" },
-	{ event: "SubagentStop", why: "bill a subagent from its own transcript" },
-	{ event: "Stop", why: "bill the last turn of the exchange" },
-	{ event: "SessionEnd", why: "final flush, then drop this session's bookkeeping" },
-];
+export const HOOK_EVENTS: Array<{ event: string; matcher?: string; why: string }> = [];
 
 interface HookEntry {
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Killed] ObjectLiteral
src/hooks-install.ts:13:2
 
 /** Which events the adapter needs, and the matcher each one is registered under. */
 export const HOOK_EVENTS: Array<{ event: string; matcher?: string; why: string }> = [
-	{ event: "SessionStart", why: "pick up a run that was already open in this cwd" },
+	{},
 	{ event: "UserPromptSubmit", why: "open a run when the prompt starts a CRAFTS protocol" },
 	// Narrow on purpose: this is the only handler that rewrites a tool's input, and
killedBy: test/hooks-install.test.ts
statusReason: the previous settings file is backed up before it is rewritten: the previous settings file is backed up before it is rewritten

[Killed] StringLiteral
src/hooks-install.ts:17:11
 	{ event: "UserPromptSubmit", why: "open a run when the prompt starts a CRAFTS protocol" },
 	// Narrow on purpose: this is the only handler that rewrites a tool's input, and
 	// it should not be in the path of every Read and Bash in the session.
-	{ event: "PreToolUse", matcher: "Agent|Task", why: "blind a reviewer's payload before the subagent spawns" },
+	{ event: "", matcher: "Agent|Task", why: "blind a reviewer's payload before the subagent spawns" },
 	{ event: "PostToolUse", why: "bill the turns and count the tool call" },
 	{ event: "PostToolUseFailure", why: "same, plus classify quota / timeout / failover" },
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Killed] StringLiteral
src/hooks-install.ts:18:11
 	// Narrow on purpose: this is the only handler that rewrites a tool's input, and
 	// it should not be in the path of every Read and Bash in the session.
 	{ event: "PreToolUse", matcher: "Agent|Task", why: "blind a reviewer's payload before the subagent spawns" },
-	{ event: "PostToolUse", why: "bill the turns and count the tool call" },
+	{ event: "", why: "bill the turns and count the tool call" },
 	{ event: "PostToolUseFailure", why: "same, plus classify quota / timeout / failover" },
 	{ event: "SubagentStop", why: "bill a subagent from its own transcript" },
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Survived] StringLiteral
src/hooks-install.ts:18:31
 	// Narrow on purpose: this is the only handler that rewrites a tool's input, and
 	// it should not be in the path of every Read and Bash in the session.
 	{ event: "PreToolUse", matcher: "Agent|Task", why: "blind a reviewer's payload before the subagent spawns" },
-	{ event: "PostToolUse", why: "bill the turns and count the tool call" },
+	{ event: "PostToolUse", why: "" },
 	{ event: "PostToolUseFailure", why: "same, plus classify quota / timeout / failover" },
 	{ event: "SubagentStop", why: "bill a subagent from its own transcript" },

[Killed] ObjectLiteral
src/hooks-install.ts:19:2
 	// it should not be in the path of every Read and Bash in the session.
 	{ event: "PreToolUse", matcher: "Agent|Task", why: "blind a reviewer's payload before the subagent spawns" },
 	{ event: "PostToolUse", why: "bill the turns and count the tool call" },
-	{ event: "PostToolUseFailure", why: "same, plus classify quota / timeout / failover" },
+	{},
 	{ event: "SubagentStop", why: "bill a subagent from its own transcript" },
 	{ event: "Stop", why: "bill the last turn of the exchange" },
killedBy: test/hooks-install.test.ts
statusReason: the previous settings file is backed up before it is rewritten: the previous settings file is backed up before it is rewritten

[Killed] StringLiteral
src/hooks-install.ts:21:11
 	{ event: "PostToolUse", why: "bill the turns and count the tool call" },
 	{ event: "PostToolUseFailure", why: "same, plus classify quota / timeout / failover" },
 	{ event: "SubagentStop", why: "bill a subagent from its own transcript" },
-	{ event: "Stop", why: "bill the last turn of the exchange" },
+	{ event: "", why: "bill the last turn of the exchange" },
 	{ event: "SessionEnd", why: "final flush, then drop this session's bookkeeping" },
 ];
killedBy: test/hooks-install.test.ts
statusReason: the previous settings file is backed up before it is rewritten: the previous settings file is backed up before it is rewritten

[Killed] ObjectLiteral
src/hooks-install.ts:22:2
 	{ event: "PostToolUseFailure", why: "same, plus classify quota / timeout / failover" },
 	{ event: "SubagentStop", why: "bill a subagent from its own transcript" },
 	{ event: "Stop", why: "bill the last turn of the exchange" },
-	{ event: "SessionEnd", why: "final flush, then drop this session's bookkeeping" },
+	{},
 ];
 
killedBy: test/hooks-install.test.ts
statusReason: the previous settings file is backed up before it is rewritten: the previous settings file is backed up before it is rewritten

[Survived] StringLiteral
src/hooks-install.ts:22:30
 	{ event: "PostToolUseFailure", why: "same, plus classify quota / timeout / failover" },
 	{ event: "SubagentStop", why: "bill a subagent from its own transcript" },
 	{ event: "Stop", why: "bill the last turn of the exchange" },
-	{ event: "SessionEnd", why: "final flush, then drop this session's bookkeeping" },
+	{ event: "SessionEnd", why: "" },
 ];
 

[Killed] BlockStatement
src/hooks-install.ts:40:90
 	[key: string]: unknown;
 }
 
-function registered(entries: MatcherEntry[], command: string, matcher?: string): boolean {
-	return entries.some(
-		(entry) => (entry.matcher ?? undefined) === matcher && (entry.hooks ?? []).some((h) => h.command === command),
-	);
-}
+function registered(entries: MatcherEntry[], command: string, matcher?: string): boolean {}
 
 export interface InstallResult {
killedBy: test/hooks-install.test.ts
statusReason: re-running adds nothing — link-global is run often: re-running adds nothing — link-global is run often

[Killed] MethodExpression
src/hooks-install.ts:41:9
 }
 
 function registered(entries: MatcherEntry[], command: string, matcher?: string): boolean {
-	return entries.some(
-		(entry) => (entry.matcher ?? undefined) === matcher && (entry.hooks ?? []).some((h) => h.command === command),
-	);
+	return entries.every(entry => (entry.matcher ?? undefined) === matcher && (entry.hooks ?? []).some(h => h.command === command));
 }
 
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Killed] ConditionalExpression
src/hooks-install.ts:42:90
 
 function registered(entries: MatcherEntry[], command: string, matcher?: string): boolean {
 	return entries.some(
-		(entry) => (entry.matcher ?? undefined) === matcher && (entry.hooks ?? []).some((h) => h.command === command),
+		(entry) => (entry.matcher ?? undefined) === matcher && (entry.hooks ?? []).some((h) => false),
 	);
 }
killedBy: test/hooks-install.test.ts
statusReason: re-running adds nothing — link-global is run often: re-running adds nothing — link-global is run often

[Killed] ArrowFunction
src/hooks-install.ts:42:3
 
 function registered(entries: MatcherEntry[], command: string, matcher?: string): boolean {
 	return entries.some(
-		(entry) => (entry.matcher ?? undefined) === matcher && (entry.hooks ?? []).some((h) => h.command === command),
+		() => undefined,
 	);
 }
killedBy: test/hooks-install.test.ts
statusReason: re-running adds nothing — link-global is run often: re-running adds nothing — link-global is run often

[Killed] BlockStatement
src/hooks-install.ts:56:79
  * Return the settings with every missing hook added. The input is not mutated, so a
  * caller can compare before deciding whether the file needs rewriting at all.
  */
-export function withHooks(settings: Settings, command: string): InstallResult {
-	const next: Settings = { ...settings, hooks: { ...(settings.hooks ?? {}) } };
-	const added: string[] = [];
-	for (const { event, matcher } of HOOK_EVENTS) {
-		const entries = [...(next.hooks![event] ?? [])];
-		if (registered(entries, command, matcher)) continue;
-		entries.push({
-			...(matcher ? { matcher } : {}),
-			hooks: [{ type: "command", command }],
-		});
-		next.hooks![event] = entries;
-		added.push(event);
-	}
-	return { settings: next, added };
-}
+export function withHooks(settings: Settings, command: string): InstallResult {}
 
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Killed] LogicalOperator
src/hooks-install.ts:57:53
  * caller can compare before deciding whether the file needs rewriting at all.
  */
 export function withHooks(settings: Settings, command: string): InstallResult {
-	const next: Settings = { ...settings, hooks: { ...(settings.hooks ?? {}) } };
+	const next: Settings = { ...settings, hooks: { ...(settings.hooks && {}) } };
 	const added: string[] = [];
 	for (const { event, matcher } of HOOK_EVENTS) {
killedBy: test/hooks-install.test.ts
statusReason: re-running adds nothing — link-global is run often: re-running adds nothing — link-global is run often

[Killed] BlockStatement
src/hooks-install.ts:59:48
 export function withHooks(settings: Settings, command: string): InstallResult {
 	const next: Settings = { ...settings, hooks: { ...(settings.hooks ?? {}) } };
 	const added: string[] = [];
-	for (const { event, matcher } of HOOK_EVENTS) {
-		const entries = [...(next.hooks![event] ?? [])];
-		if (registered(entries, command, matcher)) continue;
-		entries.push({
-			...(matcher ? { matcher } : {}),
-			hooks: [{ type: "command", command }],
-		});
-		next.hooks![event] = entries;
-		added.push(event);
-	}
+	for (const { event, matcher } of HOOK_EVENTS) {}
 	return { settings: next, added };
 }
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Killed] LogicalOperator
src/hooks-install.ts:60:24
 	const next: Settings = { ...settings, hooks: { ...(settings.hooks ?? {}) } };
 	const added: string[] = [];
 	for (const { event, matcher } of HOOK_EVENTS) {
-		const entries = [...(next.hooks![event] ?? [])];
+		const entries = [...(next.hooks![event] && [])];
 		if (registered(entries, command, matcher)) continue;
 		entries.push({
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Killed] ArrayDeclaration
src/hooks-install.ts:60:46
 	const next: Settings = { ...settings, hooks: { ...(settings.hooks ?? {}) } };
 	const added: string[] = [];
 	for (const { event, matcher } of HOOK_EVENTS) {
-		const entries = [...(next.hooks![event] ?? [])];
+		const entries = [...(next.hooks![event] ?? ["Stryker was here"])];
 		if (registered(entries, command, matcher)) continue;
 		entries.push({
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Killed] ConditionalExpression
src/hooks-install.ts:61:7
 	const added: string[] = [];
 	for (const { event, matcher } of HOOK_EVENTS) {
 		const entries = [...(next.hooks![event] ?? [])];
-		if (registered(entries, command, matcher)) continue;
+		if (false) continue;
 		entries.push({
 			...(matcher ? { matcher } : {}),
killedBy: test/hooks-install.test.ts
statusReason: re-running adds nothing — link-global is run often: re-running adds nothing — link-global is run often

[Killed] ConditionalExpression
src/hooks-install.ts:61:7
 	const added: string[] = [];
 	for (const { event, matcher } of HOOK_EVENTS) {
 		const entries = [...(next.hooks![event] ?? [])];
-		if (registered(entries, command, matcher)) continue;
+		if (true) continue;
 		entries.push({
 			...(matcher ? { matcher } : {}),
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Killed] CallExpression
src/hooks-install.ts:67:3
 			hooks: [{ type: "command", command }],
 		});
 		next.hooks![event] = entries;
-		added.push(event);
+		;
 	}
 	return { settings: next, added };
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed

[Killed] ObjectLiteral
src/hooks-install.ts:69:9
 		next.hooks![event] = entries;
 		added.push(event);
 	}
-	return { settings: next, added };
+	return {};
 }
 
killedBy: test/hooks-install.test.ts
statusReason: every event the adapter handles is registered, with PreToolUse narrowed: every event the adapter handles is registered, with PreToolUse narrowed
