[Survived] ArrowFunction
src/mutate-cli.ts:52:9
 }
 
 export const defaultMutateIo: MutateIo = {
-	write: (s) => process.stdout.write(s),
+	write: () => undefined,
 	error: (s) => console.error(s),
 	cwd: () => process.cwd(),

[NoCoverage] BlockStatement
src/mutate-cli.ts:55:29
 	write: (s) => process.stdout.write(s),
 	error: (s) => console.error(s),
 	cwd: () => process.cwd(),
-	exec: (cmd, args, opts) => {
-		const out = spawnSync(cmd, args, { cwd: opts.cwd, encoding: "utf8", timeout: opts.timeoutMs });
-		return {
-			status: out.status,
-			stdout: out.stdout ?? "",
-			stderr: out.stderr ?? "",
-			signal: out.signal,
-			error: out.error as { code?: string } | undefined,
-		};
-	},
+	exec: (cmd, args, opts) => {},
 	readFile: (p) => readFileSync(p, "utf8"),
 };

[NoCoverage] ObjectLiteral
src/mutate-cli.ts:56:36
 	error: (s) => console.error(s),
 	cwd: () => process.cwd(),
 	exec: (cmd, args, opts) => {
-		const out = spawnSync(cmd, args, { cwd: opts.cwd, encoding: "utf8", timeout: opts.timeoutMs });
+		const out = spawnSync(cmd, args, {});
 		return {
 			status: out.status,

[NoCoverage] LogicalOperator
src/mutate-cli.ts:59:12
 		const out = spawnSync(cmd, args, { cwd: opts.cwd, encoding: "utf8", timeout: opts.timeoutMs });
 		return {
 			status: out.status,
-			stdout: out.stdout ?? "",
+			stdout: out.stdout && "",
 			stderr: out.stderr ?? "",
 			signal: out.signal,

[NoCoverage] StringLiteral
src/mutate-cli.ts:59:26
 		const out = spawnSync(cmd, args, { cwd: opts.cwd, encoding: "utf8", timeout: opts.timeoutMs });
 		return {
 			status: out.status,
-			stdout: out.stdout ?? "",
+			stdout: out.stdout ?? "Stryker was here!",
 			stderr: out.stderr ?? "",
 			signal: out.signal,

[NoCoverage] LogicalOperator
src/mutate-cli.ts:60:12
 		return {
 			status: out.status,
 			stdout: out.stdout ?? "",
-			stderr: out.stderr ?? "",
+			stderr: out.stderr && "",
 			signal: out.signal,
 			error: out.error as { code?: string } | undefined,

[Survived] ArrowFunction
src/mutate-cli.ts:65:12
 			error: out.error as { code?: string } | undefined,
 		};
 	},
-	readFile: (p) => readFileSync(p, "utf8"),
+	readFile: () => undefined,
 };
 

[Killed] BlockStatement
src/mutate-cli.ts:68:71
 	readFile: (p) => readFileSync(p, "utf8"),
 };
 
-export function arg(flag: string, argv: string[]): string | undefined {
-	const i = argv.indexOf(flag);
-	return i === -1 ? undefined : argv[i + 1];
-}
+export function arg(flag: string, argv: string[]): string | undefined {}
 
 /**
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0

[Killed] ConditionalExpression
src/mutate-cli.ts:70:9
 
 export function arg(flag: string, argv: string[]): string | undefined {
 	const i = argv.indexOf(flag);
-	return i === -1 ? undefined : argv[i + 1];
+	return true ? undefined : argv[i + 1];
 }
 
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0

[Killed] ConditionalExpression
src/mutate-cli.ts:70:9
 
 export function arg(flag: string, argv: string[]): string | undefined {
 	const i = argv.indexOf(flag);
-	return i === -1 ? undefined : argv[i + 1];
+	return false ? undefined : argv[i + 1];
 }
 
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0

[Killed] BlockStatement
src/mutate-cli.ts:78:95
  * not something to silently replace with the default — `--timeout abc` would
  * otherwise run for the default duration and look like it honoured the flag.
  */
-export function numFlag(flag: string, argv: string[], fallback: number, io: MutateIo): number {
-	const raw = arg(flag, argv);
-	if (raw === undefined) return fallback;
-	const n = Number(raw);
-	if (!Number.isFinite(n) || n <= 0) {
-		io.error(`invalid ${flag} ${raw}`);
-		throw new ExitSignal(2);
-	}
-	return n;
-}
+export function numFlag(flag: string, argv: string[], fallback: number, io: MutateIo): number {}
 
 export function main(argv: string[], io: MutateIo = defaultMutateIo): number {
killedBy: test/mutate-cli.test.ts
statusReason: an unparseable numeric flag is rejected, not silently defaulted: an unparseable numeric flag is rejected, not silently defaulted

[Killed] EqualityOperator
src/mutate-cli.ts:80:6
  */
 export function numFlag(flag: string, argv: string[], fallback: number, io: MutateIo): number {
 	const raw = arg(flag, argv);
-	if (raw === undefined) return fallback;
+	if (raw !== undefined) return fallback;
 	const n = Number(raw);
 	if (!Number.isFinite(n) || n <= 0) {
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0

[Killed] ConditionalExpression
src/mutate-cli.ts:80:6
  */
 export function numFlag(flag: string, argv: string[], fallback: number, io: MutateIo): number {
 	const raw = arg(flag, argv);
-	if (raw === undefined) return fallback;
+	if (false) return fallback;
 	const n = Number(raw);
 	if (!Number.isFinite(n) || n <= 0) {
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0

[Killed] LogicalOperator
src/mutate-cli.ts:82:6
 	const raw = arg(flag, argv);
 	if (raw === undefined) return fallback;
 	const n = Number(raw);
-	if (!Number.isFinite(n) || n <= 0) {
+	if (!Number.isFinite(n) && n <= 0) {
 		io.error(`invalid ${flag} ${raw}`);
 		throw new ExitSignal(2);
killedBy: test/mutate-cli.test.ts
statusReason: an unparseable numeric flag is rejected, not silently defaulted: an unparseable numeric flag is rejected, not silently defaulted

[Killed] EqualityOperator
src/mutate-cli.ts:82:29
 	const raw = arg(flag, argv);
 	if (raw === undefined) return fallback;
 	const n = Number(raw);
-	if (!Number.isFinite(n) || n <= 0) {
+	if (!Number.isFinite(n) || n > 0) {
 		io.error(`invalid ${flag} ${raw}`);
 		throw new ExitSignal(2);
killedBy: test/mutate-cli.test.ts
statusReason: a non-positive numeric flag is rejected: a non-positive numeric flag is rejected

[Killed] CallExpression
src/mutate-cli.ts:84:3
 	const n = Number(raw);
 	if (!Number.isFinite(n) || n <= 0) {
 		io.error(`invalid ${flag} ${raw}`);
-		throw new ExitSignal(2);
+		;
 	}
 	return n;
killedBy: test/mutate-cli.test.ts
statusReason: an unparseable numeric flag is rejected, not silently defaulted: an unparseable numeric flag is rejected, not silently defaulted

[Killed] BlockStatement
src/mutate-cli.ts:90:54
 }
 
 export function main(argv: string[], io: MutateIo = defaultMutateIo): number {
-	if (argv.includes("-h") || argv.includes("--help")) {
-		io.write(USAGE);
-		return 0;
-	}
+	if (argv.includes("-h") || argv.includes("--help")) {}
 	const base = arg("--base", argv);
 	if (!base) {
killedBy: test/mutate-cli.test.ts
statusReason: --help prints usage and succeeds: --help prints usage and succeeds

[Killed] LogicalOperator
src/mutate-cli.ts:90:6
 }
 
 export function main(argv: string[], io: MutateIo = defaultMutateIo): number {
-	if (argv.includes("-h") || argv.includes("--help")) {
+	if (argv.includes("-h") && argv.includes("--help")) {
 		io.write(USAGE);
 		return 0;
killedBy: test/mutate-cli.test.ts
statusReason: --help prints usage and succeeds: --help prints usage and succeeds

[Killed] CallExpression
src/mutate-cli.ts:91:3
 
 export function main(argv: string[], io: MutateIo = defaultMutateIo): number {
 	if (argv.includes("-h") || argv.includes("--help")) {
-		io.write(USAGE);
+		;
 		return 0;
 	}
killedBy: test/mutate-cli.test.ts
statusReason: --help prints usage and succeeds: --help prints usage and succeeds

[Killed] BooleanLiteral
src/mutate-cli.ts:95:6
 		return 0;
 	}
 	const base = arg("--base", argv);
-	if (!base) {
+	if (base) {
 		io.error("missing --base <ref>");
 		return 2;
killedBy: test/mutate-cli.test.ts
statusReason: a missing --base exits 2 rather than diffing against nothing: a missing --base exits 2 rather than diffing against nothing

[Killed] ConditionalExpression
src/mutate-cli.ts:95:6
 		return 0;
 	}
 	const base = arg("--base", argv);
-	if (!base) {
+	if (true) {
 		io.error("missing --base <ref>");
 		return 2;
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0

[Killed] LogicalOperator
src/mutate-cli.ts:99:14
 		io.error("missing --base <ref>");
 		return 2;
 	}
-	const cwd = arg("--cwd", argv) ?? io.cwd();
+	const cwd = arg("--cwd", argv) && io.cwd();
 	const timeoutSec = numFlag("--timeout", argv, DEFAULT_TIMEOUT_SEC, io);
 	const maxLines = numFlag("--max-lines", argv, DEFAULT_MAX_LINES, io);
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0

[Survived] StringLiteral
src/mutate-cli.ts:99:18
 		io.error("missing --base <ref>");
 		return 2;
 	}
-	const cwd = arg("--cwd", argv) ?? io.cwd();
+	const cwd = arg("", argv) ?? io.cwd();
 	const timeoutSec = numFlag("--timeout", argv, DEFAULT_TIMEOUT_SEC, io);
 	const maxLines = numFlag("--max-lines", argv, DEFAULT_MAX_LINES, io);

[Killed] StringLiteral
src/mutate-cli.ts:100:29
 		return 2;
 	}
 	const cwd = arg("--cwd", argv) ?? io.cwd();
-	const timeoutSec = numFlag("--timeout", argv, DEFAULT_TIMEOUT_SEC, io);
+	const timeoutSec = numFlag("", argv, DEFAULT_TIMEOUT_SEC, io);
 	const maxLines = numFlag("--max-lines", argv, DEFAULT_MAX_LINES, io);
 
killedBy: test/mutate-cli.test.ts
statusReason: an unparseable numeric flag is rejected, not silently defaulted: an unparseable numeric flag is rejected, not silently defaulted

[Survived] CallExpression
src/mutate-cli.ts:104:2
 	const maxLines = numFlag("--max-lines", argv, DEFAULT_MAX_LINES, io);
 
 	// A stale report from an earlier run must not be mistaken for this one's.
-	clearReport(cwd);
+	;
 
 	const fail = (message: string): never => {

[Killed] BlockStatement
src/mutate-cli.ts:106:43
 	// A stale report from an earlier run must not be mistaken for this one's.
 	clearReport(cwd);
 
-	const fail = (message: string): never => {
-		io.error(message);
-		throw new ExitSignal(1);
-	};
+	const fail = (message: string): never => {};
 
 	const result = runMutate({
killedBy: test/mutate-cli.test.ts
statusReason: a failing git diff exits 1 rather than reporting no changes: a failing git diff exits 1 rather than reporting no changes

[Killed] CallExpression
src/mutate-cli.ts:107:3
 	clearReport(cwd);
 
 	const fail = (message: string): never => {
-		io.error(message);
+		;
 		throw new ExitSignal(1);
 	};
killedBy: test/mutate-cli.test.ts
statusReason: a failing git diff exits 1 rather than reporting no changes: a failing git diff exits 1 rather than reporting no changes

[Killed] CallExpression
src/mutate-cli.ts:108:3
 
 	const fail = (message: string): never => {
 		io.error(message);
-		throw new ExitSignal(1);
+		;
 	};
 
killedBy: test/mutate-cli.test.ts
statusReason: a failing git diff exits 1 rather than reporting no changes: a failing git diff exits 1 rather than reporting no changes

[Survived] StringLiteral
src/mutate-cli.ts:121:45
 		runStryker: makeRunStryker(io.exec),
 	});
 
-	io.write(JSON.stringify(result, null, 2) + "\n");
+	io.write(JSON.stringify(result, null, 2) + "");
 	return result.status === "error" ? 1 : 0;
 }

[Killed] EqualityOperator
src/mutate-cli.ts:122:9
 	});
 
 	io.write(JSON.stringify(result, null, 2) + "\n");
-	return result.status === "error" ? 1 : 0;
+	return result.status !== "error" ? 1 : 0;
 }
 
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0

[Killed] ConditionalExpression
src/mutate-cli.ts:122:9
 	});
 
 	io.write(JSON.stringify(result, null, 2) + "\n");
-	return result.status === "error" ? 1 : 0;
+	return true ? 1 : 0;
 }
 
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0

[Killed] BlockStatement
src/mutate-cli.ts:125:77
 	return result.status === "error" ? 1 : 0;
 }
 
-export function run(argv: string[], io: MutateIo = defaultMutateIo): number {
-	try {
-		return main(argv, io);
-	} catch (err) {
-		if (err instanceof ExitSignal) return err.code;
-		io.error(err instanceof Error ? err.message : String(err));
-		return 1;
-	}
-}
+export function run(argv: string[], io: MutateIo = defaultMutateIo): number {}
 
 // Self-execute only as a program, never when a test imports this file.
killedBy: test/mutate-cli.test.ts
statusReason: an unparseable numeric flag is rejected, not silently defaulted: an unparseable numeric flag is rejected, not silently defaulted

[Killed] BlockStatement
src/mutate-cli.ts:126:6
 }
 
 export function run(argv: string[], io: MutateIo = defaultMutateIo): number {
-	try {
-		return main(argv, io);
-	} catch (err) {
+	try {} catch (err) {
 		if (err instanceof ExitSignal) return err.code;
 		io.error(err instanceof Error ? err.message : String(err));
killedBy: test/mutate-cli.test.ts
statusReason: an unparseable numeric flag is rejected, not silently defaulted: an unparseable numeric flag is rejected, not silently defaulted

[Killed] BlockStatement
src/mutate-cli.ts:128:16
 export function run(argv: string[], io: MutateIo = defaultMutateIo): number {
 	try {
 		return main(argv, io);
-	} catch (err) {
-		if (err instanceof ExitSignal) return err.code;
-		io.error(err instanceof Error ? err.message : String(err));
-		return 1;
-	}
+	} catch (err) {}
 }
 
killedBy: test/mutate-cli.test.ts
statusReason: an unparseable numeric flag is rejected, not silently defaulted: an unparseable numeric flag is rejected, not silently defaulted

[Survived] ConditionalExpression
src/mutate-cli.ts:141:5
 // Killed. That is the guard working: weakening it makes the module call
 // process.exit during import, which takes the test runner down instead of
 // failing an assertion. A dead test process is detection, just an ugly form.
-if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {
+if (false) {
 	process.exit(run(process.argv.slice(2)));
 }

[NoCoverage] BlockStatement
src/mutate-cli.ts:141:90
 // Killed. That is the guard working: weakening it makes the module call
 // process.exit during import, which takes the test runner down instead of
 // failing an assertion. A dead test process is detection, just an ugly form.
-if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {
-	process.exit(run(process.argv.slice(2)));
-}
+if (process.argv[1] && realpathSync(process.argv[1]) === fileURLToPath(import.meta.url)) {}
 
