[Killed] BlockStatement
src/mutate-shell.ts:28:75
  * an unresolvable base silently scoping nothing would report "no changes" and
  * skip mutation altogether, which looks identical to a clean result.
  */
-export function makeGitDiff(exec: Exec, fail: (message: string) => never) {
-	return (cwd: string, base: string): string => {
-		const out = exec("git", ["diff", "--unified=0", base, "--"], { cwd });
-		if (out.status !== 0) fail(out.stderr?.trim() || `git diff against ${base} failed`);
-		return out.stdout ?? "";
-	};
-}
+export function makeGitDiff(exec: Exec, fail: (message: string) => never) {}
 
 /**
killedBy: test/mutate-cli.test.ts
statusReason: a failing git diff exits 1 rather than reporting no changes: a failing git diff exits 1 rather than reporting no changes

[Killed] BlockStatement
src/mutate-shell.ts:29:48
  * skip mutation altogether, which looks identical to a clean result.
  */
 export function makeGitDiff(exec: Exec, fail: (message: string) => never) {
-	return (cwd: string, base: string): string => {
-		const out = exec("git", ["diff", "--unified=0", base, "--"], { cwd });
-		if (out.status !== 0) fail(out.stderr?.trim() || `git diff against ${base} failed`);
-		return out.stdout ?? "";
-	};
+	return (cwd: string, base: string): string => {};
 }
 
killedBy: test/mutate-cli.test.ts
statusReason: a failing git diff exits 1 rather than reporting no changes: a failing git diff exits 1 rather than reporting no changes

[Survived] StringLiteral
src/mutate-shell.ts:30:57
  */
 export function makeGitDiff(exec: Exec, fail: (message: string) => never) {
 	return (cwd: string, base: string): string => {
-		const out = exec("git", ["diff", "--unified=0", base, "--"], { cwd });
+		const out = exec("git", ["diff", "--unified=0", base, ""], { cwd });
 		if (out.status !== 0) fail(out.stderr?.trim() || `git diff against ${base} failed`);
 		return out.stdout ?? "";

[Survived] ObjectLiteral
src/mutate-shell.ts:30:64
  */
 export function makeGitDiff(exec: Exec, fail: (message: string) => never) {
 	return (cwd: string, base: string): string => {
-		const out = exec("git", ["diff", "--unified=0", base, "--"], { cwd });
+		const out = exec("git", ["diff", "--unified=0", base, "--"], {});
 		if (out.status !== 0) fail(out.stderr?.trim() || `git diff against ${base} failed`);
 		return out.stdout ?? "";

[Killed] MethodExpression
src/mutate-shell.ts:31:30
 export function makeGitDiff(exec: Exec, fail: (message: string) => never) {
 	return (cwd: string, base: string): string => {
 		const out = exec("git", ["diff", "--unified=0", base, "--"], { cwd });
-		if (out.status !== 0) fail(out.stderr?.trim() || `git diff against ${base} failed`);
+		if (out.status !== 0) fail(out.stderr || `git diff against ${base} failed`);
 		return out.stdout ?? "";
 	};
killedBy: test/mutate-cli.test.ts
statusReason: git diff with an empty stderr still reports which ref failed: git diff with an empty stderr still reports which ref failed

[Killed] ConditionalExpression
src/mutate-shell.ts:31:30
 export function makeGitDiff(exec: Exec, fail: (message: string) => never) {
 	return (cwd: string, base: string): string => {
 		const out = exec("git", ["diff", "--unified=0", base, "--"], { cwd });
-		if (out.status !== 0) fail(out.stderr?.trim() || `git diff against ${base} failed`);
+		if (out.status !== 0) fail(false);
 		return out.stdout ?? "";
 	};
killedBy: test/mutate-cli.test.ts
statusReason: a failing git diff exits 1 rather than reporting no changes: a failing git diff exits 1 rather than reporting no changes

[Killed] LogicalOperator
src/mutate-shell.ts:32:10
 	return (cwd: string, base: string): string => {
 		const out = exec("git", ["diff", "--unified=0", base, "--"], { cwd });
 		if (out.status !== 0) fail(out.stderr?.trim() || `git diff against ${base} failed`);
-		return out.stdout ?? "";
+		return out.stdout && "";
 	};
 }
killedBy: test/mutate-cli.test.ts
statusReason: the shell adapters compose into a scoped stryker invocation: the shell adapters compose into a scoped stryker invocation

[NoCoverage] StringLiteral
src/mutate-shell.ts:32:24
 	return (cwd: string, base: string): string => {
 		const out = exec("git", ["diff", "--unified=0", base, "--"], { cwd });
 		if (out.status !== 0) fail(out.stderr?.trim() || `git diff against ${base} failed`);
-		return out.stdout ?? "";
+		return out.stdout ?? "Stryker was here!";
 	};
 }

[Killed] BlockStatement
src/mutate-shell.ts:44:107
  * rejected by Stryker, and an unreadable file yields 0 so it is dropped rather
  * than scoped wrongly.
  */
-export function makeUntracked(exec: Exec, readFile: ReadFile, joinPath: (a: string, b: string) => string) {
-	return (cwd: string): Array<{ file: string; lines: number }> => {
-		const out = exec("git", ["ls-files", "--others", "--exclude-standard"], { cwd });
-		// A repo-less directory is not an error here — it simply has nothing untracked.
-		if (out.status !== 0) return [];
-		return (out.stdout ?? "")
-			.split("\n")
-			.map((f) => f.trim())
-			.filter(Boolean)
-			.map((file) => {
-				try {
-					return { file, lines: readFile(joinPath(cwd, file)).split("\n").length };
-				} catch {
-					return { file, lines: 0 };
-				}
-			});
-	};
-}
+export function makeUntracked(exec: Exec, readFile: ReadFile, joinPath: (a: string, b: string) => string) {}
 
 /**
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] BlockStatement
src/mutate-shell.ts:45:66
  * than scoped wrongly.
  */
 export function makeUntracked(exec: Exec, readFile: ReadFile, joinPath: (a: string, b: string) => string) {
-	return (cwd: string): Array<{ file: string; lines: number }> => {
-		const out = exec("git", ["ls-files", "--others", "--exclude-standard"], { cwd });
-		// A repo-less directory is not an error here — it simply has nothing untracked.
-		if (out.status !== 0) return [];
-		return (out.stdout ?? "")
-			.split("\n")
-			.map((f) => f.trim())
-			.filter(Boolean)
-			.map((file) => {
-				try {
-					return { file, lines: readFile(joinPath(cwd, file)).split("\n").length };
-				} catch {
-					return { file, lines: 0 };
-				}
-			});
-	};
+	return (cwd: string): Array<{ file: string; lines: number }> => {};
 }
 
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Survived] StringLiteral
src/mutate-shell.ts:46:52
  */
 export function makeUntracked(exec: Exec, readFile: ReadFile, joinPath: (a: string, b: string) => string) {
 	return (cwd: string): Array<{ file: string; lines: number }> => {
-		const out = exec("git", ["ls-files", "--others", "--exclude-standard"], { cwd });
+		const out = exec("git", ["ls-files", "--others", ""], { cwd });
 		// A repo-less directory is not an error here — it simply has nothing untracked.
 		if (out.status !== 0) return [];

[Survived] ArrayDeclaration
src/mutate-shell.ts:46:27
  */
 export function makeUntracked(exec: Exec, readFile: ReadFile, joinPath: (a: string, b: string) => string) {
 	return (cwd: string): Array<{ file: string; lines: number }> => {
-		const out = exec("git", ["ls-files", "--others", "--exclude-standard"], { cwd });
+		const out = exec("git", [], { cwd });
 		// A repo-less directory is not an error here — it simply has nothing untracked.
 		if (out.status !== 0) return [];

[Killed] EqualityOperator
src/mutate-shell.ts:48:7
 	return (cwd: string): Array<{ file: string; lines: number }> => {
 		const out = exec("git", ["ls-files", "--others", "--exclude-standard"], { cwd });
 		// A repo-less directory is not an error here — it simply has nothing untracked.
-		if (out.status !== 0) return [];
+		if (out.status === 0) return [];
 		return (out.stdout ?? "")
 			.split("\n")
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] ConditionalExpression
src/mutate-shell.ts:48:7
 	return (cwd: string): Array<{ file: string; lines: number }> => {
 		const out = exec("git", ["ls-files", "--others", "--exclude-standard"], { cwd });
 		// A repo-less directory is not an error here — it simply has nothing untracked.
-		if (out.status !== 0) return [];
+		if (true) return [];
 		return (out.stdout ?? "")
 			.split("\n")
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] MethodExpression
src/mutate-shell.ts:49:10
 		const out = exec("git", ["ls-files", "--others", "--exclude-standard"], { cwd });
 		// A repo-less directory is not an error here — it simply has nothing untracked.
 		if (out.status !== 0) return [];
-		return (out.stdout ?? "")
-			.split("\n")
-			.map((f) => f.trim())
-			.filter(Boolean)
+		return (out.stdout ?? "").split("\n").map(f => f.trim())
 			.map((file) => {
 				try {
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] LogicalOperator
src/mutate-shell.ts:49:11
 		const out = exec("git", ["ls-files", "--others", "--exclude-standard"], { cwd });
 		// A repo-less directory is not an error here — it simply has nothing untracked.
 		if (out.status !== 0) return [];
-		return (out.stdout ?? "")
+		return (out.stdout && "")
 			.split("\n")
 			.map((f) => f.trim())
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] ArrowFunction
src/mutate-shell.ts:51:9
 		if (out.status !== 0) return [];
 		return (out.stdout ?? "")
 			.split("\n")
-			.map((f) => f.trim())
+			.map(() => undefined)
 			.filter(Boolean)
 			.map((file) => {
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] MethodExpression
src/mutate-shell.ts:51:16
 		if (out.status !== 0) return [];
 		return (out.stdout ?? "")
 			.split("\n")
-			.map((f) => f.trim())
+			.map((f) => f)
 			.filter(Boolean)
 			.map((file) => {
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] BlockStatement
src/mutate-shell.ts:53:19
 			.split("\n")
 			.map((f) => f.trim())
 			.filter(Boolean)
-			.map((file) => {
-				try {
-					return { file, lines: readFile(joinPath(cwd, file)).split("\n").length };
-				} catch {
-					return { file, lines: 0 };
-				}
-			});
+			.map((file) => {});
 	};
 }
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] BlockStatement
src/mutate-shell.ts:54:9
 			.map((f) => f.trim())
 			.filter(Boolean)
 			.map((file) => {
-				try {
-					return { file, lines: readFile(joinPath(cwd, file)).split("\n").length };
-				} catch {
+				try {} catch {
 					return { file, lines: 0 };
 				}
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] BlockStatement
src/mutate-shell.ts:56:13
 			.map((file) => {
 				try {
 					return { file, lines: readFile(joinPath(cwd, file)).split("\n").length };
-				} catch {
-					return { file, lines: 0 };
-				}
+				} catch {}
 			});
 	};
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] ObjectLiteral
src/mutate-shell.ts:57:13
 				try {
 					return { file, lines: readFile(joinPath(cwd, file)).split("\n").length };
 				} catch {
-					return { file, lines: 0 };
+					return {};
 				}
 			});
killedBy: test/mutate-cli.test.ts
statusReason: untracked counts lines per file and drops unreadable ones: untracked counts lines per file and drops unreadable ones

[Killed] BlockStatement
src/mutate-shell.ts:70:44
  * through `error.code` or a signal rather than a nonzero exit status, and
  * treating that as an ordinary failure would surface a timeout as a broken run.
  */
-export function makeRunStryker(exec: Exec) {
-	return (cwd: string, mutateArgs: string[], timeoutSec: number) => {
-		const out = exec("npx", ["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"], {
-			cwd,
-			timeoutMs: timeoutSec * 1000,
-		});
-		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal === "SIGTERM" || out.signal === "SIGKILL";
-		return {
-			ok: out.status === 0,
-			timedOut,
-			// Only the tail is useful; Stryker's stderr is long and the last lines
-			// carry the actual failure.
-			detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),
-		};
-	};
-}
+export function makeRunStryker(exec: Exec) {}
 
killedBy: test/mutate-cli.test.ts
statusReason: the shell adapters compose into a scoped stryker invocation: the shell adapters compose into a scoped stryker invocation

[Killed] BlockStatement
src/mutate-shell.ts:71:68
  * treating that as an ordinary failure would surface a timeout as a broken run.
  */
 export function makeRunStryker(exec: Exec) {
-	return (cwd: string, mutateArgs: string[], timeoutSec: number) => {
-		const out = exec("npx", ["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"], {
-			cwd,
-			timeoutMs: timeoutSec * 1000,
-		});
-		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal === "SIGTERM" || out.signal === "SIGKILL";
-		return {
-			ok: out.status === 0,
-			timedOut,
-			// Only the tail is useful; Stryker's stderr is long and the last lines
-			// carry the actual failure.
-			detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),
-		};
-	};
+	return (cwd: string, mutateArgs: string[], timeoutSec: number) => {};
 }
 
killedBy: test/mutate-cli.test.ts
statusReason: the shell adapters compose into a scoped stryker invocation: the shell adapters compose into a scoped stryker invocation

[Killed] StringLiteral
src/mutate-shell.ts:72:80
  */
 export function makeRunStryker(exec: Exec) {
 	return (cwd: string, mutateArgs: string[], timeoutSec: number) => {
-		const out = exec("npx", ["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"], {
+		const out = exec("npx", ["stryker", "run", "--mutate", mutateArgs.join(","), "", "json"], {
 			cwd,
 			timeoutMs: timeoutSec * 1000,
killedBy: test/mutate-cli.test.ts
statusReason: the shell adapters compose into a scoped stryker invocation: the shell adapters compose into a scoped stryker invocation

[Killed] ObjectLiteral
src/mutate-shell.ts:72:104
  */
 export function makeRunStryker(exec: Exec) {
 	return (cwd: string, mutateArgs: string[], timeoutSec: number) => {
-		const out = exec("npx", ["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"], {
-			cwd,
-			timeoutMs: timeoutSec * 1000,
-		});
+		const out = exec("npx", ["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"], {});
 		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal === "SIGTERM" || out.signal === "SIGKILL";
 		return {
killedBy: test/mutate-cli.test.ts
statusReason: the timeout is passed through to exec in milliseconds: the timeout is passed through to exec in milliseconds

[Killed] ArithmeticOperator
src/mutate-shell.ts:74:15
 	return (cwd: string, mutateArgs: string[], timeoutSec: number) => {
 		const out = exec("npx", ["stryker", "run", "--mutate", mutateArgs.join(","), "--reporters", "json"], {
 			cwd,
-			timeoutMs: timeoutSec * 1000,
+			timeoutMs: timeoutSec / 1000,
 		});
 		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal === "SIGTERM" || out.signal === "SIGKILL";
killedBy: test/mutate-cli.test.ts
statusReason: the timeout is passed through to exec in milliseconds: the timeout is passed through to exec in milliseconds

[Killed] EqualityOperator
src/mutate-shell.ts:76:83
 			cwd,
 			timeoutMs: timeoutSec * 1000,
 		});
-		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal === "SIGTERM" || out.signal === "SIGKILL";
+		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal === "SIGTERM" || out.signal !== "SIGKILL";
 		return {
 			ok: out.status === 0,
killedBy: test/mutate-cli.test.ts
statusReason: a timeout is detected from ETIMEDOUT or a kill signal, not from exit status: a timeout is detected from ETIMEDOUT or a kill signal, not from exit status

[Killed] EqualityOperator
src/mutate-shell.ts:76:55
 			cwd,
 			timeoutMs: timeoutSec * 1000,
 		});
-		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal === "SIGTERM" || out.signal === "SIGKILL";
+		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal !== "SIGTERM" || out.signal === "SIGKILL";
 		return {
 			ok: out.status === 0,
killedBy: test/mutate-cli.test.ts
statusReason: a timeout is detected from ETIMEDOUT or a kill signal, not from exit status: a timeout is detected from ETIMEDOUT or a kill signal, not from exit status

[Killed] ConditionalExpression
src/mutate-shell.ts:78:8
 		});
 		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal === "SIGTERM" || out.signal === "SIGKILL";
 		return {
-			ok: out.status === 0,
+			ok: false,
 			timedOut,
 			// Only the tail is useful; Stryker's stderr is long and the last lines
killedBy: test/mutate-cli.test.ts
statusReason: a clean stryker run is neither failed nor timed out: a clean stryker run is neither failed nor timed out

[Killed] ConditionalExpression
src/mutate-shell.ts:78:8
 		});
 		const timedOut = out.error?.code === "ETIMEDOUT" || out.signal === "SIGTERM" || out.signal === "SIGKILL";
 		return {
-			ok: out.status === 0,
+			ok: true,
 			timedOut,
 			// Only the tail is useful; Stryker's stderr is long and the last lines
killedBy: test/mutate-cli.test.ts
statusReason: a timeout is detected from ETIMEDOUT or a kill signal, not from exit status: a timeout is detected from ETIMEDOUT or a kill signal, not from exit status

[Killed] MethodExpression
src/mutate-shell.ts:82:12
 			timedOut,
 			// Only the tail is useful; Stryker's stderr is long and the last lines
 			// carry the actual failure.
-			detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),
+			detail: out.stderr?.trim().split("\n").join("\n"),
 		};
 	};
killedBy: test/mutate-cli.test.ts
statusReason: stryker failure keeps only the tail of its stderr: stryker failure keeps only the tail of its stderr

[Killed] UnaryOperator
src/mutate-shell.ts:82:49
 			timedOut,
 			// Only the tail is useful; Stryker's stderr is long and the last lines
 			// carry the actual failure.
-			detail: out.stderr?.trim().split("\n").slice(-3).join("\n"),
+			detail: out.stderr?.trim().split("\n").slice(+3).join("\n"),
 		};
 	};
killedBy: test/mutate-cli.test.ts
statusReason: stryker failure keeps only the tail of its stderr: stryker failure keeps only the tail of its stderr
