[Killed] StringLiteral
src/mutate.ts:75:49
 }
 
 export const DEFAULT_TIMEOUT_SEC = 60;
-const REPORT_PATH = join("reports", "mutation", "mutation.json");
+const REPORT_PATH = join("reports", "mutation", "");
 
 /** Source globs to mutate, and the test patterns to keep out of the mutation set. */
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Survived] Regex
src/mutate.ts:79:33
 
 /** Source globs to mutate, and the test patterns to keep out of the mutation set. */
 export const DEFAULT_INCLUDE = [/^src\/.*\.(ts|tsx|js|jsx|mjs|cjs)$/];
-export const DEFAULT_EXCLUDE = [/\.(test|spec)\.(ts|tsx|js|jsx|mjs|cjs)$/, /^test\//, /^tests\//, /^__tests__\//];
+export const DEFAULT_EXCLUDE = [/\.(test|spec)\.(ts|tsx|js|jsx|mjs|cjs)/, /^test\//, /^tests\//, /^__tests__\//];
 
 /**

[Killed] BlockStatement
src/mutate.ts:85:67
  * Map Stryker test ids back to the files that own them. Survivors are far more
  * actionable when the reviewer can see which suite ran and still passed.
  */
-function testFileById(report: StrykerReport): Map<string, string> {
-	const map = new Map<string, string>();
-	for (const [file, entry] of Object.entries(report.testFiles ?? {})) {
-		for (const t of entry.tests ?? []) map.set(t.id, file);
-	}
-	return map;
-}
+function testFileById(report: StrykerReport): Map<string, string> {}
 
 export function parseStrykerReport(
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] LogicalOperator
src/mutate.ts:87:45
  */
 function testFileById(report: StrykerReport): Map<string, string> {
 	const map = new Map<string, string>();
-	for (const [file, entry] of Object.entries(report.testFiles ?? {})) {
+	for (const [file, entry] of Object.entries(report.testFiles && {})) {
 		for (const t of entry.tests ?? []) map.set(t.id, file);
 	}
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] BlockStatement
src/mutate.ts:87:70
  */
 function testFileById(report: StrykerReport): Map<string, string> {
 	const map = new Map<string, string>();
-	for (const [file, entry] of Object.entries(report.testFiles ?? {})) {
-		for (const t of entry.tests ?? []) map.set(t.id, file);
-	}
+	for (const [file, entry] of Object.entries(report.testFiles ?? {})) {}
 	return map;
 }
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] LogicalOperator
src/mutate.ts:88:19
 function testFileById(report: StrykerReport): Map<string, string> {
 	const map = new Map<string, string>();
 	for (const [file, entry] of Object.entries(report.testFiles ?? {})) {
-		for (const t of entry.tests ?? []) map.set(t.id, file);
+		for (const t of entry.tests && []) map.set(t.id, file);
 	}
 	return map;
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] CallExpression
src/mutate.ts:88:38
 function testFileById(report: StrykerReport): Map<string, string> {
 	const map = new Map<string, string>();
 	for (const [file, entry] of Object.entries(report.testFiles ?? {})) {
-		for (const t of entry.tests ?? []) map.set(t.id, file);
+		for (const t of entry.tests ?? []) ;
 	}
 	return map;
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] BlockStatement
src/mutate.ts:109:66
 	let survived = 0;
 	let noCoverage = 0;
 	const survivors: Survivor[] = [];
-	for (const [file, entry] of Object.entries(report.files ?? {})) {
-		for (const m of entry.mutants ?? []) {
-			// Timeouts count as killed: the mutant changed behaviour enough to hang the
-			// suite, which is detection, just an ugly form of it.
-			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
-			else if (m.status === "NoCoverage") noCoverage += 1;
-			else if (m.status === "Survived") {
-				survived += 1;
-				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !!f))];
-				survivors.push({
-					file,
-					line: m.location.start.line,
-					mutator: m.mutatorName,
-					replacement: m.replacement,
-					covered_by: files,
-				});
-			}
-			// Ignored / CompileError / RuntimeError are counted in neither: they say
-			// nothing about test quality, only about the mutant being unrunnable.
-		}
-	}
+	for (const [file, entry] of Object.entries(report.files ?? {})) {}
 	// Sorted before capping so the kept twenty are stable and grouped by file,
 	// rather than whichever order the report happened to serialise.
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] LogicalOperator
src/mutate.ts:109:45
 	let survived = 0;
 	let noCoverage = 0;
 	const survivors: Survivor[] = [];
-	for (const [file, entry] of Object.entries(report.files ?? {})) {
+	for (const [file, entry] of Object.entries(report.files && {})) {
 		for (const m of entry.mutants ?? []) {
 			// Timeouts count as killed: the mutant changed behaviour enough to hang the
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] LogicalOperator
src/mutate.ts:110:19
 	let noCoverage = 0;
 	const survivors: Survivor[] = [];
 	for (const [file, entry] of Object.entries(report.files ?? {})) {
-		for (const m of entry.mutants ?? []) {
+		for (const m of entry.mutants && []) {
 			// Timeouts count as killed: the mutant changed behaviour enough to hang the
 			// suite, which is detection, just an ugly form of it.
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] BlockStatement
src/mutate.ts:110:40
 	let noCoverage = 0;
 	const survivors: Survivor[] = [];
 	for (const [file, entry] of Object.entries(report.files ?? {})) {
-		for (const m of entry.mutants ?? []) {
-			// Timeouts count as killed: the mutant changed behaviour enough to hang the
-			// suite, which is detection, just an ugly form of it.
-			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
-			else if (m.status === "NoCoverage") noCoverage += 1;
-			else if (m.status === "Survived") {
-				survived += 1;
-				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !!f))];
-				survivors.push({
-					file,
-					line: m.location.start.line,
-					mutator: m.mutatorName,
-					replacement: m.replacement,
-					covered_by: files,
-				});
-			}
-			// Ignored / CompileError / RuntimeError are counted in neither: they say
-			// nothing about test quality, only about the mutant being unrunnable.
-		}
+		for (const m of entry.mutants ?? []) {}
 	}
 	// Sorted before capping so the kept twenty are stable and grouped by file,
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ConditionalExpression
src/mutate.ts:113:8
 		for (const m of entry.mutants ?? []) {
 			// Timeouts count as killed: the mutant changed behaviour enough to hang the
 			// suite, which is detection, just an ugly form of it.
-			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
+			if (true) killed += 1;
 			else if (m.status === "NoCoverage") noCoverage += 1;
 			else if (m.status === "Survived") {
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ConditionalExpression
src/mutate.ts:113:33
 		for (const m of entry.mutants ?? []) {
 			// Timeouts count as killed: the mutant changed behaviour enough to hang the
 			// suite, which is detection, just an ugly form of it.
-			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
+			if (m.status === "Killed" || false) killed += 1;
 			else if (m.status === "NoCoverage") noCoverage += 1;
 			else if (m.status === "Survived") {
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ConditionalExpression
src/mutate.ts:114:13
 			// Timeouts count as killed: the mutant changed behaviour enough to hang the
 			// suite, which is detection, just an ugly form of it.
 			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
-			else if (m.status === "NoCoverage") noCoverage += 1;
+			else if (false) noCoverage += 1;
 			else if (m.status === "Survived") {
 				survived += 1;
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] AssignmentOperator
src/mutate.ts:114:40
 			// Timeouts count as killed: the mutant changed behaviour enough to hang the
 			// suite, which is detection, just an ugly form of it.
 			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
-			else if (m.status === "NoCoverage") noCoverage += 1;
+			else if (m.status === "NoCoverage") noCoverage -= 1;
 			else if (m.status === "Survived") {
 				survived += 1;
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] BlockStatement
src/mutate.ts:115:38
 			// suite, which is detection, just an ugly form of it.
 			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
 			else if (m.status === "NoCoverage") noCoverage += 1;
-			else if (m.status === "Survived") {
-				survived += 1;
-				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !!f))];
-				survivors.push({
-					file,
-					line: m.location.start.line,
-					mutator: m.mutatorName,
-					replacement: m.replacement,
-					covered_by: files,
-				});
-			}
+			else if (m.status === "Survived") {}
 			// Ignored / CompileError / RuntimeError are counted in neither: they say
 			// nothing about test quality, only about the mutant being unrunnable.
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ConditionalExpression
src/mutate.ts:115:13
 			// suite, which is detection, just an ugly form of it.
 			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
 			else if (m.status === "NoCoverage") noCoverage += 1;
-			else if (m.status === "Survived") {
+			else if (false) {
 				survived += 1;
 				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !!f))];
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] AssignmentOperator
src/mutate.ts:116:5
 			if (m.status === "Killed" || m.status === "Timeout") killed += 1;
 			else if (m.status === "NoCoverage") noCoverage += 1;
 			else if (m.status === "Survived") {
-				survived += 1;
+				survived -= 1;
 				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !!f))];
 				survivors.push({
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] BooleanLiteral
src/mutate.ts:117:105
 			else if (m.status === "NoCoverage") noCoverage += 1;
 			else if (m.status === "Survived") {
 				survived += 1;
-				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !!f))];
+				const files = [...new Set((m.coveredBy ?? []).map((id) => byId.get(id)).filter((f): f is string => !f))];
 				survivors.push({
 					file,
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] LogicalOperator
src/mutate.ts:132:27
 	}
 	// Sorted before capping so the kept twenty are stable and grouped by file,
 	// rather than whichever order the report happened to serialise.
-	survivors.sort((a, b) => a.file.localeCompare(b.file) || a.line - b.line);
+	survivors.sort((a, b) => a.file.localeCompare(b.file) && a.line - b.line);
 	return {
 		tested: killed + survived + noCoverage,
killedBy: test/mutate.test.ts
statusReason: survivors are sorted by file and line before capping, so the kept set is stable: survivors are sorted by file and line before capping, so the kept set is stable

[Killed] ArithmeticOperator
src/mutate.ts:132:59
 	}
 	// Sorted before capping so the kept twenty are stable and grouped by file,
 	// rather than whichever order the report happened to serialise.
-	survivors.sort((a, b) => a.file.localeCompare(b.file) || a.line - b.line);
+	survivors.sort((a, b) => a.file.localeCompare(b.file) || a.line + b.line);
 	return {
 		tested: killed + survived + noCoverage,
killedBy: test/mutate.test.ts
statusReason: survivors are sorted by file and line before capping, so the kept set is stable: survivors are sorted by file and line before capping, so the kept set is stable

[Killed] ArithmeticOperator
src/mutate.ts:134:11
 	// rather than whichever order the report happened to serialise.
 	survivors.sort((a, b) => a.file.localeCompare(b.file) || a.line - b.line);
 	return {
-		tested: killed + survived + noCoverage,
+		tested: killed - survived + noCoverage,
 		killed,
 		survived,
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] ArithmeticOperator
src/mutate.ts:134:11
 	// rather than whichever order the report happened to serialise.
 	survivors.sort((a, b) => a.file.localeCompare(b.file) || a.line - b.line);
 	return {
-		tested: killed + survived + noCoverage,
+		tested: killed + survived - noCoverage,
 		killed,
 		survived,
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] MethodExpression
src/mutate.ts:138:14
 		killed,
 		survived,
 		no_coverage: noCoverage,
-		survivors: survivors.slice(0, limit),
+		survivors: survivors,
 		survivors_omitted: Math.max(0, survivors.length - limit),
 	};
killedBy: test/mutate.test.ts
statusReason: survivors are capped, and the remainder is counted rather than dropped silently: survivors are capped, and the remainder is counted rather than dropped silently

[Killed] ArithmeticOperator
src/mutate.ts:139:34
 		survived,
 		no_coverage: noCoverage,
 		survivors: survivors.slice(0, limit),
-		survivors_omitted: Math.max(0, survivors.length - limit),
+		survivors_omitted: Math.max(0, survivors.length + limit),
 	};
 }
killedBy: test/mutate.test.ts
statusReason: survivors are capped, and the remainder is counted rather than dropped silently: survivors are capped, and the remainder is counted rather than dropped silently

[Killed] MethodExpression
src/mutate.ts:139:22
 		survived,
 		no_coverage: noCoverage,
 		survivors: survivors.slice(0, limit),
-		survivors_omitted: Math.max(0, survivors.length - limit),
+		survivors_omitted: Math.min(0, survivors.length - limit),
 	};
 }
killedBy: test/mutate.test.ts
statusReason: survivors are capped, and the remainder is counted rather than dropped silently: survivors are capped, and the remainder is counted rather than dropped silently

[Killed] BlockStatement
src/mutate.ts:167:114
  */
 export const DEFAULT_MAX_LINES = 2000;
 
-export function computeRanges(diff: string, untracked: Array<{ file: string; lines: number }> = []): LineRange[] {
-	const fromDiff = parseDiffRanges(diff);
-	// An untracked file is entirely new, so every line of it is in scope.
-	const fromNew = untracked.filter((u) => u.lines > 0).map((u) => ({ file: u.file, start: 1, end: u.lines }));
-	return mergeRanges(filterSourceRanges([...fromDiff, ...fromNew], { include: DEFAULT_INCLUDE, exclude: DEFAULT_EXCLUDE }));
-}
+export function computeRanges(diff: string, untracked: Array<{ file: string; lines: number }> = []): LineRange[] {}
 
 export function runMutate(opts: RunOptions): MutateResult {
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Survived] ArrayDeclaration
src/mutate.ts:167:97
  */
 export const DEFAULT_MAX_LINES = 2000;
 
-export function computeRanges(diff: string, untracked: Array<{ file: string; lines: number }> = []): LineRange[] {
+export function computeRanges(diff: string, untracked: Array<{ file: string; lines: number }> = ["Stryker was here"]): LineRange[] {
 	const fromDiff = parseDiffRanges(diff);
 	// An untracked file is entirely new, so every line of it is in scope.

[Killed] EqualityOperator
src/mutate.ts:170:42
 export function computeRanges(diff: string, untracked: Array<{ file: string; lines: number }> = []): LineRange[] {
 	const fromDiff = parseDiffRanges(diff);
 	// An untracked file is entirely new, so every line of it is in scope.
-	const fromNew = untracked.filter((u) => u.lines > 0).map((u) => ({ file: u.file, start: 1, end: u.lines }));
+	const fromNew = untracked.filter((u) => u.lines <= 0).map((u) => ({ file: u.file, start: 1, end: u.lines }));
 	return mergeRanges(filterSourceRanges([...fromDiff, ...fromNew], { include: DEFAULT_INCLUDE, exclude: DEFAULT_EXCLUDE }));
 }
killedBy: test/mutate.test.ts
statusReason: an untracked source file is scoped in full — git diff cannot see it: an untracked source file is scoped in full — git diff cannot see it

[Killed] EqualityOperator
src/mutate.ts:170:42
 export function computeRanges(diff: string, untracked: Array<{ file: string; lines: number }> = []): LineRange[] {
 	const fromDiff = parseDiffRanges(diff);
 	// An untracked file is entirely new, so every line of it is in scope.
-	const fromNew = untracked.filter((u) => u.lines > 0).map((u) => ({ file: u.file, start: 1, end: u.lines }));
+	const fromNew = untracked.filter((u) => u.lines >= 0).map((u) => ({ file: u.file, start: 1, end: u.lines }));
 	return mergeRanges(filterSourceRanges([...fromDiff, ...fromNew], { include: DEFAULT_INCLUDE, exclude: DEFAULT_EXCLUDE }));
 }
killedBy: test/mutate.test.ts
statusReason: an empty untracked file scopes nothing rather than an invalid range: an empty untracked file scopes nothing rather than an invalid range

[Killed] ArrayDeclaration
src/mutate.ts:171:40
 	const fromDiff = parseDiffRanges(diff);
 	// An untracked file is entirely new, so every line of it is in scope.
 	const fromNew = untracked.filter((u) => u.lines > 0).map((u) => ({ file: u.file, start: 1, end: u.lines }));
-	return mergeRanges(filterSourceRanges([...fromDiff, ...fromNew], { include: DEFAULT_INCLUDE, exclude: DEFAULT_EXCLUDE }));
+	return mergeRanges(filterSourceRanges([], { include: DEFAULT_INCLUDE, exclude: DEFAULT_EXCLUDE }));
 }
 
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Survived] LogicalOperator
src/mutate.ts:176:21
 
 export function runMutate(opts: RunOptions): MutateResult {
 	const { cwd, base } = opts;
-	const timeoutSec = opts.timeoutSec ?? DEFAULT_TIMEOUT_SEC;
+	const timeoutSec = opts.timeoutSec && DEFAULT_TIMEOUT_SEC;
 	const maxLines = opts.maxLines ?? DEFAULT_MAX_LINES;
 

[Killed] LogicalOperator
src/mutate.ts:177:19
 export function runMutate(opts: RunOptions): MutateResult {
 	const { cwd, base } = opts;
 	const timeoutSec = opts.timeoutSec ?? DEFAULT_TIMEOUT_SEC;
-	const maxLines = opts.maxLines ?? DEFAULT_MAX_LINES;
+	const maxLines = opts.maxLines && DEFAULT_MAX_LINES;
 
 	// No Stryker config means this repo has not opted in. Silence, not failure:
killedBy: test/mutate.test.ts
statusReason: a diff exactly at the line cap runs; one line over is skipped: a diff exactly at the line cap runs; one line over is skipped

[Killed] BooleanLiteral
src/mutate.ts:181:55
 
 	// No Stryker config means this repo has not opted in. Silence, not failure:
 	// most repos have not, and Render must not break because of it.
-	if (!existsSync(join(cwd, "stryker.config.json")) && !existsSync(join(cwd, "stryker.conf.json"))) {
+	if (!existsSync(join(cwd, "stryker.config.json")) && existsSync(join(cwd, "stryker.conf.json"))) {
 		return { status: "skipped", reason: "no-backend" };
 	}
killedBy: test/mutate.test.ts
statusReason: skips silently when the repo has no stryker config: skips silently when the repo has no stryker config

[Killed] BlockStatement
src/mutate.ts:181:100
 
 	// No Stryker config means this repo has not opted in. Silence, not failure:
 	// most repos have not, and Render must not break because of it.
-	if (!existsSync(join(cwd, "stryker.config.json")) && !existsSync(join(cwd, "stryker.conf.json"))) {
-		return { status: "skipped", reason: "no-backend" };
-	}
+	if (!existsSync(join(cwd, "stryker.config.json")) && !existsSync(join(cwd, "stryker.conf.json"))) {}
 
 	const diff = opts.gitDiff!(cwd, base);
killedBy: test/mutate.test.ts
statusReason: skips silently when the repo has no stryker config: skips silently when the repo has no stryker config

[Killed] ObjectLiteral
src/mutate.ts:182:10
 	// No Stryker config means this repo has not opted in. Silence, not failure:
 	// most repos have not, and Render must not break because of it.
 	if (!existsSync(join(cwd, "stryker.config.json")) && !existsSync(join(cwd, "stryker.conf.json"))) {
-		return { status: "skipped", reason: "no-backend" };
+		return {};
 	}
 
killedBy: test/mutate.test.ts
statusReason: skips silently when the repo has no stryker config: skips silently when the repo has no stryker config

[Killed] OptionalChaining
src/mutate.ts:186:37
 	}
 
 	const diff = opts.gitDiff!(cwd, base);
-	const ranges = computeRanges(diff, opts.untracked?.(cwd) ?? []);
+	const ranges = computeRanges(diff, opts.untracked(cwd) ?? []);
 	if (ranges.length === 0) return { status: "skipped", reason: "no-changes" };
 
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] LogicalOperator
src/mutate.ts:186:37
 	}
 
 	const diff = opts.gitDiff!(cwd, base);
-	const ranges = computeRanges(diff, opts.untracked?.(cwd) ?? []);
+	const ranges = computeRanges(diff, opts.untracked?.(cwd) && []);
 	if (ranges.length === 0) return { status: "skipped", reason: "no-changes" };
 
killedBy: test/mutate.test.ts
statusReason: an untracked source file is scoped in full — git diff cannot see it: an untracked source file is scoped in full — git diff cannot see it

[Killed] EqualityOperator
src/mutate.ts:187:6
 
 	const diff = opts.gitDiff!(cwd, base);
 	const ranges = computeRanges(diff, opts.untracked?.(cwd) ?? []);
-	if (ranges.length === 0) return { status: "skipped", reason: "no-changes" };
+	if (ranges.length !== 0) return { status: "skipped", reason: "no-changes" };
 
 	const lines = countLines(ranges);
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] ConditionalExpression
src/mutate.ts:187:6
 
 	const diff = opts.gitDiff!(cwd, base);
 	const ranges = computeRanges(diff, opts.untracked?.(cwd) ?? []);
-	if (ranges.length === 0) return { status: "skipped", reason: "no-changes" };
+	if (false) return { status: "skipped", reason: "no-changes" };
 
 	const lines = countLines(ranges);
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] ConditionalExpression
src/mutate.ts:190:6
 	if (ranges.length === 0) return { status: "skipped", reason: "no-changes" };
 
 	const lines = countLines(ranges);
-	if (lines > maxLines) {
+	if (false) {
 		return { status: "skipped", reason: "oversize", lines_scoped: lines };
 	}
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] EqualityOperator
src/mutate.ts:190:6
 	if (ranges.length === 0) return { status: "skipped", reason: "no-changes" };
 
 	const lines = countLines(ranges);
-	if (lines > maxLines) {
+	if (lines <= maxLines) {
 		return { status: "skipped", reason: "oversize", lines_scoped: lines };
 	}
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] StringLiteral
src/mutate.ts:191:39
 
 	const lines = countLines(ranges);
 	if (lines > maxLines) {
-		return { status: "skipped", reason: "oversize", lines_scoped: lines };
+		return { status: "skipped", reason: "", lines_scoped: lines };
 	}
 
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ObjectLiteral
src/mutate.ts:191:10
 
 	const lines = countLines(ranges);
 	if (lines > maxLines) {
-		return { status: "skipped", reason: "oversize", lines_scoped: lines };
+		return {};
 	}
 
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ArithmeticOperator
src/mutate.ts:196:19
 
 	const started = Date.now();
 	const outcome = opts.runStryker!(cwd, toStrykerMutateArgs(ranges), timeoutSec);
-	const duration = Date.now() - started;
+	const duration = Date.now() + started;
 
 	if (outcome.timedOut) {
killedBy: test/mutate.test.ts
statusReason: duration is measured forward, not backward: duration is measured forward, not backward

[Killed] ConditionalExpression
src/mutate.ts:198:6
 	const outcome = opts.runStryker!(cwd, toStrykerMutateArgs(ranges), timeoutSec);
 	const duration = Date.now() - started;
 
-	if (outcome.timedOut) {
+	if (true) {
 		return { status: "skipped", reason: "timeout", lines_scoped: lines, duration_ms: duration };
 	}
killedBy: test/mutate.test.ts
statusReason: errors when the backend ran but produced no report: errors when the backend ran but produced no report

[Killed] BlockStatement
src/mutate.ts:198:24
 	const outcome = opts.runStryker!(cwd, toStrykerMutateArgs(ranges), timeoutSec);
 	const duration = Date.now() - started;
 
-	if (outcome.timedOut) {
-		return { status: "skipped", reason: "timeout", lines_scoped: lines, duration_ms: duration };
-	}
+	if (outcome.timedOut) {}
 
 	const reportPath = join(cwd, REPORT_PATH);
killedBy: test/mutate.test.ts
statusReason: reports a timeout as skipped rather than an error: reports a timeout as skipped rather than an error

[Killed] StringLiteral
src/mutate.ts:199:39
 	const duration = Date.now() - started;
 
 	if (outcome.timedOut) {
-		return { status: "skipped", reason: "timeout", lines_scoped: lines, duration_ms: duration };
+		return { status: "skipped", reason: "", lines_scoped: lines, duration_ms: duration };
 	}
 
killedBy: test/mutate.test.ts
statusReason: reports a timeout as skipped rather than an error: reports a timeout as skipped rather than an error

[Killed] ConditionalExpression
src/mutate.ts:203:6
 	}
 
 	const reportPath = join(cwd, REPORT_PATH);
-	if (!existsSync(reportPath)) {
+	if (true) {
 		return { status: "error", reason: "failed", detail: outcome.detail ?? "no mutation report produced", duration_ms: duration };
 	}
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Killed] BooleanLiteral
src/mutate.ts:203:6
 	}
 
 	const reportPath = join(cwd, REPORT_PATH);
-	if (!existsSync(reportPath)) {
+	if (existsSync(reportPath)) {
 		return { status: "error", reason: "failed", detail: outcome.detail ?? "no mutation report produced", duration_ms: duration };
 	}
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Survived] LogicalOperator
src/mutate.ts:204:55
 
 	const reportPath = join(cwd, REPORT_PATH);
 	if (!existsSync(reportPath)) {
-		return { status: "error", reason: "failed", detail: outcome.detail ?? "no mutation report produced", duration_ms: duration };
+		return { status: "error", reason: "failed", detail: outcome.detail && "no mutation report produced", duration_ms: duration };
 	}
 	let report: StrykerReport;

[Killed] BlockStatement
src/mutate.ts:207:6
 		return { status: "error", reason: "failed", detail: outcome.detail ?? "no mutation report produced", duration_ms: duration };
 	}
 	let report: StrykerReport;
-	try {
-		report = JSON.parse(readFileSync(reportPath, "utf8")) as StrykerReport;
-	} catch (err) {
+	try {} catch (err) {
 		return { status: "error", reason: "failed", detail: `unreadable report: ${String(err)}`, duration_ms: duration };
 	}
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[NoCoverage] BlockStatement
src/mutate.ts:209:16
 	let report: StrykerReport;
 	try {
 		report = JSON.parse(readFileSync(reportPath, "utf8")) as StrykerReport;
-	} catch (err) {
-		return { status: "error", reason: "failed", detail: `unreadable report: ${String(err)}`, duration_ms: duration };
-	}
+	} catch (err) {}
 	const parsed = parseStrykerReport(report);
 	return { status: "ran", backend: "stryker", lines_scoped: lines, duration_ms: duration, ...parsed };
