[Killed] StringLiteral
src/mutate.ts:213:19
 		return { status: "error", reason: "failed", detail: `unreadable report: ${String(err)}`, duration_ms: duration };
 	}
 	const parsed = parseStrykerReport(report);
-	return { status: "ran", backend: "stryker", lines_scoped: lines, duration_ms: duration, ...parsed };
+	return { status: "", backend: "stryker", lines_scoped: lines, duration_ms: duration, ...parsed };
 }
 
killedBy: test/mutate.test.ts
statusReason: parses a real report shape into counts and survivors: parses a real report shape into counts and survivors

[Survived] BlockStatement
src/mutate.ts:217:48
 }
 
 /** Remove a stale report so a failed run cannot be read as the current one. */
-export function clearReport(cwd: string): void {
-	rmSync(join(cwd, REPORT_PATH), { force: true });
-}
+export function clearReport(cwd: string): void {}
 

[Killed] BooleanLiteral
src/mutate.ts:218:42
 
 /** Remove a stale report so a failed run cannot be read as the current one. */
 export function clearReport(cwd: string): void {
-	rmSync(join(cwd, REPORT_PATH), { force: true });
+	rmSync(join(cwd, REPORT_PATH), { force: false });
 }
 
killedBy: test/mutate-cli.test.ts
statusReason: a repo with no stryker config skips and still exits 0: a repo with no stryker config skips and still exits 0
