[Killed] BlockStatement
src/store.ts:33:44
  * last, which is worse than leaving it unattributed. Emit per-turn instead. Set
  * this only for hosts that genuinely report small, late increments.
  */
-export function backfillWindowMs(): number {
-	const raw = Number(process.env.CRAFT_METRICS_BACKFILL_MS);
-	return Number.isFinite(raw) && raw > 0 ? raw : 0;
-}
+export function backfillWindowMs(): number {}
 
 export function defaultDir(): string {
killedBy: test/store.test.ts
statusReason: backfill within the window is recorded and flagged as a guess: backfill within the window is recorded and flagged as a guess

[Killed] ConditionalExpression
src/store.ts:35:9
  */
 export function backfillWindowMs(): number {
 	const raw = Number(process.env.CRAFT_METRICS_BACKFILL_MS);
-	return Number.isFinite(raw) && raw > 0 ? raw : 0;
+	return false ? raw : 0;
 }
 
killedBy: test/store.test.ts
statusReason: backfill within the window is recorded and flagged as a guess: backfill within the window is recorded and flagged as a guess

[Killed] EqualityOperator
src/store.ts:35:33
  */
 export function backfillWindowMs(): number {
 	const raw = Number(process.env.CRAFT_METRICS_BACKFILL_MS);
-	return Number.isFinite(raw) && raw > 0 ? raw : 0;
+	return Number.isFinite(raw) && raw <= 0 ? raw : 0;
 }
 
killedBy: test/store.test.ts
statusReason: backfill within the window is recorded and flagged as a guess: backfill within the window is recorded and flagged as a guess

[NoCoverage] BlockStatement
src/store.ts:38:38
 	return Number.isFinite(raw) && raw > 0 ? raw : 0;
 }
 
-export function defaultDir(): string {
-	return join(homedir(), ".local", "share", "craft-metrics");
-}
+export function defaultDir(): string {}
 
 export function defaultStorePath(): string {

[NoCoverage] StringLiteral
src/store.ts:39:44
 }
 
 export function defaultDir(): string {
-	return join(homedir(), ".local", "share", "craft-metrics");
+	return join(homedir(), ".local", "share", "");
 }
 

[NoCoverage] BlockStatement
src/store.ts:42:44
 	return join(homedir(), ".local", "share", "craft-metrics");
 }
 
-export function defaultStorePath(): string {
-	return join(defaultDir(), "events.jsonl");
-}
+export function defaultStorePath(): string {}
 
 function sidecarPath(storePath: string): string {

[NoCoverage] StringLiteral
src/store.ts:43:28
 }
 
 export function defaultStorePath(): string {
-	return join(defaultDir(), "events.jsonl");
+	return join(defaultDir(), "");
 }
 

[Killed] BlockStatement
src/store.ts:46:49
 	return join(defaultDir(), "events.jsonl");
 }
 
-function sidecarPath(storePath: string): string {
-	return join(dirname(storePath), "current.json");
-}
+function sidecarPath(storePath: string): string {}
 
 function nowIso(): string {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:50:27
 	return join(dirname(storePath), "current.json");
 }
 
-function nowIso(): string {
-	return new Date().toISOString();
-}
+function nowIso(): string {}
 
 function addTokens(a: Tokens, b: Partial<Tokens>): void {
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Killed] BlockStatement
src/store.ts:54:57
 	return new Date().toISOString();
 }
 
-function addTokens(a: Tokens, b: Partial<Tokens>): void {
-	a.input += b.input ?? 0;
-	a.output += b.output ?? 0;
-	a.cacheRead += b.cacheRead ?? 0;
-	a.cacheWrite += b.cacheWrite ?? 0;
-}
+function addTokens(a: Tokens, b: Partial<Tokens>): void {}
 
 export function pushUnique(list: string[], value?: string): void {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] LogicalOperator
src/store.ts:55:13
 }
 
 function addTokens(a: Tokens, b: Partial<Tokens>): void {
-	a.input += b.input ?? 0;
+	a.input += b.input && 0;
 	a.output += b.output ?? 0;
 	a.cacheRead += b.cacheRead ?? 0;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] AssignmentOperator
src/store.ts:55:2
 }
 
 function addTokens(a: Tokens, b: Partial<Tokens>): void {
-	a.input += b.input ?? 0;
+	a.input -= b.input ?? 0;
 	a.output += b.output ?? 0;
 	a.cacheRead += b.cacheRead ?? 0;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] LogicalOperator
src/store.ts:56:14
 
 function addTokens(a: Tokens, b: Partial<Tokens>): void {
 	a.input += b.input ?? 0;
-	a.output += b.output ?? 0;
+	a.output += b.output && 0;
 	a.cacheRead += b.cacheRead ?? 0;
 	a.cacheWrite += b.cacheWrite ?? 0;
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Killed] AssignmentOperator
src/store.ts:56:2
 
 function addTokens(a: Tokens, b: Partial<Tokens>): void {
 	a.input += b.input ?? 0;
-	a.output += b.output ?? 0;
+	a.output -= b.output ?? 0;
 	a.cacheRead += b.cacheRead ?? 0;
 	a.cacheWrite += b.cacheWrite ?? 0;
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] AssignmentOperator
src/store.ts:57:2
 function addTokens(a: Tokens, b: Partial<Tokens>): void {
 	a.input += b.input ?? 0;
 	a.output += b.output ?? 0;
-	a.cacheRead += b.cacheRead ?? 0;
+	a.cacheRead -= b.cacheRead ?? 0;
 	a.cacheWrite += b.cacheWrite ?? 0;
 }
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Killed] LogicalOperator
src/store.ts:57:17
 function addTokens(a: Tokens, b: Partial<Tokens>): void {
 	a.input += b.input ?? 0;
 	a.output += b.output ?? 0;
-	a.cacheRead += b.cacheRead ?? 0;
+	a.cacheRead += b.cacheRead && 0;
 	a.cacheWrite += b.cacheWrite ?? 0;
 }
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Killed] AssignmentOperator
src/store.ts:58:2
 	a.input += b.input ?? 0;
 	a.output += b.output ?? 0;
 	a.cacheRead += b.cacheRead ?? 0;
-	a.cacheWrite += b.cacheWrite ?? 0;
+	a.cacheWrite -= b.cacheWrite ?? 0;
 }
 
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] LogicalOperator
src/store.ts:58:18
 	a.input += b.input ?? 0;
 	a.output += b.output ?? 0;
 	a.cacheRead += b.cacheRead ?? 0;
-	a.cacheWrite += b.cacheWrite ?? 0;
+	a.cacheWrite += b.cacheWrite && 0;
 }
 
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Killed] BlockStatement
src/store.ts:61:66
 	a.cacheWrite += b.cacheWrite ?? 0;
 }
 
-export function pushUnique(list: string[], value?: string): void {
-	if (!value) return;
-	if (!list.includes(value)) list.push(value);
-}
+export function pushUnique(list: string[], value?: string): void {}
 
 export interface UsageEvent {
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] BooleanLiteral
src/store.ts:62:6
 }
 
 export function pushUnique(list: string[], value?: string): void {
-	if (!value) return;
+	if (value) return;
 	if (!list.includes(value)) list.push(value);
 }
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] ConditionalExpression
src/store.ts:62:6
 }
 
 export function pushUnique(list: string[], value?: string): void {
-	if (!value) return;
+	if (false) return;
 	if (!list.includes(value)) list.push(value);
 }
killedBy: test/store-format.test.ts
statusReason: pushUnique ignores empties and never duplicates: pushUnique ignores empties and never duplicates

[Killed] ConditionalExpression
src/store.ts:63:6
 
 export function pushUnique(list: string[], value?: string): void {
 	if (!value) return;
-	if (!list.includes(value)) list.push(value);
+	if (true) list.push(value);
 }
 
killedBy: test/store-format.test.ts
statusReason: pushUnique ignores empties and never duplicates: pushUnique ignores empties and never duplicates

[Killed] ConditionalExpression
src/store.ts:63:6
 
 export function pushUnique(list: string[], value?: string): void {
 	if (!value) return;
-	if (!list.includes(value)) list.push(value);
+	if (false) list.push(value);
 }
 
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] BlockStatement
src/store.ts:145:70
 	 * who runs it and when they last synced their model registry.
 	 */
 	prices?: PriceTable;
-	constructor(path: string = defaultStorePath(), prices?: PriceTable) {
-		this.path = path;
-		this.prices = prices;
-	}
+	constructor(path: string = defaultStorePath(), prices?: PriceTable) {}
 
 	loadEvents(): LogEvent[] {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:150:27
 		this.prices = prices;
 	}
 
-	loadEvents(): LogEvent[] {
-		let raw: string;
-		try {
-			raw = readFileSync(this.path, "utf8");
-		} catch (err) {
-			if ((err as NodeJS.ErrnoException).code === "ENOENT") return [];
-			throw err;
-		}
-		const events: LogEvent[] = [];
-		for (const line of raw.split("\n")) {
-			if (!line.trim()) continue;
-			events.push(JSON.parse(line) as LogEvent);
-		}
-		return events;
-	}
+	loadEvents(): LogEvent[] {}
 
 	append(event: LogEvent): void {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:152:7
 
 	loadEvents(): LogEvent[] {
 		let raw: string;
-		try {
-			raw = readFileSync(this.path, "utf8");
-		} catch (err) {
+		try {} catch (err) {
 			if ((err as NodeJS.ErrnoException).code === "ENOENT") return [];
 			throw err;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] StringLiteral
src/store.ts:153:34
 	loadEvents(): LogEvent[] {
 		let raw: string;
 		try {
-			raw = readFileSync(this.path, "utf8");
+			raw = readFileSync(this.path, "");
 		} catch (err) {
 			if ((err as NodeJS.ErrnoException).code === "ENOENT") return [];
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:154:17
 		let raw: string;
 		try {
 			raw = readFileSync(this.path, "utf8");
-		} catch (err) {
-			if ((err as NodeJS.ErrnoException).code === "ENOENT") return [];
-			throw err;
-		}
+		} catch (err) {}
 		const events: LogEvent[] = [];
 		for (const line of raw.split("\n")) {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] EqualityOperator
src/store.ts:155:8
 		try {
 			raw = readFileSync(this.path, "utf8");
 		} catch (err) {
-			if ((err as NodeJS.ErrnoException).code === "ENOENT") return [];
+			if ((err as NodeJS.ErrnoException).code !== "ENOENT") return [];
 			throw err;
 		}
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:155:8
 		try {
 			raw = readFileSync(this.path, "utf8");
 		} catch (err) {
-			if ((err as NodeJS.ErrnoException).code === "ENOENT") return [];
+			if (false) return [];
 			throw err;
 		}
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Survived] ArrayDeclaration
src/store.ts:158:30
 			if ((err as NodeJS.ErrnoException).code === "ENOENT") return [];
 			throw err;
 		}
-		const events: LogEvent[] = [];
+		const events: LogEvent[] = ["Stryker was here"];
 		for (const line of raw.split("\n")) {
 			if (!line.trim()) continue;

[Killed] BlockStatement
src/store.ts:159:39
 			throw err;
 		}
 		const events: LogEvent[] = [];
-		for (const line of raw.split("\n")) {
-			if (!line.trim()) continue;
-			events.push(JSON.parse(line) as LogEvent);
-		}
+		for (const line of raw.split("\n")) {}
 		return events;
 	}
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BooleanLiteral
src/store.ts:160:8
 		}
 		const events: LogEvent[] = [];
 		for (const line of raw.split("\n")) {
-			if (!line.trim()) continue;
+			if (line.trim()) continue;
 			events.push(JSON.parse(line) as LogEvent);
 		}
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:160:8
 		}
 		const events: LogEvent[] = [];
 		for (const line of raw.split("\n")) {
-			if (!line.trim()) continue;
+			if (true) continue;
 			events.push(JSON.parse(line) as LogEvent);
 		}
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] CallExpression
src/store.ts:161:4
 		const events: LogEvent[] = [];
 		for (const line of raw.split("\n")) {
 			if (!line.trim()) continue;
-			events.push(JSON.parse(line) as LogEvent);
+			;
 		}
 		return events;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:166:32
 		return events;
 	}
 
-	append(event: LogEvent): void {
-		mkdirSync(dirname(this.path), { recursive: true });
-		appendFileSync(this.path, JSON.stringify(event) + "\n");
-		if (event.t === "run_open") this.writeSidecar(event.cwd, event.run_id);
-		if (event.t === "run_end") this.clearSidecar(event.run_id);
-	}
+	append(event: LogEvent): void {}
 
 	readSidecar(): Record<string, string> {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BooleanLiteral
src/store.ts:167:46
 	}
 
 	append(event: LogEvent): void {
-		mkdirSync(dirname(this.path), { recursive: true });
+		mkdirSync(dirname(this.path), { recursive: false });
 		appendFileSync(this.path, JSON.stringify(event) + "\n");
 		if (event.t === "run_open") this.writeSidecar(event.cwd, event.run_id);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Survived] CallExpression
src/store.ts:169:31
 	append(event: LogEvent): void {
 		mkdirSync(dirname(this.path), { recursive: true });
 		appendFileSync(this.path, JSON.stringify(event) + "\n");
-		if (event.t === "run_open") this.writeSidecar(event.cwd, event.run_id);
+		if (event.t === "run_open") ;
 		if (event.t === "run_end") this.clearSidecar(event.run_id);
 	}

[Survived] ConditionalExpression
src/store.ts:169:7
 	append(event: LogEvent): void {
 		mkdirSync(dirname(this.path), { recursive: true });
 		appendFileSync(this.path, JSON.stringify(event) + "\n");
-		if (event.t === "run_open") this.writeSidecar(event.cwd, event.run_id);
+		if (false) this.writeSidecar(event.cwd, event.run_id);
 		if (event.t === "run_end") this.clearSidecar(event.run_id);
 	}

[Survived] ConditionalExpression
src/store.ts:170:7
 		mkdirSync(dirname(this.path), { recursive: true });
 		appendFileSync(this.path, JSON.stringify(event) + "\n");
 		if (event.t === "run_open") this.writeSidecar(event.cwd, event.run_id);
-		if (event.t === "run_end") this.clearSidecar(event.run_id);
+		if (true) this.clearSidecar(event.run_id);
 	}
 

[Survived] ConditionalExpression
src/store.ts:170:7
 		mkdirSync(dirname(this.path), { recursive: true });
 		appendFileSync(this.path, JSON.stringify(event) + "\n");
 		if (event.t === "run_open") this.writeSidecar(event.cwd, event.run_id);
-		if (event.t === "run_end") this.clearSidecar(event.run_id);
+		if (false) this.clearSidecar(event.run_id);
 	}
 

[Killed] BlockStatement
src/store.ts:173:40
 		if (event.t === "run_end") this.clearSidecar(event.run_id);
 	}
 
-	readSidecar(): Record<string, string> {
-		try {
-			return JSON.parse(readFileSync(sidecarPath(this.path), "utf8")) as Record<string, string>;
-		} catch {
-			return {};
-		}
-	}
+	readSidecar(): Record<string, string> {}
 
 	writeSidecar(cwd: string, runId: string): void {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:174:7
 	}
 
 	readSidecar(): Record<string, string> {
-		try {
-			return JSON.parse(readFileSync(sidecarPath(this.path), "utf8")) as Record<string, string>;
-		} catch {
+		try {} catch {
 			return {};
 		}
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:176:11
 	readSidecar(): Record<string, string> {
 		try {
 			return JSON.parse(readFileSync(sidecarPath(this.path), "utf8")) as Record<string, string>;
-		} catch {
-			return {};
-		}
+		} catch {}
 	}
 
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Survived] BlockStatement
src/store.ts:181:49
 		}
 	}
 
-	writeSidecar(cwd: string, runId: string): void {
-		const map = this.readSidecar();
-		map[cwd] = runId;
-		writeFileSync(sidecarPath(this.path), JSON.stringify(map));
-	}
+	writeSidecar(cwd: string, runId: string): void {}
 
 	clearSidecar(runId: string): void {

[Survived] CallExpression
src/store.ts:184:3
 	writeSidecar(cwd: string, runId: string): void {
 		const map = this.readSidecar();
 		map[cwd] = runId;
-		writeFileSync(sidecarPath(this.path), JSON.stringify(map));
+		;
 	}
 

[Survived] BlockStatement
src/store.ts:187:36
 		writeFileSync(sidecarPath(this.path), JSON.stringify(map));
 	}
 
-	clearSidecar(runId: string): void {
-		const map = this.readSidecar();
-		let changed = false;
-		for (const [cwd, id] of Object.entries(map)) {
-			if (id === runId) {
-				delete map[cwd];
-				changed = true;
-			}
-		}
-		if (changed) writeFileSync(sidecarPath(this.path), JSON.stringify(map));
-	}
+	clearSidecar(runId: string): void {}
 
 	loadAll(): Run[] {

[Survived] BooleanLiteral
src/store.ts:189:17
 
 	clearSidecar(runId: string): void {
 		const map = this.readSidecar();
-		let changed = false;
+		let changed = true;
 		for (const [cwd, id] of Object.entries(map)) {
 			if (id === runId) {

[Survived] BlockStatement
src/store.ts:190:48
 	clearSidecar(runId: string): void {
 		const map = this.readSidecar();
 		let changed = false;
-		for (const [cwd, id] of Object.entries(map)) {
-			if (id === runId) {
-				delete map[cwd];
-				changed = true;
-			}
-		}
+		for (const [cwd, id] of Object.entries(map)) {}
 		if (changed) writeFileSync(sidecarPath(this.path), JSON.stringify(map));
 	}

[Survived] BlockStatement
src/store.ts:191:22
 		const map = this.readSidecar();
 		let changed = false;
 		for (const [cwd, id] of Object.entries(map)) {
-			if (id === runId) {
-				delete map[cwd];
-				changed = true;
-			}
+			if (id === runId) {}
 		}
 		if (changed) writeFileSync(sidecarPath(this.path), JSON.stringify(map));

[Survived] EqualityOperator
src/store.ts:191:8
 		const map = this.readSidecar();
 		let changed = false;
 		for (const [cwd, id] of Object.entries(map)) {
-			if (id === runId) {
+			if (id !== runId) {
 				delete map[cwd];
 				changed = true;

[Survived] BooleanLiteral
src/store.ts:193:15
 		for (const [cwd, id] of Object.entries(map)) {
 			if (id === runId) {
 				delete map[cwd];
-				changed = true;
+				changed = false;
 			}
 		}

[Survived] ConditionalExpression
src/store.ts:196:7
 				changed = true;
 			}
 		}
-		if (changed) writeFileSync(sidecarPath(this.path), JSON.stringify(map));
+		if (false) writeFileSync(sidecarPath(this.path), JSON.stringify(map));
 	}
 

[Survived] ConditionalExpression
src/store.ts:196:7
 				changed = true;
 			}
 		}
-		if (changed) writeFileSync(sidecarPath(this.path), JSON.stringify(map));
+		if (true) writeFileSync(sidecarPath(this.path), JSON.stringify(map));
 	}
 

[Killed] BlockStatement
src/store.ts:199:19
 		if (changed) writeFileSync(sidecarPath(this.path), JSON.stringify(map));
 	}
 
-	loadAll(): Run[] {
-		const events = this.loadEvents();
-		// A run's mode decides where its usage lands — `dag` buckets to `supervisor`
-		// rather than `unattributed`. Folding events in order would resolve usage
-		// against whatever mode was known at the time, so a `mode` event appended
-		// later relabelled the run without moving a cent of its already-folded cost.
-		// Resolving the final mode up front makes a correction actually correct.
-		const finalMode = finalModes(events);
-		const byId = new Map<string, Run>();
-		for (const ev of events) fold(byId, ev, finalMode);
-		const runs = [...byId.values()];
-		// Priced at read time, not folded from events: a price-table correction
-		// re-prices every historical run on the next `loadAll`, no migration needed.
-		const prices = this.prices ?? loadPriceTable();
-		for (const run of runs) {
-			applyNotionalPricing(run, prices);
-			// Runs recorded before `--craft-version` existed carry no declaration, so
-			// their workflow revision is recovered from the agents they spawned.
-			applyCraftVersion(run);
-		}
-		return runs;
-	}
+	loadAll(): Run[] {}
 
 	get(runId: string): Run | undefined {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] CallExpression
src/store.ts:208:28
 		// Resolving the final mode up front makes a correction actually correct.
 		const finalMode = finalModes(events);
 		const byId = new Map<string, Run>();
-		for (const ev of events) fold(byId, ev, finalMode);
+		for (const ev of events) ;
 		const runs = [...byId.values()];
 		// Priced at read time, not folded from events: a price-table correction
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] LogicalOperator
src/store.ts:212:18
 		const runs = [...byId.values()];
 		// Priced at read time, not folded from events: a price-table correction
 		// re-prices every historical run on the next `loadAll`, no migration needed.
-		const prices = this.prices ?? loadPriceTable();
+		const prices = this.prices && loadPriceTable();
 		for (const run of runs) {
 			applyNotionalPricing(run, prices);
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Killed] BlockStatement
src/store.ts:213:27
 		// Priced at read time, not folded from events: a price-table correction
 		// re-prices every historical run on the next `loadAll`, no migration needed.
 		const prices = this.prices ?? loadPriceTable();
-		for (const run of runs) {
-			applyNotionalPricing(run, prices);
-			// Runs recorded before `--craft-version` existed carry no declaration, so
-			// their workflow revision is recovered from the agents they spawned.
-			applyCraftVersion(run);
-		}
+		for (const run of runs) {}
 		return runs;
 	}
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] CallExpression
src/store.ts:214:4
 		// re-prices every historical run on the next `loadAll`, no migration needed.
 		const prices = this.prices ?? loadPriceTable();
 		for (const run of runs) {
-			applyNotionalPricing(run, prices);
+			;
 			// Runs recorded before `--craft-version` existed carry no declaration, so
 			// their workflow revision is recovered from the agents they spawned.
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] CallExpression
src/store.ts:217:4
 			applyNotionalPricing(run, prices);
 			// Runs recorded before `--craft-version` existed carry no declaration, so
 			// their workflow revision is recovered from the agents they spawned.
-			applyCraftVersion(run);
+			;
 		}
 		return runs;
killedBy: test/store.test.ts
statusReason: v3 is inferred from the three-agent counsel panel: v3 is inferred from the three-agent counsel panel

[Killed] BlockStatement
src/store.ts:222:38
 		return runs;
 	}
 
-	get(runId: string): Run | undefined {
-		return this.loadAll().find((r) => r.run_id === runId);
-	}
+	get(runId: string): Run | undefined {}
 
 	/**
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:223:37
 	}
 
 	get(runId: string): Run | undefined {
-		return this.loadAll().find((r) => r.run_id === runId);
+		return this.loadAll().find((r) => false);
 	}
 
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ArrowFunction
src/store.ts:223:30
 	}
 
 	get(runId: string): Run | undefined {
-		return this.loadAll().find((r) => r.run_id === runId);
+		return this.loadAll().find(() => undefined);
 	}
 
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:233:7
 	 */
 	openPhase(runId: string): PhaseName | undefined {
 		let raw: string;
-		try {
-			raw = readFileSync(this.path, "utf8");
-		} catch {
+		try {} catch {
 			return undefined;
 		}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[NoCoverage] BlockStatement
src/store.ts:235:11
 		let raw: string;
 		try {
 			raw = readFileSync(this.path, "utf8");
-		} catch {
-			return undefined;
-		}
+		} catch {}
 		const lines = raw.split("\n");
 		for (let i = lines.length - 1; i >= 0; i--) {

[Killed] StringLiteral
src/store.ts:238:27
 		} catch {
 			return undefined;
 		}
-		const lines = raw.split("\n");
+		const lines = raw.split("");
 		for (let i = lines.length - 1; i >= 0; i--) {
 			const line = lines[i];
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] BlockStatement
src/store.ts:239:47
 			return undefined;
 		}
 		const lines = raw.split("\n");
-		for (let i = lines.length - 1; i >= 0; i--) {
-			const line = lines[i];
-			if (!line || !line.includes(runId)) continue;
-			if (!line.includes('"phase_enter"') && !line.includes('"phase_exit"') && !line.includes('"run_end"')) {
-				continue;
-			}
-			let ev: LogEvent;
-			try {
-				ev = JSON.parse(line) as LogEvent;
-			} catch {
-				continue;
-			}
-			if (ev.run_id !== runId) continue;
-			if (ev.t === "phase_enter") return ev.phase;
-			if (ev.t === "phase_exit" || ev.t === "run_end") return undefined;
-		}
+		for (let i = lines.length - 1; i >= 0; i--) {}
 		return undefined;
 	}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] EqualityOperator
src/store.ts:239:34
 			return undefined;
 		}
 		const lines = raw.split("\n");
-		for (let i = lines.length - 1; i >= 0; i--) {
+		for (let i = lines.length - 1; i < 0; i--) {
 			const line = lines[i];
 			if (!line || !line.includes(runId)) continue;
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] BooleanLiteral
src/store.ts:241:17
 		const lines = raw.split("\n");
 		for (let i = lines.length - 1; i >= 0; i--) {
 			const line = lines[i];
-			if (!line || !line.includes(runId)) continue;
+			if (!line || line.includes(runId)) continue;
 			if (!line.includes('"phase_enter"') && !line.includes('"phase_exit"') && !line.includes('"run_end"')) {
 				continue;
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] BooleanLiteral
src/store.ts:241:8
 		const lines = raw.split("\n");
 		for (let i = lines.length - 1; i >= 0; i--) {
 			const line = lines[i];
-			if (!line || !line.includes(runId)) continue;
+			if (line || !line.includes(runId)) continue;
 			if (!line.includes('"phase_enter"') && !line.includes('"phase_exit"') && !line.includes('"run_end"')) {
 				continue;
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log
