[Killed] ConditionalExpression
src/store.ts:242:8
 		for (let i = lines.length - 1; i >= 0; i--) {
 			const line = lines[i];
 			if (!line || !line.includes(runId)) continue;
-			if (!line.includes('"phase_enter"') && !line.includes('"phase_exit"') && !line.includes('"run_end"')) {
+			if (true) {
 				continue;
 			}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] ConditionalExpression
src/store.ts:242:8
 		for (let i = lines.length - 1; i >= 0; i--) {
 			const line = lines[i];
 			if (!line || !line.includes(runId)) continue;
-			if (!line.includes('"phase_enter"') && !line.includes('"phase_exit"') && !line.includes('"run_end"')) {
+			if (true && !line.includes('"run_end"')) {
 				continue;
 			}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] BlockStatement
src/store.ts:246:8
 				continue;
 			}
 			let ev: LogEvent;
-			try {
-				ev = JSON.parse(line) as LogEvent;
-			} catch {
+			try {} catch {
 				continue;
 			}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[NoCoverage] BlockStatement
src/store.ts:248:12
 			let ev: LogEvent;
 			try {
 				ev = JSON.parse(line) as LogEvent;
-			} catch {
-				continue;
-			}
+			} catch {}
 			if (ev.run_id !== runId) continue;
 			if (ev.t === "phase_enter") return ev.phase;

[Killed] ConditionalExpression
src/store.ts:251:8
 			} catch {
 				continue;
 			}
-			if (ev.run_id !== runId) continue;
+			if (true) continue;
 			if (ev.t === "phase_enter") return ev.phase;
 			if (ev.t === "phase_exit" || ev.t === "run_end") return undefined;
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] EqualityOperator
src/store.ts:251:8
 			} catch {
 				continue;
 			}
-			if (ev.run_id !== runId) continue;
+			if (ev.run_id === runId) continue;
 			if (ev.t === "phase_enter") return ev.phase;
 			if (ev.t === "phase_exit" || ev.t === "run_end") return undefined;
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] ConditionalExpression
src/store.ts:252:8
 				continue;
 			}
 			if (ev.run_id !== runId) continue;
-			if (ev.t === "phase_enter") return ev.phase;
+			if (true) return ev.phase;
 			if (ev.t === "phase_exit" || ev.t === "run_end") return undefined;
 		}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] ConditionalExpression
src/store.ts:252:8
 				continue;
 			}
 			if (ev.run_id !== runId) continue;
-			if (ev.t === "phase_enter") return ev.phase;
+			if (false) return ev.phase;
 			if (ev.t === "phase_exit" || ev.t === "run_end") return undefined;
 		}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] EqualityOperator
src/store.ts:253:8
 			}
 			if (ev.run_id !== runId) continue;
 			if (ev.t === "phase_enter") return ev.phase;
-			if (ev.t === "phase_exit" || ev.t === "run_end") return undefined;
+			if (ev.t !== "phase_exit" || ev.t === "run_end") return undefined;
 		}
 		return undefined;
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] ConditionalExpression
src/store.ts:253:8
 			}
 			if (ev.run_id !== runId) continue;
 			if (ev.t === "phase_enter") return ev.phase;
-			if (ev.t === "phase_exit" || ev.t === "run_end") return undefined;
+			if (false) return undefined;
 		}
 		return undefined;
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] ConditionalExpression
src/store.ts:269:7
 		at?: string;
 	}): Run {
 		const existing = opts.run_id ? this.get(opts.run_id) : this.latestOpenForCwd(opts.cwd);
-		if (existing) {
+		if (true) {
 			if (opts.kind && !existing.kind) this.setKind(existing.run_id, opts.kind, opts.at);
 			// The pi extension opens a run from the prompt before the skill reaches its
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:269:17
 		at?: string;
 	}): Run {
 		const existing = opts.run_id ? this.get(opts.run_id) : this.latestOpenForCwd(opts.cwd);
-		if (existing) {
-			if (opts.kind && !existing.kind) this.setKind(existing.run_id, opts.kind, opts.at);
-			// The pi extension opens a run from the prompt before the skill reaches its
-			// own `start`, so the declared version arrives second and must be backfilled
-			// or every run silently falls back to inference.
-			//
-			// The test is whether a version was *declared*, not whether one is present:
-			// `existing` has already been through the classifier, so an inferred value
-			// would otherwise look like a declaration and block the real one.
-			if (opts.craft_version && existing.craft_version_source !== "declared") {
-				this.setCraftVersion(existing.run_id, opts.craft_version, "declared", opts.at);
-			}
-			// Fill in a missing harness, never overwrite a stated one. Whoever opened
-			// the run first is more likely to have known: an adapter *is* its host,
-			// while a later `start` only repeats whatever flag the conductor typed. A
-			// genuine disagreement is left standing for `setHost` to settle explicitly.
-			if (opts.host !== "unknown" && existing.host === "unknown") {
-				this.setHost(existing.run_id, opts.host, opts.at);
-			}
-			return this.get(existing.run_id) ?? existing;
-		}
+		if (existing) {}
 		const run_id = opts.run_id ?? randomUUID();
 		this.append({
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Killed] BooleanLiteral
src/store.ts:270:21
 	}): Run {
 		const existing = opts.run_id ? this.get(opts.run_id) : this.latestOpenForCwd(opts.cwd);
 		if (existing) {
-			if (opts.kind && !existing.kind) this.setKind(existing.run_id, opts.kind, opts.at);
+			if (opts.kind && existing.kind) this.setKind(existing.run_id, opts.kind, opts.at);
 			// The pi extension opens a run from the prompt before the skill reaches its
 			// own `start`, so the declared version arrives second and must be backfilled
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Killed] CallExpression
src/store.ts:270:37
 	}): Run {
 		const existing = opts.run_id ? this.get(opts.run_id) : this.latestOpenForCwd(opts.cwd);
 		if (existing) {
-			if (opts.kind && !existing.kind) this.setKind(existing.run_id, opts.kind, opts.at);
+			if (opts.kind && !existing.kind) ;
 			// The pi extension opens a run from the prompt before the skill reaches its
 			// own `start`, so the declared version arrives second and must be backfilled
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Killed] LogicalOperator
src/store.ts:278:8
 			// The test is whether a version was *declared*, not whether one is present:
 			// `existing` has already been through the classifier, so an inferred value
 			// would otherwise look like a declaration and block the real one.
-			if (opts.craft_version && existing.craft_version_source !== "declared") {
+			if (opts.craft_version || existing.craft_version_source !== "declared") {
 				this.setCraftVersion(existing.run_id, opts.craft_version, "declared", opts.at);
 			}
killedBy: test/store.test.ts
statusReason: a declared version is not overwritten by a later, different declaration: a declared version is not overwritten by a later, different declaration

[Killed] EqualityOperator
src/store.ts:278:30
 			// The test is whether a version was *declared*, not whether one is present:
 			// `existing` has already been through the classifier, so an inferred value
 			// would otherwise look like a declaration and block the real one.
-			if (opts.craft_version && existing.craft_version_source !== "declared") {
+			if (opts.craft_version && existing.craft_version_source === "declared") {
 				this.setCraftVersion(existing.run_id, opts.craft_version, "declared", opts.at);
 			}
killedBy: test/store.test.ts
statusReason: a version declared after the run was already opened is backfilled: a version declared after the run was already opened is backfilled

[Killed] ConditionalExpression
src/store.ts:285:35
 			// the run first is more likely to have known: an adapter *is* its host,
 			// while a later `start` only repeats whatever flag the conductor typed. A
 			// genuine disagreement is left standing for `setHost` to settle explicitly.
-			if (opts.host !== "unknown" && existing.host === "unknown") {
+			if (opts.host !== "unknown" && true) {
 				this.setHost(existing.run_id, opts.host, opts.at);
 			}
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness

[Killed] ConditionalExpression
src/store.ts:285:8
 			// the run first is more likely to have known: an adapter *is* its host,
 			// while a later `start` only repeats whatever flag the conductor typed. A
 			// genuine disagreement is left standing for `setHost` to settle explicitly.
-			if (opts.host !== "unknown" && existing.host === "unknown") {
+			if (false) {
 				this.setHost(existing.run_id, opts.host, opts.at);
 			}
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness

[Killed] CallExpression
src/store.ts:286:5
 			// while a later `start` only repeats whatever flag the conductor typed. A
 			// genuine disagreement is left standing for `setHost` to settle explicitly.
 			if (opts.host !== "unknown" && existing.host === "unknown") {
-				this.setHost(existing.run_id, opts.host, opts.at);
+				;
 			}
 			return this.get(existing.run_id) ?? existing;
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness

[Killed] LogicalOperator
src/store.ts:288:11
 			if (opts.host !== "unknown" && existing.host === "unknown") {
 				this.setHost(existing.run_id, opts.host, opts.at);
 			}
-			return this.get(existing.run_id) ?? existing;
+			return this.get(existing.run_id) && existing;
 		}
 		const run_id = opts.run_id ?? randomUUID();
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Killed] LogicalOperator
src/store.ts:290:18
 			}
 			return this.get(existing.run_id) ?? existing;
 		}
-		const run_id = opts.run_id ?? randomUUID();
+		const run_id = opts.run_id && randomUUID();
 		this.append({
 			v: SCHEMA_VERSION,
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] LogicalOperator
src/store.ts:295:8
 			v: SCHEMA_VERSION,
 			t: "run_open",
 			run_id,
-			at: opts.at ?? nowIso(),
+			at: opts.at && nowIso(),
 			host: opts.host,
 			cwd: opts.cwd,
killedBy: test/store.test.ts
statusReason: doctor flags runs left open past the stale threshold: doctor flags runs left open past the stale threshold

[Killed] BlockStatement
src/store.ts:306:95
 		return this.require(run_id);
 	}
 
-	enterPhase(runId: string, phase: PhaseName, opts: { agent?: string; at?: string } = {}): Run {
-		const run = this.require(runId);
-		if (run.mode === "lite" && (phase === "counsel" || phase === "T")) {
-			throw new Error(
-				`refusing phase_enter: run ${runId} is mode=lite, which forbids phase=${phase}. ` +
-					`craft-lite skips counsel and T entirely — do not spawn craft-plan-*/craft-security-review agents under this protocol.`,
-			);
-		}
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "phase_enter",
-			run_id: runId,
-			at: opts.at ?? nowIso(),
-			phase,
-			agent: opts.agent,
-		});
-		return this.get(runId) ?? this.missing(runId);
-	}
+	enterPhase(runId: string, phase: PhaseName, opts: { agent?: string; at?: string } = {}): Run {}
 
 	/**
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] EqualityOperator
src/store.ts:308:54
 
 	enterPhase(runId: string, phase: PhaseName, opts: { agent?: string; at?: string } = {}): Run {
 		const run = this.require(runId);
-		if (run.mode === "lite" && (phase === "counsel" || phase === "T")) {
+		if (run.mode === "lite" && (phase === "counsel" || phase !== "T")) {
 			throw new Error(
 				`refusing phase_enter: run ${runId} is mode=lite, which forbids phase=${phase}. ` +
killedBy: test/store.test.ts
statusReason: lite mode refuses counsel and T phase_enter: lite mode refuses counsel and T phase_enter

[Killed] EqualityOperator
src/store.ts:308:7
 
 	enterPhase(runId: string, phase: PhaseName, opts: { agent?: string; at?: string } = {}): Run {
 		const run = this.require(runId);
-		if (run.mode === "lite" && (phase === "counsel" || phase === "T")) {
+		if (run.mode !== "lite" && (phase === "counsel" || phase === "T")) {
 			throw new Error(
 				`refusing phase_enter: run ${runId} is mode=lite, which forbids phase=${phase}. ` +
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] StringLiteral
src/store.ts:310:5
 		const run = this.require(runId);
 		if (run.mode === "lite" && (phase === "counsel" || phase === "T")) {
 			throw new Error(
-				`refusing phase_enter: run ${runId} is mode=lite, which forbids phase=${phase}. ` +
+				`` +
 					`craft-lite skips counsel and T entirely — do not spawn craft-plan-*/craft-security-review agents under this protocol.`,
 			);
killedBy: test/store.test.ts
statusReason: lite mode refuses counsel and T phase_enter: lite mode refuses counsel and T phase_enter

[Survived] StringLiteral
src/store.ts:311:6
 		if (run.mode === "lite" && (phase === "counsel" || phase === "T")) {
 			throw new Error(
 				`refusing phase_enter: run ${runId} is mode=lite, which forbids phase=${phase}. ` +
-					`craft-lite skips counsel and T entirely — do not spawn craft-plan-*/craft-security-review agents under this protocol.`,
+					``,
 			);
 		}

[Killed] ObjectLiteral
src/store.ts:314:15
 					`craft-lite skips counsel and T entirely — do not spawn craft-plan-*/craft-security-review agents under this protocol.`,
 			);
 		}
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "phase_enter",
-			run_id: runId,
-			at: opts.at ?? nowIso(),
-			phase,
-			agent: opts.agent,
-		});
+		this.append({});
 		return this.get(runId) ?? this.missing(runId);
 	}
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] LogicalOperator
src/store.ts:318:8
 			v: SCHEMA_VERSION,
 			t: "phase_enter",
 			run_id: runId,
-			at: opts.at ?? nowIso(),
+			at: opts.at && nowIso(),
 			phase,
 			agent: opts.agent,
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] LogicalOperator
src/store.ts:322:10
 			phase,
 			agent: opts.agent,
 		});
-		return this.get(runId) ?? this.missing(runId);
+		return this.get(runId) && this.missing(runId);
 	}
 
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:330:83
 	 * ground truth a reviewer's `pass` verdict is checked against — a phase report
 	 * asserting "tests pass" is a claim, this is an exit code.
 	 */
-	recordVerify(runId: string, command: string, exitCode: number, at?: string): Run {
-		const run = this.require(runId);
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "verify",
-			run_id: runId,
-			at: at ?? nowIso(),
-			command,
-			exit_code: exitCode,
-			phase: run.open_phase,
-		});
-		return this.require(runId);
-	}
+	recordVerify(runId: string, command: string, exitCode: number, at?: string): Run {}
 
 	exitPhase(runId: string, phase: PhaseName, fields: PhaseExitFields = {}, at?: string): Run {
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run

[Killed] StringLiteral
src/store.ts:334:7
 		const run = this.require(runId);
 		this.append({
 			v: SCHEMA_VERSION,
-			t: "verify",
+			t: "",
 			run_id: runId,
 			at: at ?? nowIso(),
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run

[Survived] LogicalOperator
src/store.ts:336:8
 			v: SCHEMA_VERSION,
 			t: "verify",
 			run_id: runId,
-			at: at ?? nowIso(),
+			at: at && nowIso(),
 			command,
 			exit_code: exitCode,

[Killed] BlockStatement
src/store.ts:344:93
 		return this.require(runId);
 	}
 
-	exitPhase(runId: string, phase: PhaseName, fields: PhaseExitFields = {}, at?: string): Run {
-		const run = this.require(runId);
-		const verdict = fields.verdict?.toLowerCase();
-		if (phase === "A" && verdict === "pass" && run.last_verify && run.last_verify.exit_code !== 0) {
-			throw new Error(
-				`refusing phase_exit: A cannot report verdict=pass while verification is red. ` +
-					`\`${run.last_verify.command}\` exited ${run.last_verify.exit_code}. ` +
-					`Fix the tree and re-run verify, or exit A with verdict=fail.`,
-			);
-		}
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "phase_exit",
-			run_id: runId,
-			at: at ?? nowIso(),
-			phase,
-			fields,
-		});
-		return this.get(runId) ?? this.missing(runId);
-	}
+	exitPhase(runId: string, phase: PhaseName, fields: PhaseExitFields = {}, at?: string): Run {}
 
 	recordUsage(runId: string, event: UsageEvent, fold = true): Run | undefined {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] MethodExpression
src/store.ts:346:19
 
 	exitPhase(runId: string, phase: PhaseName, fields: PhaseExitFields = {}, at?: string): Run {
 		const run = this.require(runId);
-		const verdict = fields.verdict?.toLowerCase();
+		const verdict = fields.verdict?.toUpperCase();
 		if (phase === "A" && verdict === "pass" && run.last_verify && run.last_verify.exit_code !== 0) {
 			throw new Error(
killedBy: test/store.test.ts
statusReason: A cannot report pass while verification is red: A cannot report pass while verification is red

[Killed] OptionalChaining
src/store.ts:346:19
 
 	exitPhase(runId: string, phase: PhaseName, fields: PhaseExitFields = {}, at?: string): Run {
 		const run = this.require(runId);
-		const verdict = fields.verdict?.toLowerCase();
+		const verdict = fields.verdict.toLowerCase();
 		if (phase === "A" && verdict === "pass" && run.last_verify && run.last_verify.exit_code !== 0) {
 			throw new Error(
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] LogicalOperator
src/store.ts:347:7
 	exitPhase(runId: string, phase: PhaseName, fields: PhaseExitFields = {}, at?: string): Run {
 		const run = this.require(runId);
 		const verdict = fields.verdict?.toLowerCase();
-		if (phase === "A" && verdict === "pass" && run.last_verify && run.last_verify.exit_code !== 0) {
+		if (phase === "A" && verdict === "pass" && run.last_verify || run.last_verify.exit_code !== 0) {
 			throw new Error(
 				`refusing phase_exit: A cannot report verdict=pass while verification is red. ` +
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:347:7
 	exitPhase(runId: string, phase: PhaseName, fields: PhaseExitFields = {}, at?: string): Run {
 		const run = this.require(runId);
 		const verdict = fields.verdict?.toLowerCase();
-		if (phase === "A" && verdict === "pass" && run.last_verify && run.last_verify.exit_code !== 0) {
+		if (false) {
 			throw new Error(
 				`refusing phase_exit: A cannot report verdict=pass while verification is red. ` +
killedBy: test/store.test.ts
statusReason: A cannot report pass while verification is red: A cannot report pass while verification is red

[Killed] BlockStatement
src/store.ts:365:78
 		return this.get(runId) ?? this.missing(runId);
 	}
 
-	recordUsage(runId: string, event: UsageEvent, fold = true): Run | undefined {
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "usage",
-			run_id: runId,
-			at: event.at ?? nowIso(),
-			...event,
-		});
-		if (!fold) return undefined;
-		return this.get(runId) ?? this.missing(runId);
-	}
+	recordUsage(runId: string, event: UsageEvent, fold = true): Run | undefined {}
 
 	endRun(runId: string, outcome: Outcome, at?: string): Run {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BooleanLiteral
src/store.ts:365:55
 		return this.get(runId) ?? this.missing(runId);
 	}
 
-	recordUsage(runId: string, event: UsageEvent, fold = true): Run | undefined {
+	recordUsage(runId: string, event: UsageEvent, fold = false): Run | undefined {
 		this.append({
 			v: SCHEMA_VERSION,
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Killed] ObjectLiteral
src/store.ts:366:15
 	}
 
 	recordUsage(runId: string, event: UsageEvent, fold = true): Run | undefined {
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "usage",
-			run_id: runId,
-			at: event.at ?? nowIso(),
-			...event,
-		});
+		this.append({});
 		if (!fold) return undefined;
 		return this.get(runId) ?? this.missing(runId);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Survived] LogicalOperator
src/store.ts:370:8
 			v: SCHEMA_VERSION,
 			t: "usage",
 			run_id: runId,
-			at: event.at ?? nowIso(),
+			at: event.at && nowIso(),
 			...event,
 		});

[Killed] ConditionalExpression
src/store.ts:373:7
 			at: event.at ?? nowIso(),
 			...event,
 		});
-		if (!fold) return undefined;
+		if (true) return undefined;
 		return this.get(runId) ?? this.missing(runId);
 	}
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Killed] BooleanLiteral
src/store.ts:373:7
 			at: event.at ?? nowIso(),
 			...event,
 		});
-		if (!fold) return undefined;
+		if (fold) return undefined;
 		return this.get(runId) ?? this.missing(runId);
 	}
killedBy: test/cli.test.ts
statusReason: doctor exits 0 on clean data and 1 when it finds a problem: doctor exits 0 on clean data and 1 when it finds a problem

[Killed] LogicalOperator
src/store.ts:374:10
 			...event,
 		});
 		if (!fold) return undefined;
-		return this.get(runId) ?? this.missing(runId);
+		return this.get(runId) && this.missing(runId);
 	}
 
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:377:60
 		return this.get(runId) ?? this.missing(runId);
 	}
 
-	endRun(runId: string, outcome: Outcome, at?: string): Run {
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "run_end",
-			run_id: runId,
-			at: at ?? nowIso(),
-			outcome: outcome === "open" ? "completed" : outcome,
-		});
-		return this.get(runId) ?? this.missing(runId);
-	}
+	endRun(runId: string, outcome: Outcome, at?: string): Run {}
 
 	pauseHitl(runId: string, at?: string): Run {
killedBy: test/store-format.test.ts
statusReason: summarize renders the run header with version, kind, mode and outcome: summarize renders the run header with version, kind, mode and outcome

[Killed] ConditionalExpression
src/store.ts:383:13
 			t: "run_end",
 			run_id: runId,
 			at: at ?? nowIso(),
-			outcome: outcome === "open" ? "completed" : outcome,
+			outcome: true ? "completed" : outcome,
 		});
 		return this.get(runId) ?? this.missing(runId);
killedBy: test/cli.test.ts
statusReason: end defaults to completed and accepts an explicit outcome: end defaults to completed and accepts an explicit outcome

[Killed] EqualityOperator
src/store.ts:383:13
 			t: "run_end",
 			run_id: runId,
 			at: at ?? nowIso(),
-			outcome: outcome === "open" ? "completed" : outcome,
+			outcome: outcome !== "open" ? "completed" : outcome,
 		});
 		return this.get(runId) ?? this.missing(runId);
killedBy: test/cli.test.ts
statusReason: end defaults to completed and accepts an explicit outcome: end defaults to completed and accepts an explicit outcome

[Killed] BlockStatement
src/store.ts:388:45
 		return this.get(runId) ?? this.missing(runId);
 	}
 
-	pauseHitl(runId: string, at?: string): Run {
-		this.append({ v: SCHEMA_VERSION, t: "hitl_pause", run_id: runId, at: at ?? nowIso() });
-		return this.get(runId) ?? this.missing(runId);
-	}
+	pauseHitl(runId: string, at?: string): Run {}
 
 	resumeHitl(runId: string, at?: string): Run {
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] LogicalOperator
src/store.ts:389:72
 	}
 
 	pauseHitl(runId: string, at?: string): Run {
-		this.append({ v: SCHEMA_VERSION, t: "hitl_pause", run_id: runId, at: at ?? nowIso() });
+		this.append({ v: SCHEMA_VERSION, t: "hitl_pause", run_id: runId, at: at && nowIso() });
 		return this.get(runId) ?? this.missing(runId);
 	}
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] ObjectLiteral
src/store.ts:389:15
 	}
 
 	pauseHitl(runId: string, at?: string): Run {
-		this.append({ v: SCHEMA_VERSION, t: "hitl_pause", run_id: runId, at: at ?? nowIso() });
+		this.append({});
 		return this.get(runId) ?? this.missing(runId);
 	}
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] LogicalOperator
src/store.ts:390:10
 
 	pauseHitl(runId: string, at?: string): Run {
 		this.append({ v: SCHEMA_VERSION, t: "hitl_pause", run_id: runId, at: at ?? nowIso() });
-		return this.get(runId) ?? this.missing(runId);
+		return this.get(runId) && this.missing(runId);
 	}
 
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] BlockStatement
src/store.ts:393:46
 		return this.get(runId) ?? this.missing(runId);
 	}
 
-	resumeHitl(runId: string, at?: string): Run {
-		this.append({ v: SCHEMA_VERSION, t: "hitl_resume", run_id: runId, at: at ?? nowIso() });
-		return this.get(runId) ?? this.missing(runId);
-	}
+	resumeHitl(runId: string, at?: string): Run {}
 
 	setMode(runId: string, mode: Mode): Run {
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] LogicalOperator
src/store.ts:394:73
 	}
 
 	resumeHitl(runId: string, at?: string): Run {
-		this.append({ v: SCHEMA_VERSION, t: "hitl_resume", run_id: runId, at: at ?? nowIso() });
+		this.append({ v: SCHEMA_VERSION, t: "hitl_resume", run_id: runId, at: at && nowIso() });
 		return this.get(runId) ?? this.missing(runId);
 	}
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] LogicalOperator
src/store.ts:395:10
 
 	resumeHitl(runId: string, at?: string): Run {
 		this.append({ v: SCHEMA_VERSION, t: "hitl_resume", run_id: runId, at: at ?? nowIso() });
-		return this.get(runId) ?? this.missing(runId);
+		return this.get(runId) && this.missing(runId);
 	}
 
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] BlockStatement
src/store.ts:398:42
 		return this.get(runId) ?? this.missing(runId);
 	}
 
-	setMode(runId: string, mode: Mode): Run {
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "mode",
-			run_id: runId,
-			at: nowIso(),
-			mode,
-		});
-		return this.get(runId) ?? this.missing(runId);
-	}
+	setMode(runId: string, mode: Mode): Run {}
 
 	/**
killedBy: test/store.test.ts
statusReason: mode switch full → hitl: mode switch full → hitl

[Killed] BlockStatement
src/store.ts:414:55
 	 * and `models` split on it — so a run labelled `unknown` is a run that cannot be
 	 * compared against anything.
 	 */
-	setHost(runId: string, host: Host, at?: string): Run {
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "host",
-			run_id: runId,
-			at: at ?? nowIso(),
-			host,
-		});
-		return this.get(runId) ?? this.missing(runId);
-	}
+	setHost(runId: string, host: Host, at?: string): Run {}
 
 	setKind(runId: string, kind: Kind, at?: string): Run {
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness
