[Killed] StringLiteral
src/store.ts:417:7
 	setHost(runId: string, host: Host, at?: string): Run {
 		this.append({
 			v: SCHEMA_VERSION,
-			t: "host",
+			t: "",
 			run_id: runId,
 			at: at ?? nowIso(),
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness

[Killed] BlockStatement
src/store.ts:425:55
 		return this.get(runId) ?? this.missing(runId);
 	}
 
-	setKind(runId: string, kind: Kind, at?: string): Run {
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "kind",
-			run_id: runId,
-			at: at ?? nowIso(),
-			kind,
-		});
-		return this.get(runId) ?? this.missing(runId);
-	}
+	setKind(runId: string, kind: Kind, at?: string): Run {}
 
 	setCraftVersion(
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Killed] ObjectLiteral
src/store.ts:426:15
 	}
 
 	setKind(runId: string, kind: Kind, at?: string): Run {
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "kind",
-			run_id: runId,
-			at: at ?? nowIso(),
-			kind,
-		});
+		this.append({});
 		return this.get(runId) ?? this.missing(runId);
 	}
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Killed] StringLiteral
src/store.ts:428:7
 	setKind(runId: string, kind: Kind, at?: string): Run {
 		this.append({
 			v: SCHEMA_VERSION,
-			t: "kind",
+			t: "",
 			run_id: runId,
 			at: at ?? nowIso(),
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[NoCoverage] StringLiteral
src/store.ts:439:37
 	setCraftVersion(
 		runId: string,
 		craft_version: string,
-		source: "declared" | "inferred" = "declared",
+		source: "declared" | "inferred" = "",
 		at?: string,
 	): Run {

[Killed] BlockStatement
src/store.ts:441:9
 		craft_version: string,
 		source: "declared" | "inferred" = "declared",
 		at?: string,
-	): Run {
-		this.append({
-			v: SCHEMA_VERSION,
-			t: "craft_version",
-			run_id: runId,
-			at: at ?? nowIso(),
-			craft_version,
-			source,
-		});
-		return this.get(runId) ?? this.missing(runId);
-	}
+	): Run {}
 
 	latestOpenForCwd(cwd: string): Run | undefined {
killedBy: test/store.test.ts
statusReason: a version declared after the run was already opened is backfilled: a version declared after the run was already opened is backfilled

[Killed] BlockStatement
src/store.ts:453:49
 		return this.get(runId) ?? this.missing(runId);
 	}
 
-	latestOpenForCwd(cwd: string): Run | undefined {
-		const id = this.readSidecar()[cwd];
-		if (id) {
-			const run = this.get(id);
-			if (run && run.outcome === "open") return run;
-		}
-		return this.loadAll()
-			.filter((r) => r.cwd === cwd && r.outcome === "open")
-			.at(-1);
-	}
+	latestOpenForCwd(cwd: string): Run | undefined {}
 
 	require(runId: string): Run {
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Survived] ConditionalExpression
src/store.ts:455:7
 
 	latestOpenForCwd(cwd: string): Run | undefined {
 		const id = this.readSidecar()[cwd];
-		if (id) {
+		if (false) {
 			const run = this.get(id);
 			if (run && run.outcome === "open") return run;

[Survived] ConditionalExpression
src/store.ts:455:7
 
 	latestOpenForCwd(cwd: string): Run | undefined {
 		const id = this.readSidecar()[cwd];
-		if (id) {
+		if (true) {
 			const run = this.get(id);
 			if (run && run.outcome === "open") return run;

[Survived] ConditionalExpression
src/store.ts:457:8
 		const id = this.readSidecar()[cwd];
 		if (id) {
 			const run = this.get(id);
-			if (run && run.outcome === "open") return run;
+			if (true) return run;
 		}
 		return this.loadAll()

[Survived] ConditionalExpression
src/store.ts:457:8
 		const id = this.readSidecar()[cwd];
 		if (id) {
 			const run = this.get(id);
-			if (run && run.outcome === "open") return run;
+			if (false) return run;
 		}
 		return this.loadAll()

[Killed] MethodExpression
src/store.ts:459:10
 			const run = this.get(id);
 			if (run && run.outcome === "open") return run;
 		}
-		return this.loadAll()
-			.filter((r) => r.cwd === cwd && r.outcome === "open")
+		return this.loadAll()
 			.at(-1);
 	}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] EqualityOperator
src/store.ts:460:19
 			if (run && run.outcome === "open") return run;
 		}
 		return this.loadAll()
-			.filter((r) => r.cwd === cwd && r.outcome === "open")
+			.filter((r) => r.cwd !== cwd && r.outcome === "open")
 			.at(-1);
 	}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Killed] LogicalOperator
src/store.ts:460:19
 			if (run && run.outcome === "open") return run;
 		}
 		return this.loadAll()
-			.filter((r) => r.cwd === cwd && r.outcome === "open")
+			.filter((r) => r.cwd === cwd || r.outcome === "open")
 			.at(-1);
 	}
killedBy: test/store.test.ts
statusReason: openPhase reads the current gate without folding the log: openPhase reads the current gate without folding the log

[Survived] UnaryOperator
src/store.ts:461:8
 		}
 		return this.loadAll()
 			.filter((r) => r.cwd === cwd && r.outcome === "open")
-			.at(-1);
+			.at(+1);
 	}
 

[Killed] BlockStatement
src/store.ts:464:30
 			.at(-1);
 	}
 
-	require(runId: string): Run {
-		return this.get(runId) ?? this.missing(runId);
-	}
+	require(runId: string): Run {}
 
 	missing(runId: string): never {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] LogicalOperator
src/store.ts:465:10
 	}
 
 	require(runId: string): Run {
-		return this.get(runId) ?? this.missing(runId);
+		return this.get(runId) && this.missing(runId);
 	}
 
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:468:32
 		return this.get(runId) ?? this.missing(runId);
 	}
 
-	missing(runId: string): never {
-		throw new Error(`unknown run ${runId}`);
-	}
+	missing(runId: string): never {}
 }
 
killedBy: test/cli.test.ts
statusReason: run turns an unexpected store error into exit 2 rather than a stack trace: run turns an unexpected store error into exit 2 rather than a stack trace

[Killed] BlockStatement
src/store.ts:478:60
  * folded. Mode decides where usage lands, so resolving it up front is what lets
  * a later `mode` correction move cost that was already recorded.
  */
-function finalModes(events: LogEvent[]): Map<string, Mode> {
-	const modes = new Map<string, Mode>();
-	for (const ev of events) {
-		if (ev.t === "run_open" || ev.t === "mode") modes.set(ev.run_id, ev.mode);
-	}
-	return modes;
-}
+function finalModes(events: LogEvent[]): Map<string, Mode> {}
 
 function fold(byId: Map<string, Run>, ev: LogEvent, finalMode?: Map<string, Mode>): void {
killedBy: test/store.test.ts
statusReason: switching a run to dag moves its already-recorded cost to supervisor: switching a run to dag moves its already-recorded cost to supervisor

[Killed] BlockStatement
src/store.ts:480:27
  */
 function finalModes(events: LogEvent[]): Map<string, Mode> {
 	const modes = new Map<string, Mode>();
-	for (const ev of events) {
-		if (ev.t === "run_open" || ev.t === "mode") modes.set(ev.run_id, ev.mode);
-	}
+	for (const ev of events) {}
 	return modes;
 }
killedBy: test/store.test.ts
statusReason: switching a run to dag moves its already-recorded cost to supervisor: switching a run to dag moves its already-recorded cost to supervisor

[Killed] EqualityOperator
src/store.ts:481:30
 function finalModes(events: LogEvent[]): Map<string, Mode> {
 	const modes = new Map<string, Mode>();
 	for (const ev of events) {
-		if (ev.t === "run_open" || ev.t === "mode") modes.set(ev.run_id, ev.mode);
+		if (ev.t === "run_open" || ev.t !== "mode") modes.set(ev.run_id, ev.mode);
 	}
 	return modes;
killedBy: test/store.test.ts
statusReason: switching a run to dag moves its already-recorded cost to supervisor: switching a run to dag moves its already-recorded cost to supervisor

[Killed] ConditionalExpression
src/store.ts:481:30
 function finalModes(events: LogEvent[]): Map<string, Mode> {
 	const modes = new Map<string, Mode>();
 	for (const ev of events) {
-		if (ev.t === "run_open" || ev.t === "mode") modes.set(ev.run_id, ev.mode);
+		if (ev.t === "run_open" || false) modes.set(ev.run_id, ev.mode);
 	}
 	return modes;
killedBy: test/store.test.ts
statusReason: switching a run to dag moves its already-recorded cost to supervisor: switching a run to dag moves its already-recorded cost to supervisor

[Killed] ConditionalExpression
src/store.ts:487:6
 }
 
 function fold(byId: Map<string, Run>, ev: LogEvent, finalMode?: Map<string, Mode>): void {
-	if (ev.t === "run_open") {
+	if (true) {
 		if (byId.has(ev.run_id)) return;
 		byId.set(ev.run_id, {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:487:6
 }
 
 function fold(byId: Map<string, Run>, ev: LogEvent, finalMode?: Map<string, Mode>): void {
-	if (ev.t === "run_open") {
+	if (false) {
 		if (byId.has(ev.run_id)) return;
 		byId.set(ev.run_id, {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:488:7
 
 function fold(byId: Map<string, Run>, ev: LogEvent, finalMode?: Map<string, Mode>): void {
 	if (ev.t === "run_open") {
-		if (byId.has(ev.run_id)) return;
+		if (true) return;
 		byId.set(ev.run_id, {
 			schema_version: SCHEMA_VERSION,
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Survived] ConditionalExpression
src/store.ts:488:7
 
 function fold(byId: Map<string, Run>, ev: LogEvent, finalMode?: Map<string, Mode>): void {
 	if (ev.t === "run_open") {
-		if (byId.has(ev.run_id)) return;
+		if (false) return;
 		byId.set(ev.run_id, {
 			schema_version: SCHEMA_VERSION,

[Killed] LogicalOperator
src/store.ts:498:10
 			cwd: ev.cwd,
 			repo: ev.repo,
 			// The run's eventual mode, not the one declared at open. See `finalModes`.
-			mode: finalMode?.get(ev.run_id) ?? ev.mode,
+			mode: finalMode?.get(ev.run_id) && ev.mode,
 			kind: ev.kind,
 			craft_version: ev.craft_version,
killedBy: test/store.test.ts
statusReason: switching a run to dag moves its already-recorded cost to supervisor: switching a run to dag moves its already-recorded cost to supervisor

[Survived] OptionalChaining
src/store.ts:498:10
 			cwd: ev.cwd,
 			repo: ev.repo,
 			// The run's eventual mode, not the one declared at open. See `finalModes`.
-			mode: finalMode?.get(ev.run_id) ?? ev.mode,
+			mode: finalMode.get(ev.run_id) ?? ev.mode,
 			kind: ev.kind,
 			craft_version: ev.craft_version,

[Killed] StringLiteral
src/store.ts:502:13
 			kind: ev.kind,
 			craft_version: ev.craft_version,
 			craft_version_source: ev.craft_version ? "declared" : undefined,
-			outcome: "open",
+			outcome: "",
 			open_phase: null,
 			phase_entries: 0,
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Killed] ConditionalExpression
src/store.ts:516:6
 		return;
 	}
 	const run = byId.get(ev.run_id);
-	if (!run) return;
+	if (true) return;
 
 	switch (ev.t) {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BooleanLiteral
src/store.ts:516:6
 		return;
 	}
 	const run = byId.get(ev.run_id);
-	if (!run) return;
+	if (run) return;
 
 	switch (ev.t) {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:519:3
 	if (!run) return;
 
 	switch (ev.t) {
-		case "phase_enter": {
-			if (run.open_phase && run.open_phase !== ev.phase) closePhase(run, run.open_phase, ev.at);
-			const p = phaseByName(run, ev.phase);
-			if (!p.started_at) p.started_at = ev.at;
-			p.ended_at = null;
-			pushUnique(p.agents, ev.agent);
-			if (ev.agent) p.agent = ev.agent;
-			p.cycles = (p.cycles ?? 0) + 1;
-			run.open_phase = ev.phase;
-			run.phase_entries += 1;
-			run.seams = computeSeams(run);
-			return;
-		}
+		case "phase_enter":
 		case "phase_exit": {
 			const p = closePhase(run, ev.phase, ev.at);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:519:23
 	if (!run) return;
 
 	switch (ev.t) {
-		case "phase_enter": {
-			if (run.open_phase && run.open_phase !== ev.phase) closePhase(run, run.open_phase, ev.at);
-			const p = phaseByName(run, ev.phase);
-			if (!p.started_at) p.started_at = ev.at;
-			p.ended_at = null;
-			pushUnique(p.agents, ev.agent);
-			if (ev.agent) p.agent = ev.agent;
-			p.cycles = (p.cycles ?? 0) + 1;
-			run.open_phase = ev.phase;
-			run.phase_entries += 1;
-			run.seams = computeSeams(run);
-			return;
-		}
+		case "phase_enter": {}
 		case "phase_exit": {
 			const p = closePhase(run, ev.phase, ev.at);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:520:8
 
 	switch (ev.t) {
 		case "phase_enter": {
-			if (run.open_phase && run.open_phase !== ev.phase) closePhase(run, run.open_phase, ev.at);
+			if (true) closePhase(run, run.open_phase, ev.at);
 			const p = phaseByName(run, ev.phase);
 			if (!p.started_at) p.started_at = ev.at;
killedBy: test/store.test.ts
statusReason: R records decision counts and deviations surface in the summary: R records decision counts and deviations surface in the summary

[Killed] EqualityOperator
src/store.ts:520:26
 
 	switch (ev.t) {
 		case "phase_enter": {
-			if (run.open_phase && run.open_phase !== ev.phase) closePhase(run, run.open_phase, ev.at);
+			if (run.open_phase && run.open_phase === ev.phase) closePhase(run, run.open_phase, ev.at);
 			const p = phaseByName(run, ev.phase);
 			if (!p.started_at) p.started_at = ev.at;
killedBy: test/store.test.ts
statusReason: entering a new phase closes the previous one: entering a new phase closes the previous one

[Killed] BooleanLiteral
src/store.ts:522:8
 		case "phase_enter": {
 			if (run.open_phase && run.open_phase !== ev.phase) closePhase(run, run.open_phase, ev.at);
 			const p = phaseByName(run, ev.phase);
-			if (!p.started_at) p.started_at = ev.at;
+			if (p.started_at) p.started_at = ev.at;
 			p.ended_at = null;
 			pushUnique(p.agents, ev.agent);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:522:8
 		case "phase_enter": {
 			if (run.open_phase && run.open_phase !== ev.phase) closePhase(run, run.open_phase, ev.at);
 			const p = phaseByName(run, ev.phase);
-			if (!p.started_at) p.started_at = ev.at;
+			if (false) p.started_at = ev.at;
 			p.ended_at = null;
 			pushUnique(p.agents, ev.agent);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Survived] CallExpression
src/store.ts:524:4
 			const p = phaseByName(run, ev.phase);
 			if (!p.started_at) p.started_at = ev.at;
 			p.ended_at = null;
-			pushUnique(p.agents, ev.agent);
+			;
 			if (ev.agent) p.agent = ev.agent;
 			p.cycles = (p.cycles ?? 0) + 1;

[Survived] ConditionalExpression
src/store.ts:525:8
 			if (!p.started_at) p.started_at = ev.at;
 			p.ended_at = null;
 			pushUnique(p.agents, ev.agent);
-			if (ev.agent) p.agent = ev.agent;
+			if (false) p.agent = ev.agent;
 			p.cycles = (p.cycles ?? 0) + 1;
 			run.open_phase = ev.phase;

[Survived] ConditionalExpression
src/store.ts:525:8
 			if (!p.started_at) p.started_at = ev.at;
 			p.ended_at = null;
 			pushUnique(p.agents, ev.agent);
-			if (ev.agent) p.agent = ev.agent;
+			if (true) p.agent = ev.agent;
 			p.cycles = (p.cycles ?? 0) + 1;
 			run.open_phase = ev.phase;

[Killed] LogicalOperator
src/store.ts:526:16
 			p.ended_at = null;
 			pushUnique(p.agents, ev.agent);
 			if (ev.agent) p.agent = ev.agent;
-			p.cycles = (p.cycles ?? 0) + 1;
+			p.cycles = (p.cycles && 0) + 1;
 			run.open_phase = ev.phase;
 			run.phase_entries += 1;
killedBy: test/store-format.test.ts
statusReason: a phase that failed and was re-reviewed keeps its cycle count and total findings: a phase that failed and was re-reviewed keeps its cycle count and total findings

[Killed] ArithmeticOperator
src/store.ts:526:15
 			p.ended_at = null;
 			pushUnique(p.agents, ev.agent);
 			if (ev.agent) p.agent = ev.agent;
-			p.cycles = (p.cycles ?? 0) + 1;
+			p.cycles = (p.cycles ?? 0) - 1;
 			run.open_phase = ev.phase;
 			run.phase_entries += 1;
killedBy: test/store-format.test.ts
statusReason: a phase that failed and was re-reviewed keeps its cycle count and total findings: a phase that failed and was re-reviewed keeps its cycle count and total findings

[Killed] AssignmentOperator
src/store.ts:528:4
 			if (ev.agent) p.agent = ev.agent;
 			p.cycles = (p.cycles ?? 0) + 1;
 			run.open_phase = ev.phase;
-			run.phase_entries += 1;
+			run.phase_entries -= 1;
 			run.seams = computeSeams(run);
 			return;
killedBy: test/store.test.ts
statusReason: doctor flags a run that was started but never gated: doctor flags a run that was started but never gated

[Killed] ConditionalExpression
src/store.ts:532:3
 			run.seams = computeSeams(run);
 			return;
 		}
-		case "phase_exit": {
-			const p = closePhase(run, ev.phase, ev.at);
-			// Accumulate before assigning: `Object.assign` overwrites, so a phase that
-			// failed, was fixed, and passed would otherwise fold to a clean pass and
-			// erase every finding that caused the loop.
-			if (ev.fields?.blocking_findings) {
-				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
-			}
-			if (ev.fields) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
-			if (run.open_phase === ev.phase) run.open_phase = null;
-			run.seams = computeSeams(run);
-			return;
-		}
+		case "phase_exit":
 		case "usage": {
 			const { phase, how } = resolvePhase(run, ev);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:532:22
 			run.seams = computeSeams(run);
 			return;
 		}
-		case "phase_exit": {
-			const p = closePhase(run, ev.phase, ev.at);
-			// Accumulate before assigning: `Object.assign` overwrites, so a phase that
-			// failed, was fixed, and passed would otherwise fold to a clean pass and
-			// erase every finding that caused the loop.
-			if (ev.fields?.blocking_findings) {
-				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
-			}
-			if (ev.fields) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
-			if (run.open_phase === ev.phase) run.open_phase = null;
-			run.seams = computeSeams(run);
-			return;
-		}
+		case "phase_exit": {}
 		case "usage": {
 			const { phase, how } = resolvePhase(run, ev);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:537:8
 			// Accumulate before assigning: `Object.assign` overwrites, so a phase that
 			// failed, was fixed, and passed would otherwise fold to a clean pass and
 			// erase every finding that caused the loop.
-			if (ev.fields?.blocking_findings) {
+			if (false) {
 				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
 			}
killedBy: test/store-format.test.ts
statusReason: a phase that failed and was re-reviewed keeps its cycle count and total findings: a phase that failed and was re-reviewed keeps its cycle count and total findings

[Killed] BlockStatement
src/store.ts:537:38
 			// Accumulate before assigning: `Object.assign` overwrites, so a phase that
 			// failed, was fixed, and passed would otherwise fold to a clean pass and
 			// erase every finding that caused the loop.
-			if (ev.fields?.blocking_findings) {
-				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
-			}
+			if (ev.fields?.blocking_findings) {}
 			if (ev.fields) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
 			if (run.open_phase === ev.phase) run.open_phase = null;
killedBy: test/store-format.test.ts
statusReason: a phase that failed and was re-reviewed keeps its cycle count and total findings: a phase that failed and was re-reviewed keeps its cycle count and total findings

[Killed] ArithmeticOperator
src/store.ts:538:33
 			// failed, was fixed, and passed would otherwise fold to a clean pass and
 			// erase every finding that caused the loop.
 			if (ev.fields?.blocking_findings) {
-				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
+				p.blocking_findings_total = (p.blocking_findings_total ?? 0) - ev.fields.blocking_findings;
 			}
 			if (ev.fields) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
killedBy: test/store-format.test.ts
statusReason: a phase that failed and was re-reviewed keeps its cycle count and total findings: a phase that failed and was re-reviewed keeps its cycle count and total findings

[Killed] LogicalOperator
src/store.ts:538:34
 			// failed, was fixed, and passed would otherwise fold to a clean pass and
 			// erase every finding that caused the loop.
 			if (ev.fields?.blocking_findings) {
-				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
+				p.blocking_findings_total = (p.blocking_findings_total && 0) + ev.fields.blocking_findings;
 			}
 			if (ev.fields) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
killedBy: test/store-format.test.ts
statusReason: a phase that failed and was re-reviewed keeps its cycle count and total findings: a phase that failed and was re-reviewed keeps its cycle count and total findings

[Killed] ConditionalExpression
src/store.ts:540:8
 			if (ev.fields?.blocking_findings) {
 				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
 			}
-			if (ev.fields) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
+			if (false) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
 			if (run.open_phase === ev.phase) run.open_phase = null;
 			run.seams = computeSeams(run);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] CallExpression
src/store.ts:540:19
 			if (ev.fields?.blocking_findings) {
 				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
 			}
-			if (ev.fields) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
+			if (ev.fields) ;
 			if (run.open_phase === ev.phase) run.open_phase = null;
 			run.seams = computeSeams(run);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] EqualityOperator
src/store.ts:541:8
 				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
 			}
 			if (ev.fields) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
-			if (run.open_phase === ev.phase) run.open_phase = null;
+			if (run.open_phase !== ev.phase) run.open_phase = null;
 			run.seams = computeSeams(run);
 			return;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:541:8
 				p.blocking_findings_total = (p.blocking_findings_total ?? 0) + ev.fields.blocking_findings;
 			}
 			if (ev.fields) Object.assign(p, stripUndefined(normalizeFields(ev.fields)));
-			if (run.open_phase === ev.phase) run.open_phase = null;
+			if (false) run.open_phase = null;
 			run.seams = computeSeams(run);
 			return;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:545:17
 			run.seams = computeSeams(run);
 			return;
 		}
-		case "usage": {
-			const { phase, how } = resolvePhase(run, ev);
-			applyUsage(phase, ev, how);
-			run.seams = computeSeams(run);
-			return;
-		}
+		case "usage": {}
 		case "verify": {
 			run.last_verify = { command: ev.command, exit_code: ev.exit_code, at: ev.at, phase: ev.phase };
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:545:3
 			run.seams = computeSeams(run);
 			return;
 		}
-		case "usage": {
-			const { phase, how } = resolvePhase(run, ev);
-			applyUsage(phase, ev, how);
-			run.seams = computeSeams(run);
-			return;
-		}
+		case "usage":
 		case "verify": {
 			run.last_verify = { command: ev.command, exit_code: ev.exit_code, at: ev.at, phase: ev.phase };
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] CallExpression
src/store.ts:547:4
 		}
 		case "usage": {
 			const { phase, how } = resolvePhase(run, ev);
-			applyUsage(phase, ev, how);
+			;
 			run.seams = computeSeams(run);
 			return;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:551:18
 			run.seams = computeSeams(run);
 			return;
 		}
-		case "verify": {
-			run.last_verify = { command: ev.command, exit_code: ev.exit_code, at: ev.at, phase: ev.phase };
-			run.verify_count += 1;
-			const target = ev.phase ?? run.open_phase;
-			if (target) {
-				const p = phaseByName(run, target);
-				p.verify_runs += 1;
-				if (ev.exit_code !== 0) p.verify_failures += 1;
-			}
-			return;
-		}
+		case "verify": {}
 		case "hitl_pause":
 			run.hitl.paused_at = ev.at;
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run

[Killed] ConditionalExpression
src/store.ts:551:3
 			run.seams = computeSeams(run);
 			return;
 		}
-		case "verify": {
-			run.last_verify = { command: ev.command, exit_code: ev.exit_code, at: ev.at, phase: ev.phase };
-			run.verify_count += 1;
-			const target = ev.phase ?? run.open_phase;
-			if (target) {
-				const p = phaseByName(run, target);
-				p.verify_runs += 1;
-				if (ev.exit_code !== 0) p.verify_failures += 1;
-			}
-			return;
-		}
+		case "verify":
 		case "hitl_pause":
 			run.hitl.paused_at = ev.at;
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run

[Killed] ObjectLiteral
src/store.ts:552:22
 			return;
 		}
 		case "verify": {
-			run.last_verify = { command: ev.command, exit_code: ev.exit_code, at: ev.at, phase: ev.phase };
+			run.last_verify = {};
 			run.verify_count += 1;
 			const target = ev.phase ?? run.open_phase;
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run

[Killed] AssignmentOperator
src/store.ts:553:4
 		}
 		case "verify": {
 			run.last_verify = { command: ev.command, exit_code: ev.exit_code, at: ev.at, phase: ev.phase };
-			run.verify_count += 1;
+			run.verify_count -= 1;
 			const target = ev.phase ?? run.open_phase;
 			if (target) {
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run

[Survived] LogicalOperator
src/store.ts:554:19
 		case "verify": {
 			run.last_verify = { command: ev.command, exit_code: ev.exit_code, at: ev.at, phase: ev.phase };
 			run.verify_count += 1;
-			const target = ev.phase ?? run.open_phase;
+			const target = ev.phase && run.open_phase;
 			if (target) {
 				const p = phaseByName(run, target);

[Killed] ConditionalExpression
src/store.ts:555:8
 			run.last_verify = { command: ev.command, exit_code: ev.exit_code, at: ev.at, phase: ev.phase };
 			run.verify_count += 1;
 			const target = ev.phase ?? run.open_phase;
-			if (target) {
+			if (true) {
 				const p = phaseByName(run, target);
 				p.verify_runs += 1;
killedBy: test/store-format.test.ts
statusReason: verify state renders green or red with the command and a count: verify state renders green or red with the command and a count

[Killed] ConditionalExpression
src/store.ts:555:8
 			run.last_verify = { command: ev.command, exit_code: ev.exit_code, at: ev.at, phase: ev.phase };
 			run.verify_count += 1;
 			const target = ev.phase ?? run.open_phase;
-			if (target) {
+			if (false) {
 				const p = phaseByName(run, target);
 				p.verify_runs += 1;
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run
