[Killed] AssignmentOperator
src/store.ts:557:5
 			const target = ev.phase ?? run.open_phase;
 			if (target) {
 				const p = phaseByName(run, target);
-				p.verify_runs += 1;
+				p.verify_runs -= 1;
 				if (ev.exit_code !== 0) p.verify_failures += 1;
 			}
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run

[Killed] ConditionalExpression
src/store.ts:558:9
 			if (target) {
 				const p = phaseByName(run, target);
 				p.verify_runs += 1;
-				if (ev.exit_code !== 0) p.verify_failures += 1;
+				if (false) p.verify_failures += 1;
 			}
 			return;
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run

[Killed] AssignmentOperator
src/store.ts:558:29
 			if (target) {
 				const p = phaseByName(run, target);
 				p.verify_runs += 1;
-				if (ev.exit_code !== 0) p.verify_failures += 1;
+				if (ev.exit_code !== 0) p.verify_failures -= 1;
 			}
 			return;
killedBy: test/store.test.ts
statusReason: verify result lands on the open phase and on the run: verify result lands on the open phase and on the run

[Killed] ConditionalExpression
src/store.ts:562:3
 			}
 			return;
 		}
-		case "hitl_pause":
-			run.hitl.paused_at = ev.at;
-			run.outcome = "hitl-paused";
-			return;
+		case "hitl_pause":
 		case "hitl_resume":
 			run.hitl.resumed_at = ev.at;
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] StringLiteral
src/store.ts:564:18
 		}
 		case "hitl_pause":
 			run.hitl.paused_at = ev.at;
-			run.outcome = "hitl-paused";
+			run.outcome = "";
 			return;
 		case "hitl_resume":
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] ConditionalExpression
src/store.ts:566:3
 			run.hitl.paused_at = ev.at;
 			run.outcome = "hitl-paused";
 			return;
-		case "hitl_resume":
-			run.hitl.resumed_at = ev.at;
-			if (run.hitl.paused_at) {
-				run.hitl.pause_ms += Date.parse(ev.at) - Date.parse(run.hitl.paused_at);
-			}
-			if (run.outcome === "hitl-paused") run.outcome = "open";
-			return;
+		case "hitl_resume":
 		case "mode":
 			run.mode = ev.mode;
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] StringLiteral
src/store.ts:566:8
 			run.hitl.paused_at = ev.at;
 			run.outcome = "hitl-paused";
 			return;
-		case "hitl_resume":
+		case "":
 			run.hitl.resumed_at = ev.at;
 			if (run.hitl.paused_at) {
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] ConditionalExpression
src/store.ts:568:8
 			return;
 		case "hitl_resume":
 			run.hitl.resumed_at = ev.at;
-			if (run.hitl.paused_at) {
+			if (false) {
 				run.hitl.pause_ms += Date.parse(ev.at) - Date.parse(run.hitl.paused_at);
 			}
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] BlockStatement
src/store.ts:568:28
 			return;
 		case "hitl_resume":
 			run.hitl.resumed_at = ev.at;
-			if (run.hitl.paused_at) {
-				run.hitl.pause_ms += Date.parse(ev.at) - Date.parse(run.hitl.paused_at);
-			}
+			if (run.hitl.paused_at) {}
 			if (run.outcome === "hitl-paused") run.outcome = "open";
 			return;
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] ArithmeticOperator
src/store.ts:569:26
 		case "hitl_resume":
 			run.hitl.resumed_at = ev.at;
 			if (run.hitl.paused_at) {
-				run.hitl.pause_ms += Date.parse(ev.at) - Date.parse(run.hitl.paused_at);
+				run.hitl.pause_ms += Date.parse(ev.at) + Date.parse(run.hitl.paused_at);
 			}
 			if (run.outcome === "hitl-paused") run.outcome = "open";
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] AssignmentOperator
src/store.ts:569:5
 		case "hitl_resume":
 			run.hitl.resumed_at = ev.at;
 			if (run.hitl.paused_at) {
-				run.hitl.pause_ms += Date.parse(ev.at) - Date.parse(run.hitl.paused_at);
+				run.hitl.pause_ms -= Date.parse(ev.at) - Date.parse(run.hitl.paused_at);
 			}
 			if (run.outcome === "hitl-paused") run.outcome = "open";
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] EqualityOperator
src/store.ts:571:8
 			if (run.hitl.paused_at) {
 				run.hitl.pause_ms += Date.parse(ev.at) - Date.parse(run.hitl.paused_at);
 			}
-			if (run.outcome === "hitl-paused") run.outcome = "open";
+			if (run.outcome !== "hitl-paused") run.outcome = "open";
 			return;
 		case "mode":
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Killed] ConditionalExpression
src/store.ts:571:8
 			if (run.hitl.paused_at) {
 				run.hitl.pause_ms += Date.parse(ev.at) - Date.parse(run.hitl.paused_at);
 			}
-			if (run.outcome === "hitl-paused") run.outcome = "open";
+			if (false) run.outcome = "open";
 			return;
 		case "mode":
killedBy: test/store.test.ts
statusReason: HITL pause accumulates wall time: HITL pause accumulates wall time

[Survived] ConditionalExpression
src/store.ts:573:3
 			}
 			if (run.outcome === "hitl-paused") run.outcome = "open";
 			return;
-		case "mode":
-			run.mode = ev.mode;
-			return;
+		case "mode":
 		case "kind":
 			run.kind = ev.kind;

[Survived] StringLiteral
src/store.ts:573:8
 			}
 			if (run.outcome === "hitl-paused") run.outcome = "open";
 			return;
-		case "mode":
+		case "":
 			run.mode = ev.mode;
 			return;

[Killed] ConditionalExpression
src/store.ts:576:3
 		case "mode":
 			run.mode = ev.mode;
 			return;
-		case "kind":
-			run.kind = ev.kind;
-			return;
+		case "kind":
+// Last write wins. Unlike `mode`, host does not route usage anywhere, so a
+// correction needs no pre-resolution pass to move cost already folded.
 		// Last write wins. Unlike `mode`, host does not route usage anywhere, so a
 		// correction needs no pre-resolution pass to move cost already folded.
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Killed] StringLiteral
src/store.ts:576:8
 		case "mode":
 			run.mode = ev.mode;
 			return;
-		case "kind":
+		case "":
 			run.kind = ev.kind;
 			return;
killedBy: test/store.test.ts
statusReason: kind is set on start and filled in on reuse if missing: kind is set on start and filled in on reuse if missing

[Killed] ConditionalExpression
src/store.ts:581:3
 			return;
 		// Last write wins. Unlike `mode`, host does not route usage anywhere, so a
 		// correction needs no pre-resolution pass to move cost already folded.
-		case "host":
-			run.host = ev.host;
-			return;
+		// Last write wins. Unlike `mode`, host does not route usage anywhere, so a
+// correction needs no pre-resolution pass to move cost already folded.
+case "host":
 		case "craft_version":
 			run.craft_version = ev.craft_version;
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness

[Killed] StringLiteral
src/store.ts:581:8
 			return;
 		// Last write wins. Unlike `mode`, host does not route usage anywhere, so a
 		// correction needs no pre-resolution pass to move cost already folded.
-		case "host":
+		case "":
 			run.host = ev.host;
 			return;
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness

[Killed] ConditionalExpression
src/store.ts:584:3
 		case "host":
 			run.host = ev.host;
 			return;
-		case "craft_version":
-			run.craft_version = ev.craft_version;
-			run.craft_version_source = ev.source ?? "declared";
-			return;
+		case "craft_version":
 		case "run_end":
 			if (run.open_phase) closePhase(run, run.open_phase, ev.at);
killedBy: test/store.test.ts
statusReason: a version declared after the run was already opened is backfilled: a version declared after the run was already opened is backfilled

[Killed] StringLiteral
src/store.ts:584:8
 		case "host":
 			run.host = ev.host;
 			return;
-		case "craft_version":
+		case "":
 			run.craft_version = ev.craft_version;
 			run.craft_version_source = ev.source ?? "declared";
killedBy: test/store.test.ts
statusReason: a version declared after the run was already opened is backfilled: a version declared after the run was already opened is backfilled

[Killed] LogicalOperator
src/store.ts:586:31
 			return;
 		case "craft_version":
 			run.craft_version = ev.craft_version;
-			run.craft_version_source = ev.source ?? "declared";
+			run.craft_version_source = ev.source && "declared";
 			return;
 		case "run_end":
killedBy: test/store.test.ts
statusReason: a persisted inference stays marked inferred, not laundered into a declaration: a persisted inference stays marked inferred, not laundered into a declaration

[Killed] ConditionalExpression
src/store.ts:588:3
 			run.craft_version = ev.craft_version;
 			run.craft_version_source = ev.source ?? "declared";
 			return;
-		case "run_end":
-			if (run.open_phase) closePhase(run, run.open_phase, ev.at);
-			run.ended_at = ev.at;
-			run.outcome = ev.outcome === "open" ? "completed" : ev.outcome;
-			run.open_phase = null;
-			run.seams = computeSeams(run);
-			return;
+		case "run_end":
 	}
 }
killedBy: test/store-format.test.ts
statusReason: summarize renders the run header with version, kind, mode and outcome: summarize renders the run header with version, kind, mode and outcome

[Killed] StringLiteral
src/store.ts:588:8
 			run.craft_version = ev.craft_version;
 			run.craft_version_source = ev.source ?? "declared";
 			return;
-		case "run_end":
+		case "":
 			if (run.open_phase) closePhase(run, run.open_phase, ev.at);
 			run.ended_at = ev.at;
killedBy: test/store-format.test.ts
statusReason: summarize renders the run header with version, kind, mode and outcome: summarize renders the run header with version, kind, mode and outcome

[Killed] ConditionalExpression
src/store.ts:589:8
 			run.craft_version_source = ev.source ?? "declared";
 			return;
 		case "run_end":
-			if (run.open_phase) closePhase(run, run.open_phase, ev.at);
+			if (true) closePhase(run, run.open_phase, ev.at);
 			run.ended_at = ev.at;
 			run.outcome = ev.outcome === "open" ? "completed" : ev.outcome;
killedBy: test/store-format.test.ts
statusReason: summarize renders the run header with version, kind, mode and outcome: summarize renders the run header with version, kind, mode and outcome

[Survived] ConditionalExpression
src/store.ts:589:8
 			run.craft_version_source = ev.source ?? "declared";
 			return;
 		case "run_end":
-			if (run.open_phase) closePhase(run, run.open_phase, ev.at);
+			if (false) closePhase(run, run.open_phase, ev.at);
 			run.ended_at = ev.at;
 			run.outcome = ev.outcome === "open" ? "completed" : ev.outcome;

[Survived] ConditionalExpression
src/store.ts:591:18
 		case "run_end":
 			if (run.open_phase) closePhase(run, run.open_phase, ev.at);
 			run.ended_at = ev.at;
-			run.outcome = ev.outcome === "open" ? "completed" : ev.outcome;
+			run.outcome = false ? "completed" : ev.outcome;
 			run.open_phase = null;
 			run.seams = computeSeams(run);

[Survived] ConditionalExpression
src/store.ts:591:18
 		case "run_end":
 			if (run.open_phase) closePhase(run, run.open_phase, ev.at);
 			run.ended_at = ev.at;
-			run.outcome = ev.outcome === "open" ? "completed" : ev.outcome;
+			run.outcome = true ? "completed" : ev.outcome;
 			run.open_phase = null;
 			run.seams = computeSeams(run);

[Killed] BlockStatement
src/store.ts:598:74
 	}
 }
 
-function closePhase(run: Run, phase: PhaseName, at: string): PhaseRecord {
-	const p = phaseByName(run, phase);
-	if (!p.started_at) p.started_at = at;
-	p.ended_at = at;
-	p.duration_ms = Math.max(0, Date.parse(at) - Date.parse(p.started_at));
-	run.last_closed_phase = phase;
-	run.last_closed_at = at;
-	return p;
-}
+function closePhase(run: Run, phase: PhaseName, at: string): PhaseRecord {}
 
 /**
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BooleanLiteral
src/store.ts:600:6
 
 function closePhase(run: Run, phase: PhaseName, at: string): PhaseRecord {
 	const p = phaseByName(run, phase);
-	if (!p.started_at) p.started_at = at;
+	if (p.started_at) p.started_at = at;
 	p.ended_at = at;
 	p.duration_ms = Math.max(0, Date.parse(at) - Date.parse(p.started_at));
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:600:6
 
 function closePhase(run: Run, phase: PhaseName, at: string): PhaseRecord {
 	const p = phaseByName(run, phase);
-	if (!p.started_at) p.started_at = at;
+	if (true) p.started_at = at;
 	p.ended_at = at;
 	p.duration_ms = Math.max(0, Date.parse(at) - Date.parse(p.started_at));
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] MethodExpression
src/store.ts:602:18
 	const p = phaseByName(run, phase);
 	if (!p.started_at) p.started_at = at;
 	p.ended_at = at;
-	p.duration_ms = Math.max(0, Date.parse(at) - Date.parse(p.started_at));
+	p.duration_ms = Math.min(0, Date.parse(at) - Date.parse(p.started_at));
 	run.last_closed_phase = phase;
 	run.last_closed_at = at;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ArithmeticOperator
src/store.ts:602:30
 	const p = phaseByName(run, phase);
 	if (!p.started_at) p.started_at = at;
 	p.ended_at = at;
-	p.duration_ms = Math.max(0, Date.parse(at) - Date.parse(p.started_at));
+	p.duration_ms = Math.max(0, Date.parse(at) + Date.parse(p.started_at));
 	run.last_closed_phase = phase;
 	run.last_closed_at = at;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/store.ts:616:91
  *   4. the phase that just closed, if a grace window is configured (off by default)
  *   5. nowhere — unattributed, and never folded into a real phase
  */
-function resolvePhase(run: Run, ev: UsageEvent): { phase: PhaseRecord; how: Attribution } {
-	if (ev.phase && ev.phase !== "unattributed") {
-		return { phase: phaseByName(run, ev.phase), how: "stamped" };
-	}
-	if (run.open_phase) return { phase: phaseByName(run, run.open_phase), how: "open-phase" };
-	if (ev.agent && AGENT_PHASE[ev.agent]) {
-		return { phase: phaseByName(run, AGENT_PHASE[ev.agent]), how: "agent-map" };
-	}
-	const window = backfillWindowMs();
-	if (window > 0 && run.last_closed_phase && run.last_closed_at && ev.at) {
-		const lag = Date.parse(ev.at) - Date.parse(run.last_closed_at);
-		if (lag >= 0 && lag <= window) {
-			return { phase: phaseByName(run, run.last_closed_phase), how: "backfilled" };
-		}
-	}
-	// A supervisor session legitimately has no phases — orchestration *is* its work.
-	// Bucket it as `supervisor` so DAG overhead is measurable against node cost,
-	// rather than orphaned into `unattributed` where it looks like a collection bug.
-	if (run.mode === "dag") return { phase: phaseByName(run, "supervisor"), how: "open-phase" };
-	return { phase: phaseByName(run, "unattributed"), how: "none" };
-}
+function resolvePhase(run: Run, ev: UsageEvent): { phase: PhaseRecord; how: Attribution } {}
 
 function applyUsage(phase: PhaseRecord, event: UsageEvent, how: Attribution = "none"): void {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] EqualityOperator
src/store.ts:617:18
  *   5. nowhere — unattributed, and never folded into a real phase
  */
 function resolvePhase(run: Run, ev: UsageEvent): { phase: PhaseRecord; how: Attribution } {
-	if (ev.phase && ev.phase !== "unattributed") {
+	if (ev.phase && ev.phase === "unattributed") {
 		return { phase: phaseByName(run, ev.phase), how: "stamped" };
 	}
killedBy: test/store.test.ts
statusReason: a stamped phase beats the phase that happens to be open: a stamped phase beats the phase that happens to be open

[Killed] ConditionalExpression
src/store.ts:617:6
  *   5. nowhere — unattributed, and never folded into a real phase
  */
 function resolvePhase(run: Run, ev: UsageEvent): { phase: PhaseRecord; how: Attribution } {
-	if (ev.phase && ev.phase !== "unattributed") {
+	if (true) {
 		return { phase: phaseByName(run, ev.phase), how: "stamped" };
 	}
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:620:6
 	if (ev.phase && ev.phase !== "unattributed") {
 		return { phase: phaseByName(run, ev.phase), how: "stamped" };
 	}
-	if (run.open_phase) return { phase: phaseByName(run, run.open_phase), how: "open-phase" };
+	if (true) return { phase: phaseByName(run, run.open_phase), how: "open-phase" };
 	if (ev.agent && AGENT_PHASE[ev.agent]) {
 		return { phase: phaseByName(run, AGENT_PHASE[ev.agent]), how: "agent-map" };
killedBy: test/store.test.ts
statusReason: usage with no open phase and no agent is unattributed: usage with no open phase and no agent is unattributed

[Killed] ConditionalExpression
src/store.ts:620:6
 	if (ev.phase && ev.phase !== "unattributed") {
 		return { phase: phaseByName(run, ev.phase), how: "stamped" };
 	}
-	if (run.open_phase) return { phase: phaseByName(run, run.open_phase), how: "open-phase" };
+	if (false) return { phase: phaseByName(run, run.open_phase), how: "open-phase" };
 	if (ev.agent && AGENT_PHASE[ev.agent]) {
 		return { phase: phaseByName(run, AGENT_PHASE[ev.agent]), how: "agent-map" };
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/store.ts:621:6
 		return { phase: phaseByName(run, ev.phase), how: "stamped" };
 	}
 	if (run.open_phase) return { phase: phaseByName(run, run.open_phase), how: "open-phase" };
-	if (ev.agent && AGENT_PHASE[ev.agent]) {
+	if (false) {
 		return { phase: phaseByName(run, AGENT_PHASE[ev.agent]), how: "agent-map" };
 	}
killedBy: test/store.test.ts
statusReason: named agent maps to phase when skill is late: named agent maps to phase when skill is late

[Killed] BlockStatement
src/store.ts:621:41
 		return { phase: phaseByName(run, ev.phase), how: "stamped" };
 	}
 	if (run.open_phase) return { phase: phaseByName(run, run.open_phase), how: "open-phase" };
-	if (ev.agent && AGENT_PHASE[ev.agent]) {
-		return { phase: phaseByName(run, AGENT_PHASE[ev.agent]), how: "agent-map" };
-	}
+	if (ev.agent && AGENT_PHASE[ev.agent]) {}
 	const window = backfillWindowMs();
 	if (window > 0 && run.last_closed_phase && run.last_closed_at && ev.at) {
killedBy: test/store.test.ts
statusReason: named agent maps to phase when skill is late: named agent maps to phase when skill is late

[Killed] EqualityOperator
src/store.ts:625:6
 		return { phase: phaseByName(run, AGENT_PHASE[ev.agent]), how: "agent-map" };
 	}
 	const window = backfillWindowMs();
-	if (window > 0 && run.last_closed_phase && run.last_closed_at && ev.at) {
+	if (window <= 0 && run.last_closed_phase && run.last_closed_at && ev.at) {
 		const lag = Date.parse(ev.at) - Date.parse(run.last_closed_at);
 		if (lag >= 0 && lag <= window) {
killedBy: test/store.test.ts
statusReason: backfill within the window is recorded and flagged as a guess: backfill within the window is recorded and flagged as a guess

[Killed] ConditionalExpression
src/store.ts:625:6
 		return { phase: phaseByName(run, AGENT_PHASE[ev.agent]), how: "agent-map" };
 	}
 	const window = backfillWindowMs();
-	if (window > 0 && run.last_closed_phase && run.last_closed_at && ev.at) {
+	if (true) {
 		const lag = Date.parse(ev.at) - Date.parse(run.last_closed_at);
 		if (lag >= 0 && lag <= window) {
killedBy: test/store-format.test.ts
statusReason: the unattributed complaint reports a share of total spend: the unattributed complaint reports a share of total spend

[Killed] ArithmeticOperator
src/store.ts:626:15
 	}
 	const window = backfillWindowMs();
 	if (window > 0 && run.last_closed_phase && run.last_closed_at && ev.at) {
-		const lag = Date.parse(ev.at) - Date.parse(run.last_closed_at);
+		const lag = Date.parse(ev.at) + Date.parse(run.last_closed_at);
 		if (lag >= 0 && lag <= window) {
 			return { phase: phaseByName(run, run.last_closed_phase), how: "backfilled" };
killedBy: test/store.test.ts
statusReason: backfill within the window is recorded and flagged as a guess: backfill within the window is recorded and flagged as a guess

[Killed] EqualityOperator
src/store.ts:627:19
 	const window = backfillWindowMs();
 	if (window > 0 && run.last_closed_phase && run.last_closed_at && ev.at) {
 		const lag = Date.parse(ev.at) - Date.parse(run.last_closed_at);
-		if (lag >= 0 && lag <= window) {
+		if (lag >= 0 && lag > window) {
 			return { phase: phaseByName(run, run.last_closed_phase), how: "backfilled" };
 		}
killedBy: test/store.test.ts
statusReason: backfill within the window is recorded and flagged as a guess: backfill within the window is recorded and flagged as a guess

[Killed] ConditionalExpression
src/store.ts:627:7
 	const window = backfillWindowMs();
 	if (window > 0 && run.last_closed_phase && run.last_closed_at && ev.at) {
 		const lag = Date.parse(ev.at) - Date.parse(run.last_closed_at);
-		if (lag >= 0 && lag <= window) {
+		if (false) {
 			return { phase: phaseByName(run, run.last_closed_phase), how: "backfilled" };
 		}
killedBy: test/store.test.ts
statusReason: backfill within the window is recorded and flagged as a guess: backfill within the window is recorded and flagged as a guess

[Killed] StringLiteral
src/store.ts:628:66
 	if (window > 0 && run.last_closed_phase && run.last_closed_at && ev.at) {
 		const lag = Date.parse(ev.at) - Date.parse(run.last_closed_at);
 		if (lag >= 0 && lag <= window) {
-			return { phase: phaseByName(run, run.last_closed_phase), how: "backfilled" };
+			return { phase: phaseByName(run, run.last_closed_phase), how: "" };
 		}
 	}
killedBy: test/store.test.ts
statusReason: backfill within the window is recorded and flagged as a guess: backfill within the window is recorded and flagged as a guess

[Killed] ConditionalExpression
src/store.ts:634:6
 	// A supervisor session legitimately has no phases — orchestration *is* its work.
 	// Bucket it as `supervisor` so DAG overhead is measurable against node cost,
 	// rather than orphaned into `unattributed` where it looks like a collection bug.
-	if (run.mode === "dag") return { phase: phaseByName(run, "supervisor"), how: "open-phase" };
+	if (true) return { phase: phaseByName(run, "supervisor"), how: "open-phase" };
 	return { phase: phaseByName(run, "unattributed"), how: "none" };
 }
killedBy: test/store.test.ts
statusReason: usage with no open phase and no agent is unattributed: usage with no open phase and no agent is unattributed

[Killed] EqualityOperator
src/store.ts:634:6
 	// A supervisor session legitimately has no phases — orchestration *is* its work.
 	// Bucket it as `supervisor` so DAG overhead is measurable against node cost,
 	// rather than orphaned into `unattributed` where it looks like a collection bug.
-	if (run.mode === "dag") return { phase: phaseByName(run, "supervisor"), how: "open-phase" };
+	if (run.mode !== "dag") return { phase: phaseByName(run, "supervisor"), how: "open-phase" };
 	return { phase: phaseByName(run, "unattributed"), how: "none" };
 }
killedBy: test/store.test.ts
statusReason: usage with no open phase and no agent is unattributed: usage with no open phase and no agent is unattributed

[Survived] CallExpression
src/store.ts:639:2
 }
 
 function applyUsage(phase: PhaseRecord, event: UsageEvent, how: Attribution = "none"): void {
-	pushUnique(phase.agents, event.agent);
+	;
 	if (event.agent && !phase.agent) phase.agent = event.agent;
 	pushUnique(phase.models, event.model);

[Survived] ConditionalExpression
src/store.ts:640:6
 
 function applyUsage(phase: PhaseRecord, event: UsageEvent, how: Attribution = "none"): void {
 	pushUnique(phase.agents, event.agent);
-	if (event.agent && !phase.agent) phase.agent = event.agent;
+	if (true) phase.agent = event.agent;
 	pushUnique(phase.models, event.model);
 	if (event.model) phase.model = event.model;

[Survived] LogicalOperator
src/store.ts:640:6
 
 function applyUsage(phase: PhaseRecord, event: UsageEvent, how: Attribution = "none"): void {
 	pushUnique(phase.agents, event.agent);
-	if (event.agent && !phase.agent) phase.agent = event.agent;
+	if (event.agent || !phase.agent) phase.agent = event.agent;
 	pushUnique(phase.models, event.model);
 	if (event.model) phase.model = event.model;

[Killed] CallExpression
src/store.ts:641:2
 function applyUsage(phase: PhaseRecord, event: UsageEvent, how: Attribution = "none"): void {
 	pushUnique(phase.agents, event.agent);
 	if (event.agent && !phase.agent) phase.agent = event.agent;
-	pushUnique(phase.models, event.model);
+	;
 	if (event.model) phase.model = event.model;
 	if (event.provider) phase.provider = event.provider;
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] ConditionalExpression
src/store.ts:642:6
 	pushUnique(phase.agents, event.agent);
 	if (event.agent && !phase.agent) phase.agent = event.agent;
 	pushUnique(phase.models, event.model);
-	if (event.model) phase.model = event.model;
+	if (false) phase.model = event.model;
 	if (event.provider) phase.provider = event.provider;
 	if (event.thinking) phase.thinking = event.thinking;
killedBy: test/store.test.ts
statusReason: named agent maps to phase when skill is late: named agent maps to phase when skill is late

[Survived] ConditionalExpression
src/store.ts:642:6
 	pushUnique(phase.agents, event.agent);
 	if (event.agent && !phase.agent) phase.agent = event.agent;
 	pushUnique(phase.models, event.model);
-	if (event.model) phase.model = event.model;
+	if (true) phase.model = event.model;
 	if (event.provider) phase.provider = event.provider;
 	if (event.thinking) phase.thinking = event.thinking;

[Survived] ConditionalExpression
src/store.ts:643:6
 	if (event.agent && !phase.agent) phase.agent = event.agent;
 	pushUnique(phase.models, event.model);
 	if (event.model) phase.model = event.model;
-	if (event.provider) phase.provider = event.provider;
+	if (true) phase.provider = event.provider;
 	if (event.thinking) phase.thinking = event.thinking;
 	if (event.tokens) addTokens(phase.tokens, event.tokens);

[Survived] ConditionalExpression
src/store.ts:643:6
 	if (event.agent && !phase.agent) phase.agent = event.agent;
 	pushUnique(phase.models, event.model);
 	if (event.model) phase.model = event.model;
-	if (event.provider) phase.provider = event.provider;
+	if (false) phase.provider = event.provider;
 	if (event.thinking) phase.thinking = event.thinking;
 	if (event.tokens) addTokens(phase.tokens, event.tokens);

[Killed] ConditionalExpression
src/store.ts:644:6
 	pushUnique(phase.models, event.model);
 	if (event.model) phase.model = event.model;
 	if (event.provider) phase.provider = event.provider;
-	if (event.thinking) phase.thinking = event.thinking;
+	if (true) phase.thinking = event.thinking;
 	if (event.tokens) addTokens(phase.tokens, event.tokens);
 	const cost = event.cost_usd ?? 0;
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ConditionalExpression
src/store.ts:644:6
 	pushUnique(phase.models, event.model);
 	if (event.model) phase.model = event.model;
 	if (event.provider) phase.provider = event.provider;
-	if (event.thinking) phase.thinking = event.thinking;
+	if (false) phase.thinking = event.thinking;
 	if (event.tokens) addTokens(phase.tokens, event.tokens);
 	const cost = event.cost_usd ?? 0;
killedBy: test/claude-code.test.ts
statusReason: usage lands on the phase that is open, and a re-flush bills nothing twice: usage lands on the phase that is open, and a re-flush bills nothing twice

[Killed] ConditionalExpression
src/store.ts:645:6
 	if (event.model) phase.model = event.model;
 	if (event.provider) phase.provider = event.provider;
 	if (event.thinking) phase.thinking = event.thinking;
-	if (event.tokens) addTokens(phase.tokens, event.tokens);
+	if (true) addTokens(phase.tokens, event.tokens);
 	const cost = event.cost_usd ?? 0;
 	phase.cost_usd += cost;
killedBy: test/store.test.ts
statusReason: usage with no open phase and no agent is unattributed: usage with no open phase and no agent is unattributed

[Killed] ConditionalExpression
src/store.ts:645:6
 	if (event.model) phase.model = event.model;
 	if (event.provider) phase.provider = event.provider;
 	if (event.thinking) phase.thinking = event.thinking;
-	if (event.tokens) addTokens(phase.tokens, event.tokens);
+	if (false) addTokens(phase.tokens, event.tokens);
 	const cost = event.cost_usd ?? 0;
 	phase.cost_usd += cost;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase
