[Killed] LogicalOperator
src/store.ts:716:8
 		);
 		for (const p of run.phases) {
-			if (p.name === "unattributed" && p.cost_usd === 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
+			if (p.name === "unattributed" || p.cost_usd === 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
 			const model = p.model ?? p.models[0] ?? "-";
 			const guessed = p.backfilled_cost_usd > 0 ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Killed] EqualityOperator
src/store.ts:716:37
 		);
 		for (const p of run.phases) {
-			if (p.name === "unattributed" && p.cost_usd === 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
+			if (p.name === "unattributed" && p.cost_usd !== 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
 			const model = p.model ?? p.models[0] ?? "-";
 			const guessed = p.backfilled_cost_usd > 0 ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
killedBy: test/store-format.test.ts
statusReason: the empty unattributed bucket is hidden, a funded one is shown: the empty unattributed bucket is hidden, a funded one is shown

[Survived] LogicalOperator
src/store.ts:717:18
 		);
 		for (const p of run.phases) {
 			if (p.name === "unattributed" && p.cost_usd === 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
-			const model = p.model ?? p.models[0] ?? "-";
+			const model = (p.model ?? p.models[0]) && "-";
 			const guessed = p.backfilled_cost_usd > 0 ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
 			const blinded = p.blinding_scrubs > 0 ? `  (blinded ${p.blinding_scrubs})` : "";

[Survived] LogicalOperator
src/store.ts:717:18
 		);
 		for (const p of run.phases) {
 			if (p.name === "unattributed" && p.cost_usd === 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
-			const model = p.model ?? p.models[0] ?? "-";
+			const model = p.model && p.models[0] ?? "-";
 			const guessed = p.backfilled_cost_usd > 0 ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
 			const blinded = p.blinding_scrubs > 0 ? `  (blinded ${p.blinding_scrubs})` : "";

[Survived] ConditionalExpression
src/store.ts:718:20
 		for (const p of run.phases) {
 			if (p.name === "unattributed" && p.cost_usd === 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
 			const model = p.model ?? p.models[0] ?? "-";
-			const guessed = p.backfilled_cost_usd > 0 ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
+			const guessed = true ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
 			const blinded = p.blinding_scrubs > 0 ? `  (blinded ${p.blinding_scrubs})` : "";
 			// A phase entered more than once argued with the next one. Only the final

[Survived] EqualityOperator
src/store.ts:718:20
 		for (const p of run.phases) {
 			if (p.name === "unattributed" && p.cost_usd === 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
 			const model = p.model ?? p.models[0] ?? "-";
-			const guessed = p.backfilled_cost_usd > 0 ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
+			const guessed = p.backfilled_cost_usd >= 0 ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
 			const blinded = p.blinding_scrubs > 0 ? `  (blinded ${p.blinding_scrubs})` : "";
 			// A phase entered more than once argued with the next one. Only the final

[Killed] EqualityOperator
src/store.ts:719:20
 			if (p.name === "unattributed" && p.cost_usd === 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
 			const model = p.model ?? p.models[0] ?? "-";
 			const guessed = p.backfilled_cost_usd > 0 ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
-			const blinded = p.blinding_scrubs > 0 ? `  (blinded ${p.blinding_scrubs})` : "";
+			const blinded = p.blinding_scrubs >= 0 ? `  (blinded ${p.blinding_scrubs})` : "";
 			// A phase entered more than once argued with the next one. Only the final
 			// verdict survives the fold, so without this the loop is invisible.
killedBy: test/store-format.test.ts
statusReason: blinding scrubs and backfilled cost annotate the phase line only when nonzero: blinding scrubs and backfilled cost annotate the phase line only when nonzero

[Killed] ConditionalExpression
src/store.ts:719:20
 			if (p.name === "unattributed" && p.cost_usd === 0 && p.duration_ms === 0 && p.tool_calls === 0) continue;
 			const model = p.model ?? p.models[0] ?? "-";
 			const guessed = p.backfilled_cost_usd > 0 ? `  (backfilled $${p.backfilled_cost_usd.toFixed(4)})` : "";
-			const blinded = p.blinding_scrubs > 0 ? `  (blinded ${p.blinding_scrubs})` : "";
+			const blinded = true ? `  (blinded ${p.blinding_scrubs})` : "";
 			// A phase entered more than once argued with the next one. Only the final
 			// verdict survives the fold, so without this the loop is invisible.
killedBy: test/store-format.test.ts
statusReason: blinding scrubs and backfilled cost annotate the phase line only when nonzero: blinding scrubs and backfilled cost annotate the phase line only when nonzero

[Killed] EqualityOperator
src/store.ts:723:5
 			// A phase entered more than once argued with the next one. Only the final
 			// verdict survives the fold, so without this the loop is invisible.
 			const looped =
-				(p.cycles ?? 0) > 1
+				(p.cycles ?? 0) >= 1
 					? `  (${p.cycles} cycles, ${p.blocking_findings_total ?? 0} findings total)`
 					: "";
killedBy: test/store-format.test.ts
statusReason: a phase entered once reports one cycle and is not annotated: a phase entered once reports one cycle and is not annotated

[Killed] ConditionalExpression
src/store.ts:723:5
 			// A phase entered more than once argued with the next one. Only the final
 			// verdict survives the fold, so without this the loop is invisible.
 			const looped =
-				(p.cycles ?? 0) > 1
+				true
 					? `  (${p.cycles} cycles, ${p.blocking_findings_total ?? 0} findings total)`
 					: "";
killedBy: test/store-format.test.ts
statusReason: a phase entered once reports one cycle and is not annotated: a phase entered once reports one cycle and is not annotated

[Killed] LogicalOperator
src/store.ts:724:34
 			// verdict survives the fold, so without this the loop is invisible.
 			const looped =
 				(p.cycles ?? 0) > 1
-					? `  (${p.cycles} cycles, ${p.blocking_findings_total ?? 0} findings total)`
+					? `  (${p.cycles} cycles, ${p.blocking_findings_total && 0} findings total)`
 					: "";
 			// Tokens, not just dollars: a subscription-billed phase reports $0 and would
killedBy: test/store-format.test.ts
statusReason: summarize annotates a looped phase with its cycles and total findings: summarize annotates a looped phase with its cycles and total findings

[Killed] LogicalOperator
src/store.ts:729:21
 			// Tokens, not just dollars: a subscription-billed phase reports $0 and would
 			// otherwise read as no work at all. Notional is what closes that gap.
 			const tok = totalTokens(p.tokens);
-			const notional = p.notional_cost_usd ?? p.cost_usd;
+			const notional = p.notional_cost_usd && p.cost_usd;
 			const spend =
 				p.cost_usd > 0
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Killed] EqualityOperator
src/store.ts:731:5
 			const tok = totalTokens(p.tokens);
 			const notional = p.notional_cost_usd ?? p.cost_usd;
 			const spend =
-				p.cost_usd > 0
+				p.cost_usd >= 0
 					? `$${p.cost_usd.toFixed(4)}`
 					: tok > 0
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Killed] ConditionalExpression
src/store.ts:731:5
 			const tok = totalTokens(p.tokens);
 			const notional = p.notional_cost_usd ?? p.cost_usd;
 			const spend =
-				p.cost_usd > 0
+				true
 					? `$${p.cost_usd.toFixed(4)}`
 					: tok > 0
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Survived] StringLiteral
src/store.ts:732:8
 			const notional = p.notional_cost_usd ?? p.cost_usd;
 			const spend =
 				p.cost_usd > 0
-					? `$${p.cost_usd.toFixed(4)}`
+					? ``
 					: tok > 0
 						? notional > 0

[Killed] EqualityOperator
src/store.ts:733:8
 			const spend =
 				p.cost_usd > 0
 					? `$${p.cost_usd.toFixed(4)}`
-					: tok > 0
+					: tok <= 0
 						? notional > 0
 							? `$0 (~$${notional.toFixed(4)})`
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Killed] ConditionalExpression
src/store.ts:733:8
 			const spend =
 				p.cost_usd > 0
 					? `$${p.cost_usd.toFixed(4)}`
-					: tok > 0
+					: false
 						? notional > 0
 							? `$0 (~$${notional.toFixed(4)})`
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Killed] EqualityOperator
src/store.ts:734:9
 				p.cost_usd > 0
 					? `$${p.cost_usd.toFixed(4)}`
 					: tok > 0
-						? notional > 0
+						? notional >= 0
 							? `$0 (~$${notional.toFixed(4)})`
 							: "$    n/a"
killedBy: test/store-format.test.ts
statusReason: a phase with tokens but no price at all reads n/a rather than $0: a phase with tokens but no price at all reads n/a rather than $0

[Killed] EqualityOperator
src/store.ts:734:9
 				p.cost_usd > 0
 					? `$${p.cost_usd.toFixed(4)}`
 					: tok > 0
-						? notional > 0
+						? notional <= 0
 							? `$0 (~$${notional.toFixed(4)})`
 							: "$    n/a"
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Killed] StringLiteral
src/store.ts:735:10
 					? `$${p.cost_usd.toFixed(4)}`
 					: tok > 0
 						? notional > 0
-							? `$0 (~$${notional.toFixed(4)})`
+							? ``
 							: "$    n/a"
 						: "$0.0000";
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Survived] StringLiteral
src/store.ts:737:9
 						? notional > 0
 							? `$0 (~$${notional.toFixed(4)})`
 							: "$    n/a"
-						: "$0.0000";
+						: "";
 			lines.push(
 				`  ${p.name.padEnd(13)}  ${spend}  ${(p.duration_ms / 1000).toFixed(1)}s  ${p.turns}t ${p.tool_calls}tools  ${fmtTokens(p.tokens)}  ${model}${guessed}${blinded}${looped}`,

[Survived] ArithmeticOperator
src/store.ts:739:43
 							: "$    n/a"
 						: "$0.0000";
 			lines.push(
-				`  ${p.name.padEnd(13)}  ${spend}  ${(p.duration_ms / 1000).toFixed(1)}s  ${p.turns}t ${p.tool_calls}tools  ${fmtTokens(p.tokens)}  ${model}${guessed}${blinded}${looped}`,
+				`  ${p.name.padEnd(13)}  ${spend}  ${(p.duration_ms * 1000).toFixed(1)}s  ${p.turns}t ${p.tool_calls}tools  ${fmtTokens(p.tokens)}  ${model}${guessed}${blinded}${looped}`,
 			);
 		}

[Killed] StringLiteral
src/store.ts:739:5
 							: "$    n/a"
 						: "$0.0000";
 			lines.push(
-				`  ${p.name.padEnd(13)}  ${spend}  ${(p.duration_ms / 1000).toFixed(1)}s  ${p.turns}t ${p.tool_calls}tools  ${fmtTokens(p.tokens)}  ${model}${guessed}${blinded}${looped}`,
+				``,
 			);
 		}
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Killed] EqualityOperator
src/store.ts:744:34
 		}
 		// A `dag` supervisor has no phases by design — orchestration is its work — so
 		// flagging it here would contradict `diagnose`, which already exempts it.
-		if (run.phase_entries === 0 && run.mode !== "dag") {
+		if (run.phase_entries === 0 && run.mode === "dag") {
 			lines.push("  ! ungated — run started but no phase was ever entered");
 		}
killedBy: test/store-format.test.ts
statusReason: an ungated run is called out, and a gated one is not: an ungated run is called out, and a gated one is not

[Killed] BlockStatement
src/store.ts:744:54
 		}
 		// A `dag` supervisor has no phases by design — orchestration is its work — so
 		// flagging it here would contradict `diagnose`, which already exempts it.
-		if (run.phase_entries === 0 && run.mode !== "dag") {
-			lines.push("  ! ungated — run started but no phase was ever entered");
-		}
+		if (run.phase_entries === 0 && run.mode !== "dag") {}
 		if (run.last_verify) {
 			const v = run.last_verify;
killedBy: test/store-format.test.ts
statusReason: an ungated run is called out, and a gated one is not: an ungated run is called out, and a gated one is not

[Killed] ConditionalExpression
src/store.ts:747:7
 		if (run.phase_entries === 0 && run.mode !== "dag") {
 			lines.push("  ! ungated — run started but no phase was ever entered");
 		}
-		if (run.last_verify) {
+		if (false) {
 			const v = run.last_verify;
 			const mark = v.exit_code === 0 ? "green" : `RED (exit ${v.exit_code})`;
killedBy: test/store-format.test.ts
statusReason: verify state renders green or red with the command and a count: verify state renders green or red with the command and a count

[Killed] ConditionalExpression
src/store.ts:747:7
 		if (run.phase_entries === 0 && run.mode !== "dag") {
 			lines.push("  ! ungated — run started but no phase was ever entered");
 		}
-		if (run.last_verify) {
+		if (true) {
 			const v = run.last_verify;
 			const mark = v.exit_code === 0 ? "green" : `RED (exit ${v.exit_code})`;
killedBy: test/store.test.ts
statusReason: R records decision counts and deviations surface in the summary: R records decision counts and deviations surface in the summary

[Killed] ConditionalExpression
src/store.ts:749:17
 		}
 		if (run.last_verify) {
 			const v = run.last_verify;
-			const mark = v.exit_code === 0 ? "green" : `RED (exit ${v.exit_code})`;
+			const mark = true ? "green" : `RED (exit ${v.exit_code})`;
 			lines.push(`  verify ${mark}  \`${v.command}\`  ×${run.verify_count}`);
 		}
killedBy: test/store-format.test.ts
statusReason: verify state renders green or red with the command and a count: verify state renders green or red with the command and a count

[Killed] ConditionalExpression
src/store.ts:749:17
 		}
 		if (run.last_verify) {
 			const v = run.last_verify;
-			const mark = v.exit_code === 0 ? "green" : `RED (exit ${v.exit_code})`;
+			const mark = false ? "green" : `RED (exit ${v.exit_code})`;
 			lines.push(`  verify ${mark}  \`${v.command}\`  ×${run.verify_count}`);
 		}
killedBy: test/store-format.test.ts
statusReason: verify state renders green or red with the command and a count: verify state renders green or red with the command and a count

[Killed] ConditionalExpression
src/store.ts:752:41
 			const mark = v.exit_code === 0 ? "green" : `RED (exit ${v.exit_code})`;
 			lines.push(`  verify ${mark}  \`${v.command}\`  ×${run.verify_count}`);
 		}
-		const render = run.phases.find((p) => p.name === "R");
+		const render = run.phases.find((p) => false);
 		if (render?.decisions) {
 			const dev = render.plan_deviations ?? 0;
killedBy: test/store.test.ts
statusReason: R records decision counts and deviations surface in the summary: R records decision counts and deviations surface in the summary

[Killed] ArrowFunction
src/store.ts:752:34
 			const mark = v.exit_code === 0 ? "green" : `RED (exit ${v.exit_code})`;
 			lines.push(`  verify ${mark}  \`${v.command}\`  ×${run.verify_count}`);
 		}
-		const render = run.phases.find((p) => p.name === "R");
+		const render = run.phases.find(() => undefined);
 		if (render?.decisions) {
 			const dev = render.plan_deviations ?? 0;
killedBy: test/store.test.ts
statusReason: R records decision counts and deviations surface in the summary: R records decision counts and deviations surface in the summary

[Killed] ConditionalExpression
src/store.ts:753:7
 			lines.push(`  verify ${mark}  \`${v.command}\`  ×${run.verify_count}`);
 		}
 		const render = run.phases.find((p) => p.name === "R");
-		if (render?.decisions) {
+		if (false) {
 			const dev = render.plan_deviations ?? 0;
 			lines.push(`  decisions ${render.decisions}${dev > 0 ? `, ${dev} deviating from plan` : ""}`);
killedBy: test/store.test.ts
statusReason: R records decision counts and deviations surface in the summary: R records decision counts and deviations surface in the summary

[Killed] ConditionalExpression
src/store.ts:753:7
 			lines.push(`  verify ${mark}  \`${v.command}\`  ×${run.verify_count}`);
 		}
 		const render = run.phases.find((p) => p.name === "R");
-		if (render?.decisions) {
+		if (true) {
 			const dev = render.plan_deviations ?? 0;
 			lines.push(`  decisions ${render.decisions}${dev > 0 ? `, ${dev} deviating from plan` : ""}`);
killedBy: test/store-format.test.ts
statusReason: summarize renders the run header with version, kind, mode and outcome: summarize renders the run header with version, kind, mode and outcome

[Killed] LogicalOperator
src/store.ts:754:16
 		}
 		const render = run.phases.find((p) => p.name === "R");
 		if (render?.decisions) {
-			const dev = render.plan_deviations ?? 0;
+			const dev = render.plan_deviations && 0;
 			lines.push(`  decisions ${render.decisions}${dev > 0 ? `, ${dev} deviating from plan` : ""}`);
 		}
killedBy: test/store.test.ts
statusReason: R records decision counts and deviations surface in the summary: R records decision counts and deviations surface in the summary

[Killed] ConditionalExpression
src/store.ts:755:49
 		const render = run.phases.find((p) => p.name === "R");
 		if (render?.decisions) {
 			const dev = render.plan_deviations ?? 0;
-			lines.push(`  decisions ${render.decisions}${dev > 0 ? `, ${dev} deviating from plan` : ""}`);
+			lines.push(`  decisions ${render.decisions}${true ? `, ${dev} deviating from plan` : ""}`);
 		}
 		// Absent means mutation was skipped, which is not the same as a clean sweep —
killedBy: test/store.test.ts
statusReason: a Render with decisions but no deviations stays quiet about them: a Render with decisions but no deviations stays quiet about them

[Killed] ConditionalExpression
src/store.ts:755:49
 		const render = run.phases.find((p) => p.name === "R");
 		if (render?.decisions) {
 			const dev = render.plan_deviations ?? 0;
-			lines.push(`  decisions ${render.decisions}${dev > 0 ? `, ${dev} deviating from plan` : ""}`);
+			lines.push(`  decisions ${render.decisions}${false ? `, ${dev} deviating from plan` : ""}`);
 		}
 		// Absent means mutation was skipped, which is not the same as a clean sweep —
killedBy: test/store.test.ts
statusReason: R records decision counts and deviations surface in the summary: R records decision counts and deviations surface in the summary

[Killed] EqualityOperator
src/store.ts:759:7
 		}
 		// Absent means mutation was skipped, which is not the same as a clean sweep —
 		// so this line appears only when something was actually measured.
-		if (render?.mutants_tested !== undefined) {
+		if (render?.mutants_tested === undefined) {
 			const survived = render.mutants_survived ?? 0;
 			lines.push(`  mutants ${render.mutants_tested - survived}/${render.mutants_tested} killed, ${survived} to adjudicate`);
killedBy: test/store-format.test.ts
statusReason: summarize renders the run header with version, kind, mode and outcome: summarize renders the run header with version, kind, mode and outcome

[Killed] BlockStatement
src/store.ts:759:45
 		}
 		// Absent means mutation was skipped, which is not the same as a clean sweep —
 		// so this line appears only when something was actually measured.
-		if (render?.mutants_tested !== undefined) {
-			const survived = render.mutants_survived ?? 0;
-			lines.push(`  mutants ${render.mutants_tested - survived}/${render.mutants_tested} killed, ${survived} to adjudicate`);
-		}
+		if (render?.mutants_tested !== undefined) {}
 		const s = run.seams;
 		lines.push(
killedBy: test/store-format.test.ts
statusReason: mutation results are summarised, and absent when mutation was skipped: mutation results are summarised, and absent when mutation was skipped

[Killed] LogicalOperator
src/store.ts:760:21
 		// Absent means mutation was skipped, which is not the same as a clean sweep —
 		// so this line appears only when something was actually measured.
 		if (render?.mutants_tested !== undefined) {
-			const survived = render.mutants_survived ?? 0;
+			const survived = render.mutants_survived && 0;
 			lines.push(`  mutants ${render.mutants_tested - survived}/${render.mutants_tested} killed, ${survived} to adjudicate`);
 		}
killedBy: test/store-format.test.ts
statusReason: mutation results are summarised, and absent when mutation was skipped: mutation results are summarised, and absent when mutation was skipped

[Killed] ArithmeticOperator
src/store.ts:761:28
 		// so this line appears only when something was actually measured.
 		if (render?.mutants_tested !== undefined) {
 			const survived = render.mutants_survived ?? 0;
-			lines.push(`  mutants ${render.mutants_tested - survived}/${render.mutants_tested} killed, ${survived} to adjudicate`);
+			lines.push(`  mutants ${render.mutants_tested + survived}/${render.mutants_tested} killed, ${survived} to adjudicate`);
 		}
 		const s = run.seams;
killedBy: test/store-format.test.ts
statusReason: mutation results are summarised, and absent when mutation was skipped: mutation results are summarised, and absent when mutation was skipped

[Killed] StringLiteral
src/store.ts:768:20
 			`  seams  counsel≠C=${fmtSeam(s.counsel_family_differs_from_c)}  A≠R=${fmtSeam(s.a_family_differs_from_r)}  T≠R=${fmtSeam(s.t_family_differs_from_r)}`,
 		);
 	}
-	return lines.join("\n");
+	return lines.join("");
 }
 
killedBy: test/store-format.test.ts
statusReason: summarize renders the run header with version, kind, mode and outcome: summarize renders the run header with version, kind, mode and outcome

[Killed] BlockStatement
src/store.ts:771:52
 	return lines.join("\n");
 }
 
-export function fmtSeam(v: boolean | null): string {
-	if (v === null) return "?";
-	return v ? "yes" : "NO";
-}
+export function fmtSeam(v: boolean | null): string {}
 
 export interface Complaint {
killedBy: test/store-format.test.ts
statusReason: fmtSeam distinguishes unknown from failed: fmtSeam distinguishes unknown from failed

[Killed] ConditionalExpression
src/store.ts:772:6
 }
 
 export function fmtSeam(v: boolean | null): string {
-	if (v === null) return "?";
+	if (true) return "?";
 	return v ? "yes" : "NO";
 }
killedBy: test/store-format.test.ts
statusReason: fmtSeam distinguishes unknown from failed: fmtSeam distinguishes unknown from failed

[Killed] ConditionalExpression
src/store.ts:772:6
 }
 
 export function fmtSeam(v: boolean | null): string {
-	if (v === null) return "?";
+	if (false) return "?";
 	return v ? "yes" : "NO";
 }
killedBy: test/store-format.test.ts
statusReason: fmtSeam distinguishes unknown from failed: fmtSeam distinguishes unknown from failed

[Killed] ArrayDeclaration
src/store.ts:795:27
  * thing standing between a silent collection bug and six days of bad metrics.
  */
 export function diagnose(runs: Run[], now = Date.now(), staleHours = 12): Complaint[] {
-	const out: Complaint[] = [];
+	const out: Complaint[] = ["Stryker was here"];
 	let unattributed = 0;
 	let total = 0;
killedBy: test/store-format.test.ts
statusReason: doctor is silent on a healthy run: doctor is silent on a healthy run

[Killed] ArrowFunction
src/store.ts:801:37
 	const costless = new Map<string, { events: number; tokens: number }>();
 
 	for (const run of runs) {
-		const runCost = run.phases.reduce((s, p) => s + p.cost_usd, 0);
+		const runCost = run.phases.reduce(() => undefined, 0);
 		total += runCost;
 		const un = run.phases.find((p) => p.name === "unattributed");
killedBy: test/store.test.ts
statusReason: doctor flags a run that was started but never gated: doctor flags a run that was started but never gated

[Killed] ArithmeticOperator
src/store.ts:801:47
 	const costless = new Map<string, { events: number; tokens: number }>();
 
 	for (const run of runs) {
-		const runCost = run.phases.reduce((s, p) => s + p.cost_usd, 0);
+		const runCost = run.phases.reduce((s, p) => s - p.cost_usd, 0);
 		total += runCost;
 		const un = run.phases.find((p) => p.name === "unattributed");
killedBy: test/store.test.ts
statusReason: doctor flags a run that was started but never gated: doctor flags a run that was started but never gated

[Killed] AssignmentOperator
src/store.ts:802:3
 
 	for (const run of runs) {
 		const runCost = run.phases.reduce((s, p) => s + p.cost_usd, 0);
-		total += runCost;
+		total -= runCost;
 		const un = run.phases.find((p) => p.name === "unattributed");
 		unattributed += un?.cost_usd ?? 0;
killedBy: test/store.test.ts
statusReason: doctor flags a run that was started but never gated: doctor flags a run that was started but never gated

[Killed] ConditionalExpression
src/store.ts:803:37
 	for (const run of runs) {
 		const runCost = run.phases.reduce((s, p) => s + p.cost_usd, 0);
 		total += runCost;
-		const un = run.phases.find((p) => p.name === "unattributed");
+		const un = run.phases.find((p) => false);
 		unattributed += un?.cost_usd ?? 0;
 
killedBy: test/store.test.ts
statusReason: doctor flags a run that was started but never gated: doctor flags a run that was started but never gated

[Killed] ConditionalExpression
src/store.ts:803:37
 	for (const run of runs) {
 		const runCost = run.phases.reduce((s, p) => s + p.cost_usd, 0);
 		total += runCost;
-		const un = run.phases.find((p) => p.name === "unattributed");
+		const un = run.phases.find((p) => true);
 		unattributed += un?.cost_usd ?? 0;
 
killedBy: test/store-format.test.ts
statusReason: doctor is silent on a healthy run: doctor is silent on a healthy run

[Killed] AssignmentOperator
src/store.ts:804:3
 		const runCost = run.phases.reduce((s, p) => s + p.cost_usd, 0);
 		total += runCost;
 		const un = run.phases.find((p) => p.name === "unattributed");
-		unattributed += un?.cost_usd ?? 0;
+		unattributed -= un?.cost_usd ?? 0;
 
 		// `dag` runs have no phases by design; only a CRAFTS run is expected to gate.
killedBy: test/store.test.ts
statusReason: doctor flags a run that was started but never gated: doctor flags a run that was started but never gated

[Killed] LogicalOperator
src/store.ts:804:19
 		const runCost = run.phases.reduce((s, p) => s + p.cost_usd, 0);
 		total += runCost;
 		const un = run.phases.find((p) => p.name === "unattributed");
-		unattributed += un?.cost_usd ?? 0;
+		unattributed += un?.cost_usd && 0;
 
 		// `dag` runs have no phases by design; only a CRAFTS run is expected to gate.
killedBy: test/store.test.ts
statusReason: doctor flags a run that was started but never gated: doctor flags a run that was started but never gated

[Killed] LogicalOperator
src/store.ts:807:7
 		unattributed += un?.cost_usd ?? 0;
 
 		// `dag` runs have no phases by design; only a CRAFTS run is expected to gate.
-		if (run.phase_entries === 0 && run.mode !== "dag") {
+		if (run.phase_entries === 0 || run.mode !== "dag") {
 			out.push({
 				kind: "ungated",
killedBy: test/store.test.ts
statusReason: doctor does not call a phaseless dag run ungated: doctor does not call a phaseless dag run ungated

[Killed] EqualityOperator
src/store.ts:807:7
 		unattributed += un?.cost_usd ?? 0;
 
 		// `dag` runs have no phases by design; only a CRAFTS run is expected to gate.
-		if (run.phase_entries === 0 && run.mode !== "dag") {
+		if (run.phase_entries !== 0 && run.mode !== "dag") {
 			out.push({
 				kind: "ungated",
killedBy: test/store.test.ts
statusReason: doctor flags a run that was started but never gated: doctor flags a run that was started but never gated

[Survived] LogicalOperator
src/store.ts:811:16
 			out.push({
 				kind: "ungated",
 				run_id: run.run_id,
-				detail: `${run.repo ?? run.cwd}: started ${run.started_at}, no phase ever entered`,
+				detail: `${run.repo && run.cwd}: started ${run.started_at}, no phase ever entered`,
 				cost_usd: runCost,
 			});

[Survived] StringLiteral
src/store.ts:811:13
 			out.push({
 				kind: "ungated",
 				run_id: run.run_id,
-				detail: `${run.repo ?? run.cwd}: started ${run.started_at}, no phase ever entered`,
+				detail: ``,
 				cost_usd: runCost,
 			});

[Killed] EqualityOperator
src/store.ts:818:7
 		// Host is a comparison axis, so a run that names no harness is not merely
 		// unlabelled — it sits in its own `unknown` bucket and compares against
 		// nothing. `craft-metrics host --run ID --host …` fixes it after the fact.
-		if (run.host === "unknown") {
+		if (run.host !== "unknown") {
 			out.push({
 				kind: "unknown-host",
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness
