[Killed] BlockStatement
src/store.ts:818:31
 		// Host is a comparison axis, so a run that names no harness is not merely
 		// unlabelled — it sits in its own `unknown` bucket and compares against
 		// nothing. `craft-metrics host --run ID --host …` fixes it after the fact.
-		if (run.host === "unknown") {
-			out.push({
-				kind: "unknown-host",
-				run_id: run.run_id,
-				detail: `${run.repo ?? run.cwd}: no harness recorded — cannot be compared against pi or claude-code`,
-				cost_usd: runCost,
-			});
-		}
+		if (run.host === "unknown") {}
 		// Fix exists to resolve blockers. Entering it when Assess and Tighten both
 		// passed means the phase sequence is being emitted mechanically rather than
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness

[Killed] ObjectLiteral
src/store.ts:819:13
 		// unlabelled — it sits in its own `unknown` bucket and compares against
 		// nothing. `craft-metrics host --run ID --host …` fixes it after the fact.
 		if (run.host === "unknown") {
-			out.push({
-				kind: "unknown-host",
-				run_id: run.run_id,
-				detail: `${run.repo ?? run.cwd}: no harness recorded — cannot be compared against pi or claude-code`,
-				cost_usd: runCost,
-			});
+			out.push({});
 		}
 		// Fix exists to resolve blockers. Entering it when Assess and Tighten both
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness

[Killed] StringLiteral
src/store.ts:820:11
 		// nothing. `craft-metrics host --run ID --host …` fixes it after the fact.
 		if (run.host === "unknown") {
 			out.push({
-				kind: "unknown-host",
+				kind: "",
 				run_id: run.run_id,
 				detail: `${run.repo ?? run.cwd}: no harness recorded — cannot be compared against pi or claude-code`,
killedBy: test/store.test.ts
statusReason: setHost corrects a run that was opened without a harness: setHost corrects a run that was opened without a harness

[Survived] LogicalOperator
src/store.ts:822:16
 			out.push({
 				kind: "unknown-host",
 				run_id: run.run_id,
-				detail: `${run.repo ?? run.cwd}: no harness recorded — cannot be compared against pi or claude-code`,
+				detail: `${run.repo && run.cwd}: no harness recorded — cannot be compared against pi or claude-code`,
 				cost_usd: runCost,
 			});

[Killed] EqualityOperator
src/store.ts:829:38
 		// Fix exists to resolve blockers. Entering it when Assess and Tighten both
 		// passed means the phase sequence is being emitted mechanically rather than
 		// followed, and the work it does is unbudgeted by definition.
-		const fix = run.phases.find((p) => p.name === "F");
+		const fix = run.phases.find((p) => p.name !== "F");
 		if (fix?.started_at) {
 			const assess = run.phases.find((p) => p.name === "A");
killedBy: test/store-format.test.ts
statusReason: doctor is silent on a healthy run: doctor is silent on a healthy run

[Killed] ConditionalExpression
src/store.ts:829:38
 		// Fix exists to resolve blockers. Entering it when Assess and Tighten both
 		// passed means the phase sequence is being emitted mechanically rather than
 		// followed, and the work it does is unbudgeted by definition.
-		const fix = run.phases.find((p) => p.name === "F");
+		const fix = run.phases.find((p) => true);
 		if (fix?.started_at) {
 			const assess = run.phases.find((p) => p.name === "A");
killedBy: test/store-format.test.ts
statusReason: doctor is silent on a healthy run: doctor is silent on a healthy run

[Killed] ConditionalExpression
src/store.ts:830:7
 		// passed means the phase sequence is being emitted mechanically rather than
 		// followed, and the work it does is unbudgeted by definition.
 		const fix = run.phases.find((p) => p.name === "F");
-		if (fix?.started_at) {
+		if (false) {
 			const assess = run.phases.find((p) => p.name === "A");
 			const tighten = run.phases.find((p) => p.name === "T");
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Killed] ConditionalExpression
src/store.ts:830:7
 		// passed means the phase sequence is being emitted mechanically rather than
 		// followed, and the work it does is unbudgeted by definition.
 		const fix = run.phases.find((p) => p.name === "F");
-		if (fix?.started_at) {
+		if (true) {
 			const assess = run.phases.find((p) => p.name === "A");
 			const tighten = run.phases.find((p) => p.name === "T");
killedBy: test/store.test.ts
statusReason: doctor flags a run that was started but never gated: doctor flags a run that was started but never gated

[Killed] EqualityOperator
src/store.ts:831:42
 		// followed, and the work it does is unbudgeted by definition.
 		const fix = run.phases.find((p) => p.name === "F");
 		if (fix?.started_at) {
-			const assess = run.phases.find((p) => p.name === "A");
+			const assess = run.phases.find((p) => p.name !== "A");
 			const tighten = run.phases.find((p) => p.name === "T");
 			const blockers =
killedBy: test/store-format.test.ts
statusReason: a Fix that followed a real failure is not flagged, even after the re-review passed: a Fix that followed a real failure is not flagged, even after the re-review passed

[Killed] ConditionalExpression
src/store.ts:831:42
 		// followed, and the work it does is unbudgeted by definition.
 		const fix = run.phases.find((p) => p.name === "F");
 		if (fix?.started_at) {
-			const assess = run.phases.find((p) => p.name === "A");
+			const assess = run.phases.find((p) => false);
 			const tighten = run.phases.find((p) => p.name === "T");
 			const blockers =
killedBy: test/store-format.test.ts
statusReason: a Fix that followed a real failure is not flagged, even after the re-review passed: a Fix that followed a real failure is not flagged, even after the re-review passed

[Killed] EqualityOperator
src/store.ts:832:43
 		const fix = run.phases.find((p) => p.name === "F");
 		if (fix?.started_at) {
 			const assess = run.phases.find((p) => p.name === "A");
-			const tighten = run.phases.find((p) => p.name === "T");
+			const tighten = run.phases.find((p) => p.name !== "T");
 			const blockers =
 				(assess?.blocking_findings_total ?? 0) > 0 ||
killedBy: test/store-format.test.ts
statusReason: a Fix following a T P0 finding is not flagged: a Fix following a T P0 finding is not flagged

[Killed] ConditionalExpression
src/store.ts:832:43
 		const fix = run.phases.find((p) => p.name === "F");
 		if (fix?.started_at) {
 			const assess = run.phases.find((p) => p.name === "A");
-			const tighten = run.phases.find((p) => p.name === "T");
+			const tighten = run.phases.find((p) => true);
 			const blockers =
 				(assess?.blocking_findings_total ?? 0) > 0 ||
killedBy: test/store-format.test.ts
statusReason: a Fix following a T P0 finding is not flagged: a Fix following a T P0 finding is not flagged

[Killed] ConditionalExpression
src/store.ts:834:5
 			const assess = run.phases.find((p) => p.name === "A");
 			const tighten = run.phases.find((p) => p.name === "T");
 			const blockers =
-				(assess?.blocking_findings_total ?? 0) > 0 ||
-				(tighten?.p0_count ?? 0) > 0 ||
-				assess?.verdict === "fail" ||
-				tighten?.t_status === "fail";
+				true;
 			if (!blockers) {
 				out.push({
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Killed] LogicalOperator
src/store.ts:834:5
 			const assess = run.phases.find((p) => p.name === "A");
 			const tighten = run.phases.find((p) => p.name === "T");
 			const blockers =
-				(assess?.blocking_findings_total ?? 0) > 0 ||
-				(tighten?.p0_count ?? 0) > 0 ||
-				assess?.verdict === "fail" ||
+				((assess?.blocking_findings_total ?? 0) > 0 || (tighten?.p0_count ?? 0) > 0) && assess?.verdict === "fail" ||
 				tighten?.t_status === "fail";
 			if (!blockers) {
killedBy: test/store-format.test.ts
statusReason: a Fix that followed a real failure is not flagged, even after the re-review passed: a Fix that followed a real failure is not flagged, even after the re-review passed

[Killed] OptionalChaining
src/store.ts:835:6
 			const tighten = run.phases.find((p) => p.name === "T");
 			const blockers =
 				(assess?.blocking_findings_total ?? 0) > 0 ||
-				(tighten?.p0_count ?? 0) > 0 ||
+				(tighten.p0_count ?? 0) > 0 ||
 				assess?.verdict === "fail" ||
 				tighten?.t_status === "fail";
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Killed] EqualityOperator
src/store.ts:835:5
 			const tighten = run.phases.find((p) => p.name === "T");
 			const blockers =
 				(assess?.blocking_findings_total ?? 0) > 0 ||
-				(tighten?.p0_count ?? 0) > 0 ||
+				(tighten?.p0_count ?? 0) >= 0 ||
 				assess?.verdict === "fail" ||
 				tighten?.t_status === "fail";
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Killed] EqualityOperator
src/store.ts:836:5
 			const blockers =
 				(assess?.blocking_findings_total ?? 0) > 0 ||
 				(tighten?.p0_count ?? 0) > 0 ||
-				assess?.verdict === "fail" ||
+				assess?.verdict !== "fail" ||
 				tighten?.t_status === "fail";
 			if (!blockers) {
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Survived] OptionalChaining
src/store.ts:836:5
 			const blockers =
 				(assess?.blocking_findings_total ?? 0) > 0 ||
 				(tighten?.p0_count ?? 0) > 0 ||
-				assess?.verdict === "fail" ||
+				assess.verdict === "fail" ||
 				tighten?.t_status === "fail";
 			if (!blockers) {

[Killed] EqualityOperator
src/store.ts:837:5
 				(assess?.blocking_findings_total ?? 0) > 0 ||
 				(tighten?.p0_count ?? 0) > 0 ||
 				assess?.verdict === "fail" ||
-				tighten?.t_status === "fail";
+				tighten?.t_status !== "fail";
 			if (!blockers) {
 				out.push({
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Killed] OptionalChaining
src/store.ts:837:5
 				(assess?.blocking_findings_total ?? 0) > 0 ||
 				(tighten?.p0_count ?? 0) > 0 ||
 				assess?.verdict === "fail" ||
-				tighten?.t_status === "fail";
+				tighten.t_status === "fail";
 			if (!blockers) {
 				out.push({
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Killed] ConditionalExpression
src/store.ts:838:8
 				(tighten?.p0_count ?? 0) > 0 ||
 				assess?.verdict === "fail" ||
 				tighten?.t_status === "fail";
-			if (!blockers) {
+			if (true) {
 				out.push({
 					kind: "fix-without-findings",
killedBy: test/store-format.test.ts
statusReason: a Fix that followed a real failure is not flagged, even after the re-review passed: a Fix that followed a real failure is not flagged, even after the re-review passed

[Killed] BlockStatement
src/store.ts:838:19
 				(tighten?.p0_count ?? 0) > 0 ||
 				assess?.verdict === "fail" ||
 				tighten?.t_status === "fail";
-			if (!blockers) {
-				out.push({
-					kind: "fix-without-findings",
-					run_id: run.run_id,
-					detail: `${run.repo ?? run.cwd}: F ran with no blocking finding from A or T`,
-					cost_usd: fix.notional_cost_usd ?? fix.cost_usd,
-				});
-			}
+			if (!blockers) {}
 		}
 		// A red tree is blocked at the gate; a tree nobody checked is not, so it is
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Killed] ObjectLiteral
src/store.ts:839:14
 				assess?.verdict === "fail" ||
 				tighten?.t_status === "fail";
 			if (!blockers) {
-				out.push({
-					kind: "fix-without-findings",
-					run_id: run.run_id,
-					detail: `${run.repo ?? run.cwd}: F ran with no blocking finding from A or T`,
-					cost_usd: fix.notional_cost_usd ?? fix.cost_usd,
-				});
+				out.push({});
 			}
 		}
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Killed] StringLiteral
src/store.ts:840:12
 				tighten?.t_status === "fail";
 			if (!blockers) {
 				out.push({
-					kind: "fix-without-findings",
+					kind: "",
 					run_id: run.run_id,
 					detail: `${run.repo ?? run.cwd}: F ran with no blocking finding from A or T`,
killedBy: test/store-format.test.ts
statusReason: doctor flags a Fix phase that ran with nothing to fix: doctor flags a Fix phase that ran with nothing to fix

[Survived] LogicalOperator
src/store.ts:842:17
 				out.push({
 					kind: "fix-without-findings",
 					run_id: run.run_id,
-					detail: `${run.repo ?? run.cwd}: F ran with no blocking finding from A or T`,
+					detail: `${run.repo && run.cwd}: F ran with no blocking finding from A or T`,
 					cost_usd: fix.notional_cost_usd ?? fix.cost_usd,
 				});

[Survived] LogicalOperator
src/store.ts:843:16
 					kind: "fix-without-findings",
 					run_id: run.run_id,
 					detail: `${run.repo ?? run.cwd}: F ran with no blocking finding from A or T`,
-					cost_usd: fix.notional_cost_usd ?? fix.cost_usd,
+					cost_usd: fix.notional_cost_usd && fix.cost_usd,
 				});
 			}

[Killed] EqualityOperator
src/store.ts:849:41
 		}
 		// A red tree is blocked at the gate; a tree nobody checked is not, so it is
 		// the case that needs surfacing.
-		const assess = run.phases.find((p) => p.name === "A");
+		const assess = run.phases.find((p) => p.name !== "A");
 		if (assess?.verdict === "pass" && run.verify_count === 0) {
 			out.push({
killedBy: test/store.test.ts
statusReason: doctor flags A passing with no verify ever recorded: doctor flags A passing with no verify ever recorded

[Killed] ArrowFunction
src/store.ts:849:34
 		}
 		// A red tree is blocked at the gate; a tree nobody checked is not, so it is
 		// the case that needs surfacing.
-		const assess = run.phases.find((p) => p.name === "A");
+		const assess = run.phases.find(() => undefined);
 		if (assess?.verdict === "pass" && run.verify_count === 0) {
 			out.push({
killedBy: test/store.test.ts
statusReason: doctor flags A passing with no verify ever recorded: doctor flags A passing with no verify ever recorded

[Killed] LogicalOperator
src/store.ts:850:7
 		// A red tree is blocked at the gate; a tree nobody checked is not, so it is
 		// the case that needs surfacing.
 		const assess = run.phases.find((p) => p.name === "A");
-		if (assess?.verdict === "pass" && run.verify_count === 0) {
+		if (assess?.verdict === "pass" || run.verify_count === 0) {
 			out.push({
 				kind: "unverified-pass",
killedBy: test/store-format.test.ts
statusReason: doctor is silent on a healthy run: doctor is silent on a healthy run

[Killed] EqualityOperator
src/store.ts:850:7
 		// A red tree is blocked at the gate; a tree nobody checked is not, so it is
 		// the case that needs surfacing.
 		const assess = run.phases.find((p) => p.name === "A");
-		if (assess?.verdict === "pass" && run.verify_count === 0) {
+		if (assess?.verdict !== "pass" && run.verify_count === 0) {
 			out.push({
 				kind: "unverified-pass",
killedBy: test/store.test.ts
statusReason: doctor flags A passing with no verify ever recorded: doctor flags A passing with no verify ever recorded

[Killed] ObjectLiteral
src/store.ts:851:13
 		// the case that needs surfacing.
 		const assess = run.phases.find((p) => p.name === "A");
 		if (assess?.verdict === "pass" && run.verify_count === 0) {
-			out.push({
-				kind: "unverified-pass",
-				run_id: run.run_id,
-				detail: `${run.repo ?? run.cwd}: A passed with no verify command ever recorded`,
-				cost_usd: runCost,
-			});
+			out.push({});
 		}
 		if (run.outcome === "open") {
killedBy: test/store.test.ts
statusReason: doctor flags A passing with no verify ever recorded: doctor flags A passing with no verify ever recorded

[Killed] StringLiteral
src/store.ts:852:11
 		const assess = run.phases.find((p) => p.name === "A");
 		if (assess?.verdict === "pass" && run.verify_count === 0) {
 			out.push({
-				kind: "unverified-pass",
+				kind: "",
 				run_id: run.run_id,
 				detail: `${run.repo ?? run.cwd}: A passed with no verify command ever recorded`,
killedBy: test/store.test.ts
statusReason: doctor flags A passing with no verify ever recorded: doctor flags A passing with no verify ever recorded

[Survived] LogicalOperator
src/store.ts:854:16
 			out.push({
 				kind: "unverified-pass",
 				run_id: run.run_id,
-				detail: `${run.repo ?? run.cwd}: A passed with no verify command ever recorded`,
+				detail: `${run.repo && run.cwd}: A passed with no verify command ever recorded`,
 				cost_usd: runCost,
 			});

[Survived] StringLiteral
src/store.ts:854:13
 			out.push({
 				kind: "unverified-pass",
 				run_id: run.run_id,
-				detail: `${run.repo ?? run.cwd}: A passed with no verify command ever recorded`,
+				detail: ``,
 				cost_usd: runCost,
 			});

[Killed] EqualityOperator
src/store.ts:858:7
 				cost_usd: runCost,
 			});
 		}
-		if (run.outcome === "open") {
+		if (run.outcome !== "open") {
 			const ageH = (now - Date.parse(run.started_at)) / 3.6e6;
 			if (ageH > staleHours) {
killedBy: test/store.test.ts
statusReason: doctor flags runs left open past the stale threshold: doctor flags runs left open past the stale threshold

[Killed] BlockStatement
src/store.ts:858:31
 				cost_usd: runCost,
 			});
 		}
-		if (run.outcome === "open") {
-			const ageH = (now - Date.parse(run.started_at)) / 3.6e6;
-			if (ageH > staleHours) {
-				out.push({
-					kind: "stale-open",
-					run_id: run.run_id,
-					detail: `${run.repo ?? run.cwd}: open for ${ageH.toFixed(1)}h with no run_end`,
-					cost_usd: runCost,
-				});
-			}
-		}
+		if (run.outcome === "open") {}
 		for (const p of run.phases) {
 			for (const [model, spend] of Object.entries(p.by_model)) {
killedBy: test/store.test.ts
statusReason: doctor flags runs left open past the stale threshold: doctor flags runs left open past the stale threshold

[Killed] ArithmeticOperator
src/store.ts:859:17
 			});
 		}
 		if (run.outcome === "open") {
-			const ageH = (now - Date.parse(run.started_at)) / 3.6e6;
+			const ageH = (now - Date.parse(run.started_at)) * 3.6e6;
 			if (ageH > staleHours) {
 				out.push({
killedBy: test/store.test.ts
statusReason: doctor flags runs left open past the stale threshold: doctor flags runs left open past the stale threshold

[Killed] ArithmeticOperator
src/store.ts:859:18
 			});
 		}
 		if (run.outcome === "open") {
-			const ageH = (now - Date.parse(run.started_at)) / 3.6e6;
+			const ageH = (now + Date.parse(run.started_at)) / 3.6e6;
 			if (ageH > staleHours) {
 				out.push({
killedBy: test/store.test.ts
statusReason: doctor flags runs left open past the stale threshold: doctor flags runs left open past the stale threshold

[Killed] ConditionalExpression
src/store.ts:860:8
 		}
 		if (run.outcome === "open") {
 			const ageH = (now - Date.parse(run.started_at)) / 3.6e6;
-			if (ageH > staleHours) {
+			if (true) {
 				out.push({
 					kind: "stale-open",
killedBy: test/store.test.ts
statusReason: doctor flags runs left open past the stale threshold: doctor flags runs left open past the stale threshold

[Killed] BlockStatement
src/store.ts:860:27
 		}
 		if (run.outcome === "open") {
 			const ageH = (now - Date.parse(run.started_at)) / 3.6e6;
-			if (ageH > staleHours) {
-				out.push({
-					kind: "stale-open",
-					run_id: run.run_id,
-					detail: `${run.repo ?? run.cwd}: open for ${ageH.toFixed(1)}h with no run_end`,
-					cost_usd: runCost,
-				});
-			}
+			if (ageH > staleHours) {}
 		}
 		for (const p of run.phases) {
killedBy: test/store.test.ts
statusReason: doctor flags runs left open past the stale threshold: doctor flags runs left open past the stale threshold

[Killed] ObjectLiteral
src/store.ts:861:14
 		if (run.outcome === "open") {
 			const ageH = (now - Date.parse(run.started_at)) / 3.6e6;
 			if (ageH > staleHours) {
-				out.push({
-					kind: "stale-open",
-					run_id: run.run_id,
-					detail: `${run.repo ?? run.cwd}: open for ${ageH.toFixed(1)}h with no run_end`,
-					cost_usd: runCost,
-				});
+				out.push({});
 			}
 		}
killedBy: test/store.test.ts
statusReason: doctor flags runs left open past the stale threshold: doctor flags runs left open past the stale threshold

[Survived] LogicalOperator
src/store.ts:864:17
 				out.push({
 					kind: "stale-open",
 					run_id: run.run_id,
-					detail: `${run.repo ?? run.cwd}: open for ${ageH.toFixed(1)}h with no run_end`,
+					detail: `${run.repo && run.cwd}: open for ${ageH.toFixed(1)}h with no run_end`,
 					cost_usd: runCost,
 				});

[Killed] BlockStatement
src/store.ts:869:31
 				});
 			}
 		}
-		for (const p of run.phases) {
-			for (const [model, spend] of Object.entries(p.by_model)) {
-				const spent = totalTokens(spend.tokens);
-				// A model that burned tokens but reported $0 has no price table entry
-				// either — actually unpriced, not just subscription-billed. This is the
-				// case notional pricing cannot paper over.
-				if (spend.cost_usd === 0 && spent > 0 && (spend.notional_cost_usd ?? 0) === 0) {
-					const cur = costless.get(model) ?? { events: 0, tokens: 0 };
-					cur.events += 1;
-					cur.tokens += spent;
-					costless.set(model, cur);
-				}
-			}
-		}
+		for (const p of run.phases) {}
 	}
 
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Killed] BlockStatement
src/store.ts:870:61
 			}
 		}
 		for (const p of run.phases) {
-			for (const [model, spend] of Object.entries(p.by_model)) {
-				const spent = totalTokens(spend.tokens);
-				// A model that burned tokens but reported $0 has no price table entry
-				// either — actually unpriced, not just subscription-billed. This is the
-				// case notional pricing cannot paper over.
-				if (spend.cost_usd === 0 && spent > 0 && (spend.notional_cost_usd ?? 0) === 0) {
-					const cur = costless.get(model) ?? { events: 0, tokens: 0 };
-					cur.events += 1;
-					cur.tokens += spent;
-					costless.set(model, cur);
-				}
-			}
+			for (const [model, spend] of Object.entries(p.by_model)) {}
 		}
 	}
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Killed] EqualityOperator
src/store.ts:875:33
 				// A model that burned tokens but reported $0 has no price table entry
 				// either — actually unpriced, not just subscription-billed. This is the
 				// case notional pricing cannot paper over.
-				if (spend.cost_usd === 0 && spent > 0 && (spend.notional_cost_usd ?? 0) === 0) {
+				if (spend.cost_usd === 0 && spent <= 0 && (spend.notional_cost_usd ?? 0) === 0) {
 					const cur = costless.get(model) ?? { events: 0, tokens: 0 };
 					cur.events += 1;
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Killed] ConditionalExpression
src/store.ts:875:9
 				// A model that burned tokens but reported $0 has no price table entry
 				// either — actually unpriced, not just subscription-billed. This is the
 				// case notional pricing cannot paper over.
-				if (spend.cost_usd === 0 && spent > 0 && (spend.notional_cost_usd ?? 0) === 0) {
+				if (true) {
 					const cur = costless.get(model) ?? { events: 0, tokens: 0 };
 					cur.events += 1;
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] LogicalOperator
src/store.ts:876:18
 				// either — actually unpriced, not just subscription-billed. This is the
 				// case notional pricing cannot paper over.
 				if (spend.cost_usd === 0 && spent > 0 && (spend.notional_cost_usd ?? 0) === 0) {
-					const cur = costless.get(model) ?? { events: 0, tokens: 0 };
+					const cur = costless.get(model) && {
+  events: 0,
+  tokens: 0
+};
 					cur.events += 1;
 					cur.tokens += spent;
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Survived] ObjectLiteral
src/store.ts:876:41
 				// either — actually unpriced, not just subscription-billed. This is the
 				// case notional pricing cannot paper over.
 				if (spend.cost_usd === 0 && spent > 0 && (spend.notional_cost_usd ?? 0) === 0) {
-					const cur = costless.get(model) ?? { events: 0, tokens: 0 };
+					const cur = costless.get(model) ?? {};
 					cur.events += 1;
 					cur.tokens += spent;

[Survived] AssignmentOperator
src/store.ts:877:6
 				// case notional pricing cannot paper over.
 				if (spend.cost_usd === 0 && spent > 0 && (spend.notional_cost_usd ?? 0) === 0) {
 					const cur = costless.get(model) ?? { events: 0, tokens: 0 };
-					cur.events += 1;
+					cur.events -= 1;
 					cur.tokens += spent;
 					costless.set(model, cur);

[Survived] AssignmentOperator
src/store.ts:878:6
 				if (spend.cost_usd === 0 && spent > 0 && (spend.notional_cost_usd ?? 0) === 0) {
 					const cur = costless.get(model) ?? { events: 0, tokens: 0 };
 					cur.events += 1;
-					cur.tokens += spent;
+					cur.tokens -= spent;
 					costless.set(model, cur);
 				}

[Killed] CallExpression
src/store.ts:879:6
 					const cur = costless.get(model) ?? { events: 0, tokens: 0 };
 					cur.events += 1;
 					cur.tokens += spent;
-					costless.set(model, cur);
+					;
 				}
 			}
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Killed] BlockStatement
src/store.ts:885:37
 		}
 	}
 
-	for (const [model, s] of costless) {
-		out.push({
-			kind: "costless-model",
-			detail: `${model}: ${s.events} phases, ${(s.tokens / 1e6).toFixed(1)}M tokens, no price found — add it to the price table`,
-			cost_usd: 0,
-		});
-	}
+	for (const [model, s] of costless) {}
 	if (total > 0 && unattributed > 0) {
 		out.push({
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Survived] ArithmeticOperator
src/store.ts:888:46
 	for (const [model, s] of costless) {
 		out.push({
 			kind: "costless-model",
-			detail: `${model}: ${s.events} phases, ${(s.tokens / 1e6).toFixed(1)}M tokens, no price found — add it to the price table`,
+			detail: `${model}: ${s.events} phases, ${(s.tokens * 1e6).toFixed(1)}M tokens, no price found — add it to the price table`,
 			cost_usd: 0,
 		});

[Killed] EqualityOperator
src/store.ts:892:19
 			cost_usd: 0,
 		});
 	}
-	if (total > 0 && unattributed > 0) {
+	if (total > 0 && unattributed >= 0) {
 		out.push({
 			kind: "unattributed",
killedBy: test/store-format.test.ts
statusReason: doctor is silent on a healthy run: doctor is silent on a healthy run

[Killed] ConditionalExpression
src/store.ts:892:6
 			cost_usd: 0,
 		});
 	}
-	if (total > 0 && unattributed > 0) {
+	if (true) {
 		out.push({
 			kind: "unattributed",
killedBy: test/store-format.test.ts
statusReason: doctor is silent on a healthy run: doctor is silent on a healthy run

[Killed] ArithmeticOperator
src/store.ts:895:70
 	if (total > 0 && unattributed > 0) {
 		out.push({
 			kind: "unattributed",
-			detail: `$${unattributed.toFixed(2)} of $${total.toFixed(2)} (${((100 * unattributed) / total).toFixed(0)}%) landed outside any phase`,
+			detail: `$${unattributed.toFixed(2)} of $${total.toFixed(2)} (${((100 / unattributed) / total).toFixed(0)}%) landed outside any phase`,
 			cost_usd: unattributed,
 		});
killedBy: test/store-format.test.ts
statusReason: the unattributed complaint reports a share of total spend: the unattributed complaint reports a share of total spend

[Killed] ArithmeticOperator
src/store.ts:895:69
 	if (total > 0 && unattributed > 0) {
 		out.push({
 			kind: "unattributed",
-			detail: `$${unattributed.toFixed(2)} of $${total.toFixed(2)} (${((100 * unattributed) / total).toFixed(0)}%) landed outside any phase`,
+			detail: `$${unattributed.toFixed(2)} of $${total.toFixed(2)} (${(100 * unattributed * total).toFixed(0)}%) landed outside any phase`,
 			cost_usd: unattributed,
 		});
killedBy: test/store-format.test.ts
statusReason: the unattributed complaint reports a share of total spend: the unattributed complaint reports a share of total spend

[Survived] ArrowFunction
src/store.ts:899:18
 			cost_usd: unattributed,
 		});
 	}
-	return out.sort((a, b) => b.cost_usd - a.cost_usd);
+	return out.sort(() => undefined);
 }
 

[Survived] MethodExpression
src/store.ts:899:9
 			cost_usd: unattributed,
 		});
 	}
-	return out.sort((a, b) => b.cost_usd - a.cost_usd);
+	return out;
 }
 
