[Killed] BlockStatement
src/store.ts:932:63
  * on Claude Code runs different models under different routing, and only one of the two
  * reports a price at all. Blending them produces a figure describing no setup that exists.
  */
-export function phaseTotalsByGroup(runs: Run[]): PhaseGroup[] {
-	const groups = new Map<string, Run[]>();
-	for (const run of runs) {
-		const key = `${run.craft_version ?? "unknown"} ${run.host}`;
-		const list = groups.get(key) ?? [];
-		list.push(run);
-		groups.set(key, list);
-	}
-	return [...groups.entries()]
-		.sort((a, b) => b[0].localeCompare(a[0]))
-		.map(([key, list]) => {
-			const [craft_version, host] = key.split(" ") as [string, Host];
-			return {
-				craft_version,
-				host,
-				n: list.length,
-				inferred: list.filter((r) => r.craft_version_source === "inferred").length,
-				totals: phaseTotals(list),
-			};
-		});
-}
+export function phaseTotalsByGroup(runs: Run[]): PhaseGroup[] {}
 
 export function phaseTotals(runs: Run[]): Map<PhaseName, PhaseTotal> {
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] BlockStatement
src/store.ts:934:26
  */
 export function phaseTotalsByGroup(runs: Run[]): PhaseGroup[] {
 	const groups = new Map<string, Run[]>();
-	for (const run of runs) {
-		const key = `${run.craft_version ?? "unknown"} ${run.host}`;
-		const list = groups.get(key) ?? [];
-		list.push(run);
-		groups.set(key, list);
-	}
+	for (const run of runs) {}
 	return [...groups.entries()]
 		.sort((a, b) => b[0].localeCompare(a[0]))
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] LogicalOperator
src/store.ts:935:18
 export function phaseTotalsByGroup(runs: Run[]): PhaseGroup[] {
 	const groups = new Map<string, Run[]>();
 	for (const run of runs) {
-		const key = `${run.craft_version ?? "unknown"} ${run.host}`;
+		const key = `${run.craft_version && "unknown"} ${run.host}`;
 		const list = groups.get(key) ?? [];
 		list.push(run);
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[NoCoverage] StringLiteral
src/store.ts:935:39
 export function phaseTotalsByGroup(runs: Run[]): PhaseGroup[] {
 	const groups = new Map<string, Run[]>();
 	for (const run of runs) {
-		const key = `${run.craft_version ?? "unknown"} ${run.host}`;
+		const key = `${run.craft_version ?? ""} ${run.host}`;
 		const list = groups.get(key) ?? [];
 		list.push(run);

[Killed] LogicalOperator
src/store.ts:936:16
 	const groups = new Map<string, Run[]>();
 	for (const run of runs) {
 		const key = `${run.craft_version ?? "unknown"} ${run.host}`;
-		const list = groups.get(key) ?? [];
+		const list = groups.get(key) && [];
 		list.push(run);
 		groups.set(key, list);
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] ArrayDeclaration
src/store.ts:936:35
 	const groups = new Map<string, Run[]>();
 	for (const run of runs) {
 		const key = `${run.craft_version ?? "unknown"} ${run.host}`;
-		const list = groups.get(key) ?? [];
+		const list = groups.get(key) ?? ["Stryker was here"];
 		list.push(run);
 		groups.set(key, list);
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] CallExpression
src/store.ts:937:3
 	for (const run of runs) {
 		const key = `${run.craft_version ?? "unknown"} ${run.host}`;
 		const list = groups.get(key) ?? [];
-		list.push(run);
+		;
 		groups.set(key, list);
 	}
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] CallExpression
src/store.ts:938:3
 		const key = `${run.craft_version ?? "unknown"} ${run.host}`;
 		const list = groups.get(key) ?? [];
 		list.push(run);
-		groups.set(key, list);
+		;
 	}
 	return [...groups.entries()]
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Survived] MethodExpression
src/store.ts:940:9
 		list.push(run);
 		groups.set(key, list);
 	}
-	return [...groups.entries()]
-		.sort((a, b) => b[0].localeCompare(a[0]))
+	return [...groups.entries()]
 		.map(([key, list]) => {
 			const [craft_version, host] = key.split(" ") as [string, Host];

[Survived] ArrowFunction
src/store.ts:941:9
 		groups.set(key, list);
 	}
 	return [...groups.entries()]
-		.sort((a, b) => b[0].localeCompare(a[0]))
+		.sort(() => undefined)
 		.map(([key, list]) => {
 			const [craft_version, host] = key.split(" ") as [string, Host];

[Killed] BlockStatement
src/store.ts:942:25
 	}
 	return [...groups.entries()]
 		.sort((a, b) => b[0].localeCompare(a[0]))
-		.map(([key, list]) => {
-			const [craft_version, host] = key.split(" ") as [string, Host];
-			return {
-				craft_version,
-				host,
-				n: list.length,
-				inferred: list.filter((r) => r.craft_version_source === "inferred").length,
-				totals: phaseTotals(list),
-			};
-		});
+		.map(([key, list]) => {});
 }
 
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] ArrowFunction
src/store.ts:948:27
 				craft_version,
 				host,
 				n: list.length,
-				inferred: list.filter((r) => r.craft_version_source === "inferred").length,
+				inferred: list.filter(() => undefined).length,
 				totals: phaseTotals(list),
 			};
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] ConditionalExpression
src/store.ts:948:34
 				craft_version,
 				host,
 				n: list.length,
-				inferred: list.filter((r) => r.craft_version_source === "inferred").length,
+				inferred: list.filter((r) => false).length,
 				totals: phaseTotals(list),
 			};
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] BlockStatement
src/store.ts:954:70
 		});
 }
 
-export function phaseTotals(runs: Run[]): Map<PhaseName, PhaseTotal> {
-	const map = new Map<PhaseName, PhaseTotal>();
-	for (const run of runs) {
-		for (const p of run.phases) {
-			const cur = map.get(p.name) ?? { cost: 0, notional: 0, ms: 0, n: 0, turns: 0, tokens: emptyTokens() };
-			cur.cost += p.cost_usd;
-			cur.notional += p.notional_cost_usd ?? p.cost_usd;
-			cur.ms += p.duration_ms;
-			cur.turns += p.turns;
-			addTokens(cur.tokens, p.tokens);
-			if (p.started_at) cur.n += 1;
-			map.set(p.name, cur);
-		}
-	}
-	return map;
-}
+export function phaseTotals(runs: Run[]): Map<PhaseName, PhaseTotal> {}
 
 /**
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] BlockStatement
src/store.ts:956:26
 
 export function phaseTotals(runs: Run[]): Map<PhaseName, PhaseTotal> {
 	const map = new Map<PhaseName, PhaseTotal>();
-	for (const run of runs) {
-		for (const p of run.phases) {
-			const cur = map.get(p.name) ?? { cost: 0, notional: 0, ms: 0, n: 0, turns: 0, tokens: emptyTokens() };
-			cur.cost += p.cost_usd;
-			cur.notional += p.notional_cost_usd ?? p.cost_usd;
-			cur.ms += p.duration_ms;
-			cur.turns += p.turns;
-			addTokens(cur.tokens, p.tokens);
-			if (p.started_at) cur.n += 1;
-			map.set(p.name, cur);
-		}
-	}
+	for (const run of runs) {}
 	return map;
 }
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] BlockStatement
src/store.ts:957:31
 export function phaseTotals(runs: Run[]): Map<PhaseName, PhaseTotal> {
 	const map = new Map<PhaseName, PhaseTotal>();
 	for (const run of runs) {
-		for (const p of run.phases) {
-			const cur = map.get(p.name) ?? { cost: 0, notional: 0, ms: 0, n: 0, turns: 0, tokens: emptyTokens() };
-			cur.cost += p.cost_usd;
-			cur.notional += p.notional_cost_usd ?? p.cost_usd;
-			cur.ms += p.duration_ms;
-			cur.turns += p.turns;
-			addTokens(cur.tokens, p.tokens);
-			if (p.started_at) cur.n += 1;
-			map.set(p.name, cur);
-		}
+		for (const p of run.phases) {}
 	}
 	return map;
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] LogicalOperator
src/store.ts:958:16
 	const map = new Map<PhaseName, PhaseTotal>();
 	for (const run of runs) {
 		for (const p of run.phases) {
-			const cur = map.get(p.name) ?? { cost: 0, notional: 0, ms: 0, n: 0, turns: 0, tokens: emptyTokens() };
+			const cur = map.get(p.name) && {
+  cost: 0,
+  notional: 0,
+  ms: 0,
+  n: 0,
+  turns: 0,
+  tokens: emptyTokens()
+};
 			cur.cost += p.cost_usd;
 			cur.notional += p.notional_cost_usd ?? p.cost_usd;
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] ObjectLiteral
src/store.ts:958:35
 	const map = new Map<PhaseName, PhaseTotal>();
 	for (const run of runs) {
 		for (const p of run.phases) {
-			const cur = map.get(p.name) ?? { cost: 0, notional: 0, ms: 0, n: 0, turns: 0, tokens: emptyTokens() };
+			const cur = map.get(p.name) ?? {};
 			cur.cost += p.cost_usd;
 			cur.notional += p.notional_cost_usd ?? p.cost_usd;
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] AssignmentOperator
src/store.ts:959:4
 	for (const run of runs) {
 		for (const p of run.phases) {
 			const cur = map.get(p.name) ?? { cost: 0, notional: 0, ms: 0, n: 0, turns: 0, tokens: emptyTokens() };
-			cur.cost += p.cost_usd;
+			cur.cost -= p.cost_usd;
 			cur.notional += p.notional_cost_usd ?? p.cost_usd;
 			cur.ms += p.duration_ms;
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Survived] LogicalOperator
src/store.ts:960:20
 		for (const p of run.phases) {
 			const cur = map.get(p.name) ?? { cost: 0, notional: 0, ms: 0, n: 0, turns: 0, tokens: emptyTokens() };
 			cur.cost += p.cost_usd;
-			cur.notional += p.notional_cost_usd ?? p.cost_usd;
+			cur.notional += p.notional_cost_usd && p.cost_usd;
 			cur.ms += p.duration_ms;
 			cur.turns += p.turns;

[Survived] AssignmentOperator
src/store.ts:960:4
 		for (const p of run.phases) {
 			const cur = map.get(p.name) ?? { cost: 0, notional: 0, ms: 0, n: 0, turns: 0, tokens: emptyTokens() };
 			cur.cost += p.cost_usd;
-			cur.notional += p.notional_cost_usd ?? p.cost_usd;
+			cur.notional -= p.notional_cost_usd ?? p.cost_usd;
 			cur.ms += p.duration_ms;
 			cur.turns += p.turns;

[Killed] AssignmentOperator
src/store.ts:961:4
 			const cur = map.get(p.name) ?? { cost: 0, notional: 0, ms: 0, n: 0, turns: 0, tokens: emptyTokens() };
 			cur.cost += p.cost_usd;
 			cur.notional += p.notional_cost_usd ?? p.cost_usd;
-			cur.ms += p.duration_ms;
+			cur.ms -= p.duration_ms;
 			cur.turns += p.turns;
 			addTokens(cur.tokens, p.tokens);
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Survived] AssignmentOperator
src/store.ts:962:4
 			cur.cost += p.cost_usd;
 			cur.notional += p.notional_cost_usd ?? p.cost_usd;
 			cur.ms += p.duration_ms;
-			cur.turns += p.turns;
+			cur.turns -= p.turns;
 			addTokens(cur.tokens, p.tokens);
 			if (p.started_at) cur.n += 1;

[Survived] CallExpression
src/store.ts:963:4
 			cur.notional += p.notional_cost_usd ?? p.cost_usd;
 			cur.ms += p.duration_ms;
 			cur.turns += p.turns;
-			addTokens(cur.tokens, p.tokens);
+			;
 			if (p.started_at) cur.n += 1;
 			map.set(p.name, cur);

[Survived] ConditionalExpression
src/store.ts:964:8
 			cur.ms += p.duration_ms;
 			cur.turns += p.turns;
 			addTokens(cur.tokens, p.tokens);
-			if (p.started_at) cur.n += 1;
+			if (false) cur.n += 1;
 			map.set(p.name, cur);
 		}

[Survived] AssignmentOperator
src/store.ts:964:22
 			cur.ms += p.duration_ms;
 			cur.turns += p.turns;
 			addTokens(cur.tokens, p.tokens);
-			if (p.started_at) cur.n += 1;
+			if (p.started_at) cur.n -= 1;
 			map.set(p.name, cur);
 		}

[Killed] CallExpression
src/store.ts:965:4
 			cur.turns += p.turns;
 			addTokens(cur.tokens, p.tokens);
 			if (p.started_at) cur.n += 1;
-			map.set(p.name, cur);
+			;
 		}
 	}
killedBy: test/store.test.ts
statusReason: phaseTotalsByGroup keeps v3 and v4 counsel apart: phaseTotalsByGroup keeps v3 and v4 counsel apart

[Killed] BlockStatement
src/store.ts:999:26
 
 export function modelTotals(runs: Run[]): ModelTotal[] {
 	const map = new Map<string, ModelTotal>();
-	for (const run of runs) {
-		for (const p of run.phases) {
-			for (const [model, spend] of Object.entries(p.by_model)) {
-				const key = `${run.host} ${model}`;
-				const cur = map.get(key) ?? {
-					model,
-					host: run.host,
-					provider: spend.provider,
-					events: 0,
-					turns: 0,
-					cost: 0,
-					notional: 0,
-					tokens: emptyTokens(),
-					costless: false,
-					unpriced: false,
-				};
-				cur.events += spend.events;
-				cur.turns += spend.turns;
-				cur.cost += spend.cost_usd;
-				cur.notional += spend.notional_cost_usd ?? spend.cost_usd;
-				addTokens(cur.tokens, spend.tokens);
-				map.set(key, cur);
-			}
-		}
-	}
+	for (const run of runs) {}
 	for (const m of map.values()) {
 		m.costless = m.cost === 0 && totalTokens(m.tokens) > 0;
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Killed] BlockStatement
src/store.ts:1000:31
 export function modelTotals(runs: Run[]): ModelTotal[] {
 	const map = new Map<string, ModelTotal>();
 	for (const run of runs) {
-		for (const p of run.phases) {
-			for (const [model, spend] of Object.entries(p.by_model)) {
-				const key = `${run.host} ${model}`;
-				const cur = map.get(key) ?? {
-					model,
-					host: run.host,
-					provider: spend.provider,
-					events: 0,
-					turns: 0,
-					cost: 0,
-					notional: 0,
-					tokens: emptyTokens(),
-					costless: false,
-					unpriced: false,
-				};
-				cur.events += spend.events;
-				cur.turns += spend.turns;
-				cur.cost += spend.cost_usd;
-				cur.notional += spend.notional_cost_usd ?? spend.cost_usd;
-				addTokens(cur.tokens, spend.tokens);
-				map.set(key, cur);
-			}
-		}
+		for (const p of run.phases) {}
 	}
 	for (const m of map.values()) {
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Killed] BlockStatement
src/store.ts:1001:61
 	const map = new Map<string, ModelTotal>();
 	for (const run of runs) {
 		for (const p of run.phases) {
-			for (const [model, spend] of Object.entries(p.by_model)) {
-				const key = `${run.host} ${model}`;
-				const cur = map.get(key) ?? {
-					model,
-					host: run.host,
-					provider: spend.provider,
-					events: 0,
-					turns: 0,
-					cost: 0,
-					notional: 0,
-					tokens: emptyTokens(),
-					costless: false,
-					unpriced: false,
-				};
-				cur.events += spend.events;
-				cur.turns += spend.turns;
-				cur.cost += spend.cost_usd;
-				cur.notional += spend.notional_cost_usd ?? spend.cost_usd;
-				addTokens(cur.tokens, spend.tokens);
-				map.set(key, cur);
-			}
+			for (const [model, spend] of Object.entries(p.by_model)) {}
 		}
 	}
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Killed] LogicalOperator
src/store.ts:1003:17
 		for (const p of run.phases) {
 			for (const [model, spend] of Object.entries(p.by_model)) {
 				const key = `${run.host} ${model}`;
-				const cur = map.get(key) ?? {
-					model,
-					host: run.host,
-					provider: spend.provider,
-					events: 0,
-					turns: 0,
-					cost: 0,
-					notional: 0,
-					tokens: emptyTokens(),
-					costless: false,
-					unpriced: false,
-				};
+				const cur = map.get(key) && {
+  model,
+  host: run.host,
+  provider: spend.provider,
+  events: 0,
+  turns: 0,
+  cost: 0,
+  notional: 0,
+  tokens: emptyTokens(),
+  costless: false,
+  unpriced: false
+};
 				cur.events += spend.events;
 				cur.turns += spend.turns;
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Survived] BooleanLiteral
src/store.ts:1012:16
 					cost: 0,
 					notional: 0,
 					tokens: emptyTokens(),
-					costless: false,
+					costless: true,
 					unpriced: false,
 				};

[Survived] BooleanLiteral
src/store.ts:1013:16
 					notional: 0,
 					tokens: emptyTokens(),
 					costless: false,
-					unpriced: false,
+					unpriced: true,
 				};
 				cur.events += spend.events;

[Survived] AssignmentOperator
src/store.ts:1015:5
 					costless: false,
 					unpriced: false,
 				};
-				cur.events += spend.events;
+				cur.events -= spend.events;
 				cur.turns += spend.turns;
 				cur.cost += spend.cost_usd;

[Killed] AssignmentOperator
src/store.ts:1016:5
 					unpriced: false,
 				};
 				cur.events += spend.events;
-				cur.turns += spend.turns;
+				cur.turns -= spend.turns;
 				cur.cost += spend.cost_usd;
 				cur.notional += spend.notional_cost_usd ?? spend.cost_usd;
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Survived] AssignmentOperator
src/store.ts:1017:5
 				};
 				cur.events += spend.events;
 				cur.turns += spend.turns;
-				cur.cost += spend.cost_usd;
+				cur.cost -= spend.cost_usd;
 				cur.notional += spend.notional_cost_usd ?? spend.cost_usd;
 				addTokens(cur.tokens, spend.tokens);

[Killed] LogicalOperator
src/store.ts:1018:21
 				cur.events += spend.events;
 				cur.turns += spend.turns;
 				cur.cost += spend.cost_usd;
-				cur.notional += spend.notional_cost_usd ?? spend.cost_usd;
+				cur.notional += spend.notional_cost_usd && spend.cost_usd;
 				addTokens(cur.tokens, spend.tokens);
 				map.set(key, cur);
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] AssignmentOperator
src/store.ts:1018:5
 				cur.events += spend.events;
 				cur.turns += spend.turns;
 				cur.cost += spend.cost_usd;
-				cur.notional += spend.notional_cost_usd ?? spend.cost_usd;
+				cur.notional -= spend.notional_cost_usd ?? spend.cost_usd;
 				addTokens(cur.tokens, spend.tokens);
 				map.set(key, cur);
killedBy: test/cli.test.ts
statusReason: models marks a subscription model n/a and prices it notionally: models marks a subscription model n/a and prices it notionally

[Killed] CallExpression
src/store.ts:1019:5
 				cur.turns += spend.turns;
 				cur.cost += spend.cost_usd;
 				cur.notional += spend.notional_cost_usd ?? spend.cost_usd;
-				addTokens(cur.tokens, spend.tokens);
+				;
 				map.set(key, cur);
 			}
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Killed] CallExpression
src/store.ts:1020:5
 				cur.cost += spend.cost_usd;
 				cur.notional += spend.notional_cost_usd ?? spend.cost_usd;
 				addTokens(cur.tokens, spend.tokens);
-				map.set(key, cur);
+				;
 			}
 		}
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Killed] BlockStatement
src/store.ts:1024:32
 			}
 		}
 	}
-	for (const m of map.values()) {
-		m.costless = m.cost === 0 && totalTokens(m.tokens) > 0;
-		// Notional fell back to actual (both zero) despite real token volume: the
-		// price table has no entry for this model, not just a $0 subscription.
-		m.unpriced = m.costless && m.notional === 0;
-	}
+	for (const m of map.values()) {}
 	return [...map.values()].sort((a, b) => totalTokens(b.tokens) - totalTokens(a.tokens));
 }
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Killed] LogicalOperator
src/store.ts:1025:16
 		}
 	}
 	for (const m of map.values()) {
-		m.costless = m.cost === 0 && totalTokens(m.tokens) > 0;
+		m.costless = m.cost === 0 || totalTokens(m.tokens) > 0;
 		// Notional fell back to actual (both zero) despite real token volume: the
 		// price table has no entry for this model, not just a $0 subscription.
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Killed] ConditionalExpression
src/store.ts:1025:16
 		}
 	}
 	for (const m of map.values()) {
-		m.costless = m.cost === 0 && totalTokens(m.tokens) > 0;
+		m.costless = true;
 		// Notional fell back to actual (both zero) despite real token volume: the
 		// price table has no entry for this model, not just a $0 subscription.
killedBy: test/store.test.ts
statusReason: a multi-model phase splits tokens per model instead of dropping them: a multi-model phase splits tokens per model instead of dropping them

[Killed] ConditionalExpression
src/store.ts:1028:16
 		m.costless = m.cost === 0 && totalTokens(m.tokens) > 0;
 		// Notional fell back to actual (both zero) despite real token volume: the
 		// price table has no entry for this model, not just a $0 subscription.
-		m.unpriced = m.costless && m.notional === 0;
+		m.unpriced = true;
 	}
 	return [...map.values()].sort((a, b) => totalTokens(b.tokens) - totalTokens(a.tokens));
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] ConditionalExpression
src/store.ts:1028:30
 		m.costless = m.cost === 0 && totalTokens(m.tokens) > 0;
 		// Notional fell back to actual (both zero) despite real token volume: the
 		// price table has no entry for this model, not just a $0 subscription.
-		m.unpriced = m.costless && m.notional === 0;
+		m.unpriced = m.costless && true;
 	}
 	return [...map.values()].sort((a, b) => totalTokens(b.tokens) - totalTokens(a.tokens));
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Survived] MethodExpression
src/store.ts:1030:9
 		// price table has no entry for this model, not just a $0 subscription.
 		m.unpriced = m.costless && m.notional === 0;
 	}
-	return [...map.values()].sort((a, b) => totalTokens(b.tokens) - totalTokens(a.tokens));
+	return [...map.values()];
 }
 

[Survived] ArrowFunction
src/store.ts:1030:32
 		// price table has no entry for this model, not just a $0 subscription.
 		m.unpriced = m.costless && m.notional === 0;
 	}
-	return [...map.values()].sort((a, b) => totalTokens(b.tokens) - totalTokens(a.tokens));
+	return [...map.values()].sort(() => undefined);
 }
 

[Killed] BlockStatement
src/store.ts:1033:48
 	return [...map.values()].sort((a, b) => totalTokens(b.tokens) - totalTokens(a.tokens));
 }
 
-export function totalTokens(t: Tokens): number {
-	return t.input + t.output + t.cacheRead + t.cacheWrite;
-}
+export function totalTokens(t: Tokens): number {}
 
 function short(n: number): string {
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Killed] ArithmeticOperator
src/store.ts:1034:9
 }
 
 export function totalTokens(t: Tokens): number {
-	return t.input + t.output + t.cacheRead + t.cacheWrite;
+	return t.input + t.output - t.cacheRead + t.cacheWrite;
 }
 
killedBy: test/store.test.ts
statusReason: doctor flags models that burn tokens but report no cost: doctor flags models that burn tokens but report no cost

[Survived] ArithmeticOperator
src/store.ts:1034:9
 }
 
 export function totalTokens(t: Tokens): number {
-	return t.input + t.output + t.cacheRead + t.cacheWrite;
+	return t.input + t.output + t.cacheRead - t.cacheWrite;
 }
 

[Killed] BlockStatement
src/store.ts:1037:35
 	return t.input + t.output + t.cacheRead + t.cacheWrite;
 }
 
-function short(n: number): string {
-	if (n >= 1e6) return `${(n / 1e6).toFixed(1)}M`;
-	if (n >= 1e3) return `${(n / 1e3).toFixed(0)}k`;
-	return String(n);
-}
+function short(n: number): string {}
 
 export function fmtTokens(t: Tokens): string {
killedBy: test/store-format.test.ts
statusReason: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash

[Killed] EqualityOperator
src/store.ts:1038:6
 }
 
 function short(n: number): string {
-	if (n >= 1e6) return `${(n / 1e6).toFixed(1)}M`;
+	if (n < 1e6) return `${(n / 1e6).toFixed(1)}M`;
 	if (n >= 1e3) return `${(n / 1e3).toFixed(0)}k`;
 	return String(n);
killedBy: test/store-format.test.ts
statusReason: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash

[Killed] ArithmeticOperator
src/store.ts:1038:27
 }
 
 function short(n: number): string {
-	if (n >= 1e6) return `${(n / 1e6).toFixed(1)}M`;
+	if (n >= 1e6) return `${(n * 1e6).toFixed(1)}M`;
 	if (n >= 1e3) return `${(n / 1e3).toFixed(0)}k`;
 	return String(n);
killedBy: test/store-format.test.ts
statusReason: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash

[Killed] EqualityOperator
src/store.ts:1039:6
 
 function short(n: number): string {
 	if (n >= 1e6) return `${(n / 1e6).toFixed(1)}M`;
-	if (n >= 1e3) return `${(n / 1e3).toFixed(0)}k`;
+	if (n > 1e3) return `${(n / 1e3).toFixed(0)}k`;
 	return String(n);
 }
killedBy: test/store-format.test.ts
statusReason: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash

[Killed] ArithmeticOperator
src/store.ts:1039:27
 
 function short(n: number): string {
 	if (n >= 1e6) return `${(n / 1e6).toFixed(1)}M`;
-	if (n >= 1e3) return `${(n / 1e3).toFixed(0)}k`;
+	if (n >= 1e3) return `${(n * 1e3).toFixed(0)}k`;
 	return String(n);
 }
killedBy: test/store-format.test.ts
statusReason: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash

[Killed] BlockStatement
src/store.ts:1043:46
 	return String(n);
 }
 
-export function fmtTokens(t: Tokens): string {
-	if (totalTokens(t) === 0) return "-";
-	return `${short(t.input)}in/${short(t.output)}out/${short(t.cacheRead)}cache`;
-}
+export function fmtTokens(t: Tokens): string {}
 
killedBy: test/store-format.test.ts
statusReason: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash

[Killed] ConditionalExpression
src/store.ts:1044:6
 }
 
 export function fmtTokens(t: Tokens): string {
-	if (totalTokens(t) === 0) return "-";
+	if (false) return "-";
 	return `${short(t.input)}in/${short(t.output)}out/${short(t.cacheRead)}cache`;
 }
killedBy: test/store-format.test.ts
statusReason: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash

[Killed] EqualityOperator
src/store.ts:1044:6
 }
 
 export function fmtTokens(t: Tokens): string {
-	if (totalTokens(t) === 0) return "-";
+	if (totalTokens(t) !== 0) return "-";
 	return `${short(t.input)}in/${short(t.output)}out/${short(t.cacheRead)}cache`;
 }
killedBy: test/store-format.test.ts
statusReason: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash: fmtTokens abbreviates by magnitude and collapses an empty phase to a dash
