[Killed] BlockStatement
src/agent-port.ts:146:57
 }
 
 /** Render the ported agent as a Claude Code agent file. */
-export function renderAgent(agent: PortedAgent): string {
-	const front = [
-		"---",
-		`name: ${agent.name}`,
-		`description: ${agent.description}`,
-		// Omitting `tools` entirely would grant every tool, so an empty list is written
-		// as an empty list.
-		`tools: ${agent.tools.join(", ")}`,
-		"---",
-	];
-	// No `model`: see portAgent. Body carried through byte-for-byte — it is the
-	// agent's actual instructions, and this translation is about frontmatter only.
-	return `${front.join("\n")}\n${agent.body}`;
-}
+export function renderAgent(agent: PortedAgent): string {}
 
killedBy: test/agent-port.test.ts
statusReason: the rendered file carries no model, so each host routes the agent itself: the rendered file carries no model, so each host routes the agent itself

[Killed] StringLiteral
src/agent-port.ts:149:3
 export function renderAgent(agent: PortedAgent): string {
 	const front = [
 		"---",
-		`name: ${agent.name}`,
+		``,
 		`description: ${agent.description}`,
 		// Omitting `tools` entirely would grant every tool, so an empty list is written
killedBy: test/agent-port.test.ts
statusReason: the rendered file carries no model, so each host routes the agent itself: the rendered file carries no model, so each host routes the agent itself

[Killed] StringLiteral
src/agent-port.ts:150:3
 	const front = [
 		"---",
 		`name: ${agent.name}`,
-		`description: ${agent.description}`,
+		``,
 		// Omitting `tools` entirely would grant every tool, so an empty list is written
 		// as an empty list.
killedBy: test/agent-port.test.ts
statusReason: the rendered file carries no model, so each host routes the agent itself: the rendered file carries no model, so each host routes the agent itself

[Killed] StringLiteral
src/agent-port.ts:154:3
 		// Omitting `tools` entirely would grant every tool, so an empty list is written
 		// as an empty list.
 		`tools: ${agent.tools.join(", ")}`,
-		"---",
+		"",
 	];
 	// No `model`: see portAgent. Body carried through byte-for-byte — it is the
killedBy: test/agent-port.test.ts
statusReason: the rendered file carries no model, so each host routes the agent itself: the rendered file carries no model, so each host routes the agent itself
