[Killed] Regex
src/diff-ranges.ts:22:14
 }
 
 /** `@@ -oldStart,oldCount +newStart,newCount @@` — counts are omitted when 1. */
-const HUNK = /^@@ -\d+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/;
+const HUNK = /^@@ -\d+(?:,\D+)? \+(\d+)(?:,(\d+))? @@/;
 // `b/` is optional so that `+++ /dev/null` matches too. It must: a deleted file
 // needs to clear the current file, and if the header does not match at all the
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] Regex
src/diff-ranges.ts:22:14
 }
 
 /** `@@ -oldStart,oldCount +newStart,newCount @@` — counts are omitted when 1. */
-const HUNK = /^@@ -\d+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/;
+const HUNK = /^@@ -\D+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/;
 // `b/` is optional so that `+++ /dev/null` matches too. It must: a deleted file
 // needs to clear the current file, and if the header does not match at all the
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] Regex
src/diff-ranges.ts:28:21
 // previous file stays current and the deletion's hunks are attributed to it.
 // Deletions happen to carry `+0,0` hunks that are dropped anyway, so this was
 // previously correct only by luck.
-const FILE_HEADER = /^\+\+\+ (?:b\/)?(.+)$/;
+const FILE_HEADER = /^\+\+\+ (?:b\/)?(.)$/;
 
 /**
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] BlockStatement
src/diff-ranges.ts:37:60
  * the working tree. A pure deletion (`+0,0`) yields no range — there is nothing
  * left to mutate — which is correct, not an omission.
  */
-export function parseDiffRanges(diff: string): LineRange[] {
-	const ranges: LineRange[] = [];
-	let file: string | null = null;
-	for (const line of diff.split("\n")) {
-		const header = FILE_HEADER.exec(line);
-		if (header) {
-			// `/dev/null` on the + side means the file was deleted; nothing to mutate.
-			file = header[1] === "/dev/null" ? null : header[1];
-			continue;
-		}
-		if (!file) continue;
-		const hunk = HUNK.exec(line);
-		if (!hunk) continue;
-		const start = Number(hunk[1]);
-		// An absent count means exactly one line. A count of zero means the change
-		// was a deletion anchored after `start`, so there is no new line to mutate.
-		const count = hunk[2] === undefined ? 1 : Number(hunk[2]);
-		if (count === 0) continue;
-		ranges.push({ file, start, end: start + count - 1 });
-	}
-	return ranges;
-}
+export function parseDiffRanges(diff: string): LineRange[] {}
 
 /**
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] ArrayDeclaration
src/diff-ranges.ts:38:30
  * left to mutate — which is correct, not an omission.
  */
 export function parseDiffRanges(diff: string): LineRange[] {
-	const ranges: LineRange[] = [];
+	const ranges: LineRange[] = ["Stryker was here"];
 	let file: string | null = null;
 	for (const line of diff.split("\n")) {
killedBy: test/diff-ranges.test.ts
statusReason: parses a normal hunk into an inclusive range: parses a normal hunk into an inclusive range

[Killed] BlockStatement
src/diff-ranges.ts:40:39
 export function parseDiffRanges(diff: string): LineRange[] {
 	const ranges: LineRange[] = [];
 	let file: string | null = null;
-	for (const line of diff.split("\n")) {
-		const header = FILE_HEADER.exec(line);
-		if (header) {
-			// `/dev/null` on the + side means the file was deleted; nothing to mutate.
-			file = header[1] === "/dev/null" ? null : header[1];
-			continue;
-		}
-		if (!file) continue;
-		const hunk = HUNK.exec(line);
-		if (!hunk) continue;
-		const start = Number(hunk[1]);
-		// An absent count means exactly one line. A count of zero means the change
-		// was a deletion anchored after `start`, so there is no new line to mutate.
-		const count = hunk[2] === undefined ? 1 : Number(hunk[2]);
-		if (count === 0) continue;
-		ranges.push({ file, start, end: start + count - 1 });
-	}
+	for (const line of diff.split("\n")) {}
 	return ranges;
 }
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/diff-ranges.ts:42:7
 	let file: string | null = null;
 	for (const line of diff.split("\n")) {
 		const header = FILE_HEADER.exec(line);
-		if (header) {
+		if (true) {
 			// `/dev/null` on the + side means the file was deleted; nothing to mutate.
 			file = header[1] === "/dev/null" ? null : header[1];
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] BlockStatement
src/diff-ranges.ts:42:15
 	let file: string | null = null;
 	for (const line of diff.split("\n")) {
 		const header = FILE_HEADER.exec(line);
-		if (header) {
-			// `/dev/null` on the + side means the file was deleted; nothing to mutate.
-			file = header[1] === "/dev/null" ? null : header[1];
-			continue;
-		}
+		if (header) {}
 		if (!file) continue;
 		const hunk = HUNK.exec(line);
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/diff-ranges.ts:44:11
 		const header = FILE_HEADER.exec(line);
 		if (header) {
 			// `/dev/null` on the + side means the file was deleted; nothing to mutate.
-			file = header[1] === "/dev/null" ? null : header[1];
+			file = true ? null : header[1];
 			continue;
 		}
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] EqualityOperator
src/diff-ranges.ts:44:11
 		const header = FILE_HEADER.exec(line);
 		if (header) {
 			// `/dev/null` on the + side means the file was deleted; nothing to mutate.
-			file = header[1] === "/dev/null" ? null : header[1];
+			file = header[1] !== "/dev/null" ? null : header[1];
 			continue;
 		}
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] BooleanLiteral
src/diff-ranges.ts:47:7
 			file = header[1] === "/dev/null" ? null : header[1];
 			continue;
 		}
-		if (!file) continue;
+		if (file) continue;
 		const hunk = HUNK.exec(line);
 		if (!hunk) continue;
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/diff-ranges.ts:47:7
 			file = header[1] === "/dev/null" ? null : header[1];
 			continue;
 		}
-		if (!file) continue;
+		if (true) continue;
 		const hunk = HUNK.exec(line);
 		if (!hunk) continue;
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/diff-ranges.ts:49:7
 		}
 		if (!file) continue;
 		const hunk = HUNK.exec(line);
-		if (!hunk) continue;
+		if (false) continue;
 		const start = Number(hunk[1]);
 		// An absent count means exactly one line. A count of zero means the change
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] ConditionalExpression
src/diff-ranges.ts:49:7
 		}
 		if (!file) continue;
 		const hunk = HUNK.exec(line);
-		if (!hunk) continue;
+		if (true) continue;
 		const start = Number(hunk[1]);
 		// An absent count means exactly one line. A count of zero means the change
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] EqualityOperator
src/diff-ranges.ts:53:17
 		const start = Number(hunk[1]);
 		// An absent count means exactly one line. A count of zero means the change
 		// was a deletion anchored after `start`, so there is no new line to mutate.
-		const count = hunk[2] === undefined ? 1 : Number(hunk[2]);
+		const count = hunk[2] !== undefined ? 1 : Number(hunk[2]);
 		if (count === 0) continue;
 		ranges.push({ file, start, end: start + count - 1 });
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/diff-ranges.ts:53:17
 		const start = Number(hunk[1]);
 		// An absent count means exactly one line. A count of zero means the change
 		// was a deletion anchored after `start`, so there is no new line to mutate.
-		const count = hunk[2] === undefined ? 1 : Number(hunk[2]);
+		const count = true ? 1 : Number(hunk[2]);
 		if (count === 0) continue;
 		ranges.push({ file, start, end: start + count - 1 });
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] EqualityOperator
src/diff-ranges.ts:54:7
 		// An absent count means exactly one line. A count of zero means the change
 		// was a deletion anchored after `start`, so there is no new line to mutate.
 		const count = hunk[2] === undefined ? 1 : Number(hunk[2]);
-		if (count === 0) continue;
+		if (count !== 0) continue;
 		ranges.push({ file, start, end: start + count - 1 });
 	}
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ConditionalExpression
src/diff-ranges.ts:54:7
 		// An absent count means exactly one line. A count of zero means the change
 		// was a deletion anchored after `start`, so there is no new line to mutate.
 		const count = hunk[2] === undefined ? 1 : Number(hunk[2]);
-		if (count === 0) continue;
+		if (false) continue;
 		ranges.push({ file, start, end: start + count - 1 });
 	}
killedBy: test/diff-ranges.test.ts
statusReason: a pure deletion yields no range — nothing remains to mutate: a pure deletion yields no range — nothing remains to mutate

[Killed] ArithmeticOperator
src/diff-ranges.ts:55:35
 		// was a deletion anchored after `start`, so there is no new line to mutate.
 		const count = hunk[2] === undefined ? 1 : Number(hunk[2]);
 		if (count === 0) continue;
-		ranges.push({ file, start, end: start + count - 1 });
+		ranges.push({ file, start, end: start + count + 1 });
 	}
 	return ranges;
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ArithmeticOperator
src/diff-ranges.ts:55:35
 		// was a deletion anchored after `start`, so there is no new line to mutate.
 		const count = hunk[2] === undefined ? 1 : Number(hunk[2]);
 		if (count === 0) continue;
-		ranges.push({ file, start, end: start + count - 1 });
+		ranges.push({ file, start, end: start - count - 1 });
 	}
 	return ranges;
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] BlockStatement
src/diff-ranges.ts:68:16
 export function filterSourceRanges(
 	ranges: LineRange[],
 	opts: { include: RegExp[]; exclude: RegExp[] },
-): LineRange[] {
-	return ranges.filter(
-		(r) => opts.include.some((re) => re.test(r.file)) && !opts.exclude.some((re) => re.test(r.file)),
-	);
-}
+): LineRange[] {}
 
 /**
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] MethodExpression
src/diff-ranges.ts:69:9
 	ranges: LineRange[],
 	opts: { include: RegExp[]; exclude: RegExp[] },
 ): LineRange[] {
-	return ranges.filter(
-		(r) => opts.include.some((re) => re.test(r.file)) && !opts.exclude.some((re) => re.test(r.file)),
-	);
+	return ranges;
 }
 
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] ConditionalExpression
src/diff-ranges.ts:70:10
 	opts: { include: RegExp[]; exclude: RegExp[] },
 ): LineRange[] {
 	return ranges.filter(
-		(r) => opts.include.some((re) => re.test(r.file)) && !opts.exclude.some((re) => re.test(r.file)),
+		(r) => true,
 	);
 }
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] BooleanLiteral
src/diff-ranges.ts:70:56
 	opts: { include: RegExp[]; exclude: RegExp[] },
 ): LineRange[] {
 	return ranges.filter(
-		(r) => opts.include.some((re) => re.test(r.file)) && !opts.exclude.some((re) => re.test(r.file)),
+		(r) => opts.include.some((re) => re.test(r.file)) && opts.exclude.some(re => re.test(r.file)),
 	);
 }
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] BlockStatement
src/diff-ranges.ts:79:63
  * abut after filtering, and collapsing them keeps the `--mutate` argument short
  * enough to stay under argv limits on a large diff.
  */
-export function mergeRanges(ranges: LineRange[]): LineRange[] {
-	const byFile = new Map<string, LineRange[]>();
-	for (const r of ranges) {
-		const list = byFile.get(r.file) ?? [];
-		list.push(r);
-		byFile.set(r.file, list);
-	}
-	const out: LineRange[] = [];
-	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
-		list.sort((a, b) => a.start - b.start);
-		let cur = { ...list[0] };
-		for (const r of list.slice(1)) {
-			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
-			if (r.start <= cur.end + 1) {
-				cur.end = Math.max(cur.end, r.end);
-			} else {
-				out.push(cur);
-				cur = { ...r };
-			}
-		}
-		out.push(cur);
-		void file;
-	}
-	return out;
-}
+export function mergeRanges(ranges: LineRange[]): LineRange[] {}
 
 /**
killedBy: test/mutate.test.ts
statusReason: skips when the diff touches no source lines: skips when the diff touches no source lines

[Killed] BlockStatement
src/diff-ranges.ts:81:26
  */
 export function mergeRanges(ranges: LineRange[]): LineRange[] {
 	const byFile = new Map<string, LineRange[]>();
-	for (const r of ranges) {
-		const list = byFile.get(r.file) ?? [];
-		list.push(r);
-		byFile.set(r.file, list);
-	}
+	for (const r of ranges) {}
 	const out: LineRange[] = [];
 	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] LogicalOperator
src/diff-ranges.ts:82:16
 export function mergeRanges(ranges: LineRange[]): LineRange[] {
 	const byFile = new Map<string, LineRange[]>();
 	for (const r of ranges) {
-		const list = byFile.get(r.file) ?? [];
+		const list = byFile.get(r.file) && [];
 		list.push(r);
 		byFile.set(r.file, list);
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ArrayDeclaration
src/diff-ranges.ts:82:38
 export function mergeRanges(ranges: LineRange[]): LineRange[] {
 	const byFile = new Map<string, LineRange[]>();
 	for (const r of ranges) {
-		const list = byFile.get(r.file) ?? [];
+		const list = byFile.get(r.file) ?? ["Stryker was here"];
 		list.push(r);
 		byFile.set(r.file, list);
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] CallExpression
src/diff-ranges.ts:83:3
 	const byFile = new Map<string, LineRange[]>();
 	for (const r of ranges) {
 		const list = byFile.get(r.file) ?? [];
-		list.push(r);
+		;
 		byFile.set(r.file, list);
 	}
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] CallExpression
src/diff-ranges.ts:84:3
 	for (const r of ranges) {
 		const list = byFile.get(r.file) ?? [];
 		list.push(r);
-		byFile.set(r.file, list);
+		;
 	}
 	const out: LineRange[] = [];
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] MethodExpression
src/diff-ranges.ts:87:29
 		byFile.set(r.file, list);
 	}
 	const out: LineRange[] = [];
-	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
+	for (const [file, list] of [...byFile.entries()]) {
 		list.sort((a, b) => a.start - b.start);
 		let cur = { ...list[0] };
killedBy: test/diff-ranges.test.ts
statusReason: merging keeps files independent: merging keeps files independent

[Killed] BlockStatement
src/diff-ranges.ts:87:93
 		byFile.set(r.file, list);
 	}
 	const out: LineRange[] = [];
-	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
-		list.sort((a, b) => a.start - b.start);
-		let cur = { ...list[0] };
-		for (const r of list.slice(1)) {
-			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
-			if (r.start <= cur.end + 1) {
-				cur.end = Math.max(cur.end, r.end);
-			} else {
-				out.push(cur);
-				cur = { ...r };
-			}
-		}
-		out.push(cur);
-		void file;
-	}
+	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {}
 	return out;
 }
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] MethodExpression
src/diff-ranges.ts:88:3
 	}
 	const out: LineRange[] = [];
 	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
-		list.sort((a, b) => a.start - b.start);
+		list;
 		let cur = { ...list[0] };
 		for (const r of list.slice(1)) {
killedBy: test/diff-ranges.test.ts
statusReason: ranges arriving out of order are sorted before merging: ranges arriving out of order are sorted before merging

[Killed] ArithmeticOperator
src/diff-ranges.ts:88:23
 	}
 	const out: LineRange[] = [];
 	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
-		list.sort((a, b) => a.start - b.start);
+		list.sort((a, b) => a.start + b.start);
 		let cur = { ...list[0] };
 		for (const r of list.slice(1)) {
killedBy: test/diff-ranges.test.ts
statusReason: ranges arriving out of order are sorted before merging: ranges arriving out of order are sorted before merging

[Killed] ObjectLiteral
src/diff-ranges.ts:89:13
 	const out: LineRange[] = [];
 	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
 		list.sort((a, b) => a.start - b.start);
-		let cur = { ...list[0] };
+		let cur = {};
 		for (const r of list.slice(1)) {
 			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] BlockStatement
src/diff-ranges.ts:90:34
 	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
 		list.sort((a, b) => a.start - b.start);
 		let cur = { ...list[0] };
-		for (const r of list.slice(1)) {
-			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
-			if (r.start <= cur.end + 1) {
-				cur.end = Math.max(cur.end, r.end);
-			} else {
-				out.push(cur);
-				cur = { ...r };
-			}
-		}
+		for (const r of list.slice(1)) {}
 		out.push(cur);
 		void file;
killedBy: test/mutate.test.ts
statusReason: computeRanges merges and filters end to end: computeRanges merges and filters end to end

[Survived] MethodExpression
src/diff-ranges.ts:90:19
 	for (const [file, list] of [...byFile.entries()].sort((a, b) => a[0].localeCompare(b[0]))) {
 		list.sort((a, b) => a.start - b.start);
 		let cur = { ...list[0] };
-		for (const r of list.slice(1)) {
+		for (const r of list) {
 			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
 			if (r.start <= cur.end + 1) {

[Killed] ConditionalExpression
src/diff-ranges.ts:92:8
 		let cur = { ...list[0] };
 		for (const r of list.slice(1)) {
 			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
-			if (r.start <= cur.end + 1) {
+			if (false) {
 				cur.end = Math.max(cur.end, r.end);
 			} else {
killedBy: test/mutate.test.ts
statusReason: computeRanges merges and filters end to end: computeRanges merges and filters end to end

[Killed] ArithmeticOperator
src/diff-ranges.ts:92:19
 		let cur = { ...list[0] };
 		for (const r of list.slice(1)) {
 			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
-			if (r.start <= cur.end + 1) {
+			if (r.start <= cur.end - 1) {
 				cur.end = Math.max(cur.end, r.end);
 			} else {
killedBy: test/mutate.test.ts
statusReason: computeRanges merges and filters end to end: computeRanges merges and filters end to end

[Killed] MethodExpression
src/diff-ranges.ts:93:15
 		for (const r of list.slice(1)) {
 			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
 			if (r.start <= cur.end + 1) {
-				cur.end = Math.max(cur.end, r.end);
+				cur.end = Math.min(cur.end, r.end);
 			} else {
 				out.push(cur);
killedBy: test/mutate.test.ts
statusReason: computeRanges merges and filters end to end: computeRanges merges and filters end to end

[Killed] BlockStatement
src/diff-ranges.ts:94:11
 			// `<= cur.end + 1` merges abutting ranges, not just overlapping ones.
 			if (r.start <= cur.end + 1) {
 				cur.end = Math.max(cur.end, r.end);
-			} else {
-				out.push(cur);
-				cur = { ...r };
-			}
+			} else {}
 		}
 		out.push(cur);
killedBy: test/diff-ranges.test.ts
statusReason: merges overlapping and abutting ranges, leaves separated ones alone: merges overlapping and abutting ranges, leaves separated ones alone

[Killed] CallExpression
src/diff-ranges.ts:95:5
 			if (r.start <= cur.end + 1) {
 				cur.end = Math.max(cur.end, r.end);
 			} else {
-				out.push(cur);
+				;
 				cur = { ...r };
 			}
killedBy: test/diff-ranges.test.ts
statusReason: merges overlapping and abutting ranges, leaves separated ones alone: merges overlapping and abutting ranges, leaves separated ones alone

[Killed] ObjectLiteral
src/diff-ranges.ts:96:11
 				cur.end = Math.max(cur.end, r.end);
 			} else {
 				out.push(cur);
-				cur = { ...r };
+				cur = {};
 			}
 		}
killedBy: test/diff-ranges.test.ts
statusReason: merges overlapping and abutting ranges, leaves separated ones alone: merges overlapping and abutting ranges, leaves separated ones alone

[Killed] CallExpression
src/diff-ranges.ts:99:3
 				cur = { ...r };
 			}
 		}
-		out.push(cur);
+		;
 		void file;
 	}
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] BlockStatement
src/diff-ranges.ts:109:68
  * Stryker's mutation-range syntax: `file:startLine:startCol-endLine:endCol`.
  * Column 1 to column 1 of the following line covers a whole line inclusively.
  */
-export function toStrykerMutateArgs(ranges: LineRange[]): string[] {
-	return ranges.map((r) => `${r.file}:${r.start}:1-${r.end + 1}:1`);
-}
+export function toStrykerMutateArgs(ranges: LineRange[]): string[] {}
 
 /** Total lines covered, for the size cap that decides whether to run at all. */
killedBy: test/mutate.test.ts
statusReason: an untracked source file is scoped in full — git diff cannot see it: an untracked source file is scoped in full — git diff cannot see it

[Killed] ArrowFunction
src/diff-ranges.ts:110:20
  * Column 1 to column 1 of the following line covers a whole line inclusively.
  */
 export function toStrykerMutateArgs(ranges: LineRange[]): string[] {
-	return ranges.map((r) => `${r.file}:${r.start}:1-${r.end + 1}:1`);
+	return ranges.map(() => undefined);
 }
 
killedBy: test/mutate.test.ts
statusReason: an untracked source file is scoped in full — git diff cannot see it: an untracked source file is scoped in full — git diff cannot see it

[Killed] ArithmeticOperator
src/diff-ranges.ts:110:53
  * Column 1 to column 1 of the following line covers a whole line inclusively.
  */
 export function toStrykerMutateArgs(ranges: LineRange[]): string[] {
-	return ranges.map((r) => `${r.file}:${r.start}:1-${r.end + 1}:1`);
+	return ranges.map((r) => `${r.file}:${r.start}:1-${r.end - 1}:1`);
 }
 
killedBy: test/mutate.test.ts
statusReason: an untracked source file is scoped in full — git diff cannot see it: an untracked source file is scoped in full — git diff cannot see it

[Killed] BlockStatement
src/diff-ranges.ts:114:57
 }
 
 /** Total lines covered, for the size cap that decides whether to run at all. */
-export function countLines(ranges: LineRange[]): number {
-	return ranges.reduce((sum, r) => sum + (r.end - r.start + 1), 0);
-}
+export function countLines(ranges: LineRange[]): number {}
 
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ArithmeticOperator
src/diff-ranges.ts:115:35
 
 /** Total lines covered, for the size cap that decides whether to run at all. */
 export function countLines(ranges: LineRange[]): number {
-	return ranges.reduce((sum, r) => sum + (r.end - r.start + 1), 0);
+	return ranges.reduce((sum, r) => sum - (r.end - r.start + 1), 0);
 }
 
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything

[Killed] ArithmeticOperator
src/diff-ranges.ts:115:42
 
 /** Total lines covered, for the size cap that decides whether to run at all. */
 export function countLines(ranges: LineRange[]): number {
-	return ranges.reduce((sum, r) => sum + (r.end - r.start + 1), 0);
+	return ranges.reduce((sum, r) => sum + (r.end + r.start + 1), 0);
 }
 
killedBy: test/mutate.test.ts
statusReason: skips an oversize diff without running anything: skips an oversize diff without running anything
