[Survived] BlockStatement
src/pricing.ts:30:49
 /** provider/id → list price, e.g. "openai-codex/gpt-5.6-terra". */
 export type PriceTable = Map<string, ModelPrice>;
 
-export function defaultPriceTablePath(): string {
-	return join(homedir(), ".pi", "agent", "models-store.json");
-}
+export function defaultPriceTablePath(): string {}
 
 /**

[Killed] BlockStatement
src/pricing.ts:41:49
  * next to a metered pi phase. Same file shape as pi's registry, so one parser serves
  * both.
  */
-export function bundledPriceTablePath(): string {
-	return join(dirname(fileURLToPath(import.meta.url)), "prices", "anthropic.json");
-}
+export function bundledPriceTablePath(): string {}
 
 /**
killedBy: test/pricing.test.ts
statusReason: the bundled table prices the models Claude Code actually reports: the bundled table prices the models Claude Code actually reports

[Killed] BlockStatement
src/pricing.ts:54:59
  * exactly*. Merging the bundle underneath a table someone deliberately pointed us at
  * would price models they left out on purpose.
  */
-export function loadPriceTable(path?: string): PriceTable {
-	const override = path ?? process.env.CRAFT_METRICS_PRICES;
-	if (override) return readPriceFile(override);
-	return mergePriceTables(readPriceFile(bundledPriceTablePath()), readPriceFile(defaultPriceTablePath()));
-}
+export function loadPriceTable(path?: string): PriceTable {}
 
 /** `over` wins on collision. Neither input is mutated. */
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] LogicalOperator
src/pricing.ts:55:19
  * would price models they left out on purpose.
  */
 export function loadPriceTable(path?: string): PriceTable {
-	const override = path ?? process.env.CRAFT_METRICS_PRICES;
+	const override = path && process.env.CRAFT_METRICS_PRICES;
 	if (override) return readPriceFile(override);
 	return mergePriceTables(readPriceFile(bundledPriceTablePath()), readPriceFile(defaultPriceTablePath()));
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] ConditionalExpression
src/pricing.ts:56:6
  */
 export function loadPriceTable(path?: string): PriceTable {
 	const override = path ?? process.env.CRAFT_METRICS_PRICES;
-	if (override) return readPriceFile(override);
+	if (false) return readPriceFile(override);
 	return mergePriceTables(readPriceFile(bundledPriceTablePath()), readPriceFile(defaultPriceTablePath()));
 }
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] ConditionalExpression
src/pricing.ts:56:6
  */
 export function loadPriceTable(path?: string): PriceTable {
 	const override = path ?? process.env.CRAFT_METRICS_PRICES;
-	if (override) return readPriceFile(override);
+	if (true) return readPriceFile(override);
 	return mergePriceTables(readPriceFile(bundledPriceTablePath()), readPriceFile(defaultPriceTablePath()));
 }
killedBy: test/pricing.test.ts
statusReason: the default resolution prices Anthropic models even when the host registry lists none: the default resolution prices Anthropic models even when the host registry lists none

[Killed] BlockStatement
src/pricing.ts:61:82
 }
 
 /** `over` wins on collision. Neither input is mutated. */
-export function mergePriceTables(base: PriceTable, over: PriceTable): PriceTable {
-	const merged: PriceTable = new Map(base);
-	for (const [model, price] of over) merged.set(model, price);
-	return merged;
-}
+export function mergePriceTables(base: PriceTable, over: PriceTable): PriceTable {}
 
 /**
killedBy: test/pricing.test.ts
statusReason: the host's registry wins over the bundled price for the same model: the host's registry wins over the bundled price for the same model

[Killed] CallExpression
src/pricing.ts:63:37
 /** `over` wins on collision. Neither input is mutated. */
 export function mergePriceTables(base: PriceTable, over: PriceTable): PriceTable {
 	const merged: PriceTable = new Map(base);
-	for (const [model, price] of over) merged.set(model, price);
+	for (const [model, price] of over) ;
 	return merged;
 }
killedBy: test/pricing.test.ts
statusReason: the host's registry wins over the bundled price for the same model: the host's registry wins over the bundled price for the same model

[Killed] BlockStatement
src/pricing.ts:77:6
 function readPriceFile(path: string): PriceTable {
 	const table: PriceTable = new Map();
 	let raw: string;
-	try {
-		raw = readFileSync(path, "utf8");
-	} catch {
+	try {} catch {
 		return table;
 	}
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Survived] BlockStatement
src/pricing.ts:79:10
 	let raw: string;
 	try {
 		raw = readFileSync(path, "utf8");
-	} catch {
-		return table;
-	}
+	} catch {}
 	let parsed: unknown;
 	try {

[Killed] BlockStatement
src/pricing.ts:83:6
 		return table;
 	}
 	let parsed: unknown;
-	try {
-		parsed = JSON.parse(raw);
-	} catch {
+	try {} catch {
 		return table;
 	}
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Survived] BlockStatement
src/pricing.ts:85:10
 	let parsed: unknown;
 	try {
 		parsed = JSON.parse(raw);
-	} catch {
-		return table;
-	}
+	} catch {}
 	if (!parsed || typeof parsed !== "object") return table;
 	for (const [provider, entry] of Object.entries(parsed as Record<string, unknown>)) {

[Killed] EqualityOperator
src/pricing.ts:88:17
 	} catch {
 		return table;
 	}
-	if (!parsed || typeof parsed !== "object") return table;
+	if (!parsed || typeof parsed === "object") return table;
 	for (const [provider, entry] of Object.entries(parsed as Record<string, unknown>)) {
 		const models = (entry as { models?: unknown[] } | null)?.models;
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] ConditionalExpression
src/pricing.ts:88:6
 	} catch {
 		return table;
 	}
-	if (!parsed || typeof parsed !== "object") return table;
+	if (true) return table;
 	for (const [provider, entry] of Object.entries(parsed as Record<string, unknown>)) {
 		const models = (entry as { models?: unknown[] } | null)?.models;
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] BlockStatement
src/pricing.ts:89:85
 		return table;
 	}
 	if (!parsed || typeof parsed !== "object") return table;
-	for (const [provider, entry] of Object.entries(parsed as Record<string, unknown>)) {
-		const models = (entry as { models?: unknown[] } | null)?.models;
-		if (!Array.isArray(models)) continue;
-		for (const m of models) {
-			const model = m as { id?: unknown; cost?: Record<string, unknown> } | null;
-			if (!model?.id || typeof model.id !== "string" || !model.cost) continue;
-			const c = model.cost;
-			table.set(`${provider}/${model.id}`, {
-				input: Number(c.input) || 0,
-				output: Number(c.output) || 0,
-				cacheRead: Number(c.cacheRead) || 0,
-				cacheWrite: Number(c.cacheWrite) || 0,
-			});
-		}
-	}
+	for (const [provider, entry] of Object.entries(parsed as Record<string, unknown>)) {}
 	return table;
 }
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Survived] OptionalChaining
src/pricing.ts:90:18
 	}
 	if (!parsed || typeof parsed !== "object") return table;
 	for (const [provider, entry] of Object.entries(parsed as Record<string, unknown>)) {
-		const models = (entry as { models?: unknown[] } | null)?.models;
+		const models = (entry as {
+  models?: unknown[];
+} | null).models;
 		if (!Array.isArray(models)) continue;
 		for (const m of models) {

[Killed] BooleanLiteral
src/pricing.ts:91:7
 	if (!parsed || typeof parsed !== "object") return table;
 	for (const [provider, entry] of Object.entries(parsed as Record<string, unknown>)) {
 		const models = (entry as { models?: unknown[] } | null)?.models;
-		if (!Array.isArray(models)) continue;
+		if (Array.isArray(models)) continue;
 		for (const m of models) {
 			const model = m as { id?: unknown; cost?: Record<string, unknown> } | null;
killedBy: test/store.test.ts
statusReason: concurrent appends from two stores do not clobber: concurrent appends from two stores do not clobber

[Killed] ConditionalExpression
src/pricing.ts:91:7
 	if (!parsed || typeof parsed !== "object") return table;
 	for (const [provider, entry] of Object.entries(parsed as Record<string, unknown>)) {
 		const models = (entry as { models?: unknown[] } | null)?.models;
-		if (!Array.isArray(models)) continue;
+		if (false) continue;
 		for (const m of models) {
 			const model = m as { id?: unknown; cost?: Record<string, unknown> } | null;
killedBy: test/store.test.ts
statusReason: concurrent appends from two stores do not clobber: concurrent appends from two stores do not clobber

[Killed] BlockStatement
src/pricing.ts:92:27
 	for (const [provider, entry] of Object.entries(parsed as Record<string, unknown>)) {
 		const models = (entry as { models?: unknown[] } | null)?.models;
 		if (!Array.isArray(models)) continue;
-		for (const m of models) {
-			const model = m as { id?: unknown; cost?: Record<string, unknown> } | null;
-			if (!model?.id || typeof model.id !== "string" || !model.cost) continue;
-			const c = model.cost;
-			table.set(`${provider}/${model.id}`, {
-				input: Number(c.input) || 0,
-				output: Number(c.output) || 0,
-				cacheRead: Number(c.cacheRead) || 0,
-				cacheWrite: Number(c.cacheWrite) || 0,
-			});
-		}
+		for (const m of models) {}
 	}
 	return table;
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] BooleanLiteral
src/pricing.ts:94:54
 		if (!Array.isArray(models)) continue;
 		for (const m of models) {
 			const model = m as { id?: unknown; cost?: Record<string, unknown> } | null;
-			if (!model?.id || typeof model.id !== "string" || !model.cost) continue;
+			if (!model?.id || typeof model.id !== "string" || model.cost) continue;
 			const c = model.cost;
 			table.set(`${provider}/${model.id}`, {
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] BooleanLiteral
src/pricing.ts:94:8
 		if (!Array.isArray(models)) continue;
 		for (const m of models) {
 			const model = m as { id?: unknown; cost?: Record<string, unknown> } | null;
-			if (!model?.id || typeof model.id !== "string" || !model.cost) continue;
+			if (model?.id || typeof model.id !== "string" || !model.cost) continue;
 			const c = model.cost;
 			table.set(`${provider}/${model.id}`, {
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] StringLiteral
src/pricing.ts:96:14
 			const model = m as { id?: unknown; cost?: Record<string, unknown> } | null;
 			if (!model?.id || typeof model.id !== "string" || !model.cost) continue;
 			const c = model.cost;
-			table.set(`${provider}/${model.id}`, {
+			table.set(``, {
 				input: Number(c.input) || 0,
 				output: Number(c.output) || 0,
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] ConditionalExpression
src/pricing.ts:97:12
 			if (!model?.id || typeof model.id !== "string" || !model.cost) continue;
 			const c = model.cost;
 			table.set(`${provider}/${model.id}`, {
-				input: Number(c.input) || 0,
+				input: true,
 				output: Number(c.output) || 0,
 				cacheRead: Number(c.cacheRead) || 0,
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] LogicalOperator
src/pricing.ts:97:12
 			if (!model?.id || typeof model.id !== "string" || !model.cost) continue;
 			const c = model.cost;
 			table.set(`${provider}/${model.id}`, {
-				input: Number(c.input) || 0,
+				input: Number(c.input) && 0,
 				output: Number(c.output) || 0,
 				cacheRead: Number(c.cacheRead) || 0,
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] ConditionalExpression
src/pricing.ts:98:13
 			const c = model.cost;
 			table.set(`${provider}/${model.id}`, {
 				input: Number(c.input) || 0,
-				output: Number(c.output) || 0,
+				output: false,
 				cacheRead: Number(c.cacheRead) || 0,
 				cacheWrite: Number(c.cacheWrite) || 0,
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] LogicalOperator
src/pricing.ts:98:13
 			const c = model.cost;
 			table.set(`${provider}/${model.id}`, {
 				input: Number(c.input) || 0,
-				output: Number(c.output) || 0,
+				output: Number(c.output) && 0,
 				cacheRead: Number(c.cacheRead) || 0,
 				cacheWrite: Number(c.cacheWrite) || 0,
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] LogicalOperator
src/pricing.ts:99:16
 			table.set(`${provider}/${model.id}`, {
 				input: Number(c.input) || 0,
 				output: Number(c.output) || 0,
-				cacheRead: Number(c.cacheRead) || 0,
+				cacheRead: Number(c.cacheRead) && 0,
 				cacheWrite: Number(c.cacheWrite) || 0,
 			});
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] ConditionalExpression
src/pricing.ts:99:16
 			table.set(`${provider}/${model.id}`, {
 				input: Number(c.input) || 0,
 				output: Number(c.output) || 0,
-				cacheRead: Number(c.cacheRead) || 0,
+				cacheRead: false,
 				cacheWrite: Number(c.cacheWrite) || 0,
 			});
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] ConditionalExpression
src/pricing.ts:100:17
 				input: Number(c.input) || 0,
 				output: Number(c.output) || 0,
 				cacheRead: Number(c.cacheRead) || 0,
-				cacheWrite: Number(c.cacheWrite) || 0,
+				cacheWrite: true,
 			});
 		}
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] ConditionalExpression
src/pricing.ts:100:17
 				input: Number(c.input) || 0,
 				output: Number(c.output) || 0,
 				cacheRead: Number(c.cacheRead) || 0,
-				cacheWrite: Number(c.cacheWrite) || 0,
+				cacheWrite: false,
 			});
 		}
killedBy: test/pricing.test.ts
statusReason: loadPriceTable parses provider/id from the models-store.json shape: loadPriceTable parses provider/id from the models-store.json shape

[Killed] BlockStatement
src/pricing.ts:122:82
  * even for a fully metered model — that is expected, not a bug. `cost_usd` is what
  * was billed at the time; notional is what the same tokens would cost today.
  */
-export function notionalCostForTokens(price: ModelPrice, tokens: Tokens): number {
-	return (
-		(tokens.input * price.input +
-			tokens.output * price.output +
-			tokens.cacheRead * price.cacheRead +
-			tokens.cacheWrite * price.cacheWrite) /
-		1e6
-	);
-}
+export function notionalCostForTokens(price: ModelPrice, tokens: Tokens): number {}
 
 /**
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] ArithmeticOperator
src/pricing.ts:124:3
  */
 export function notionalCostForTokens(price: ModelPrice, tokens: Tokens): number {
 	return (
-		(tokens.input * price.input +
-			tokens.output * price.output +
-			tokens.cacheRead * price.cacheRead +
-			tokens.cacheWrite * price.cacheWrite) /
-		1e6
+		(tokens.input * price.input + tokens.output * price.output + tokens.cacheRead * price.cacheRead + tokens.cacheWrite * price.cacheWrite) * 1e6
 	);
 }
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] ArithmeticOperator
src/pricing.ts:124:4
  */
 export function notionalCostForTokens(price: ModelPrice, tokens: Tokens): number {
 	return (
-		(tokens.input * price.input +
-			tokens.output * price.output +
+		(tokens.input * price.input - tokens.output * price.output +
 			tokens.cacheRead * price.cacheRead +
 			tokens.cacheWrite * price.cacheWrite) /
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] ArithmeticOperator
src/pricing.ts:125:4
 export function notionalCostForTokens(price: ModelPrice, tokens: Tokens): number {
 	return (
 		(tokens.input * price.input +
-			tokens.output * price.output +
+			tokens.output / price.output +
 			tokens.cacheRead * price.cacheRead +
 			tokens.cacheWrite * price.cacheWrite) /
killedBy: test/store-format.test.ts
statusReason: a subscription phase shows its notional value beside a $0 actual: a subscription phase shows its notional value beside a $0 actual

[Killed] ArithmeticOperator
src/pricing.ts:126:4
 	return (
 		(tokens.input * price.input +
 			tokens.output * price.output +
-			tokens.cacheRead * price.cacheRead +
+			tokens.cacheRead / price.cacheRead +
 			tokens.cacheWrite * price.cacheWrite) /
 		1e6
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] ArithmeticOperator
src/pricing.ts:127:4
 		(tokens.input * price.input +
 			tokens.output * price.output +
 			tokens.cacheRead * price.cacheRead +
-			tokens.cacheWrite * price.cacheWrite) /
+			tokens.cacheWrite / price.cacheWrite) /
 		1e6
 	);
killedBy: test/store.test.ts
statusReason: a metered model's notional equals its actual cost (no subscription gap): a metered model's notional equals its actual cost (no subscription gap)

[Killed] BlockStatement
src/pricing.ts:138:73
  * price correction re-prices every historical run on the next read, with no
  * migration and no event replay.
  */
-export function applyNotionalPricing(run: Run, table: PriceTable): void {
-	let runTotal = 0;
-	for (const phase of run.phases) {
-		runTotal += applyNotionalPricingToPhase(phase, table);
-	}
-	run.notional_cost_usd = runTotal;
-}
+export function applyNotionalPricing(run: Run, table: PriceTable): void {}
 
 function applyNotionalPricingToPhase(phase: PhaseRecord, table: PriceTable): number {
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] BlockStatement
src/pricing.ts:140:34
  */
 export function applyNotionalPricing(run: Run, table: PriceTable): void {
 	let runTotal = 0;
-	for (const phase of run.phases) {
-		runTotal += applyNotionalPricingToPhase(phase, table);
-	}
+	for (const phase of run.phases) {}
 	run.notional_cost_usd = runTotal;
 }
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] AssignmentOperator
src/pricing.ts:141:3
 export function applyNotionalPricing(run: Run, table: PriceTable): void {
 	let runTotal = 0;
 	for (const phase of run.phases) {
-		runTotal += applyNotionalPricingToPhase(phase, table);
+		runTotal -= applyNotionalPricingToPhase(phase, table);
 	}
 	run.notional_cost_usd = runTotal;
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] BlockStatement
src/pricing.ts:146:85
 	run.notional_cost_usd = runTotal;
 }
 
-function applyNotionalPricingToPhase(phase: PhaseRecord, table: PriceTable): number {
-	let phaseTotal = 0;
-	for (const [model, spend] of Object.entries(phase.by_model)) {
-		const price = table.get(model);
-		// No price known: notional collapses to actual. Correct for metered models
-		// that are simply missing from the table, and the least-wrong fallback for
-		// anything else — it never fabricates a number the table cannot support.
-		const notional = price ? notionalCostForTokens(price, spend.tokens) : spend.cost_usd;
-		spend.notional_cost_usd = notional;
-		phaseTotal += notional;
-	}
-	phase.notional_cost_usd = phaseTotal;
-	return phaseTotal;
-}
+function applyNotionalPricingToPhase(phase: PhaseRecord, table: PriceTable): number {}
 
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] BlockStatement
src/pricing.ts:148:63
 
 function applyNotionalPricingToPhase(phase: PhaseRecord, table: PriceTable): number {
 	let phaseTotal = 0;
-	for (const [model, spend] of Object.entries(phase.by_model)) {
-		const price = table.get(model);
-		// No price known: notional collapses to actual. Correct for metered models
-		// that are simply missing from the table, and the least-wrong fallback for
-		// anything else — it never fabricates a number the table cannot support.
-		const notional = price ? notionalCostForTokens(price, spend.tokens) : spend.cost_usd;
-		spend.notional_cost_usd = notional;
-		phaseTotal += notional;
-	}
+	for (const [model, spend] of Object.entries(phase.by_model)) {}
 	phase.notional_cost_usd = phaseTotal;
 	return phaseTotal;
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced

[Killed] AssignmentOperator
src/pricing.ts:155:3
 		// anything else — it never fabricates a number the table cannot support.
 		const notional = price ? notionalCostForTokens(price, spend.tokens) : spend.cost_usd;
 		spend.notional_cost_usd = notional;
-		phaseTotal += notional;
+		phaseTotal -= notional;
 	}
 	phase.notional_cost_usd = phaseTotal;
killedBy: test/store.test.ts
statusReason: a priced model gets notional cost and is not flagged unpriced: a priced model gets notional cost and is not flagged unpriced
