[Killed] StringLiteral
src/schema.ts:14:76
 export type Kind = "feature" | "bugfix" | "refactor" | "scaffold" | "docs" | "chore";
 export type Outcome = "open" | "completed" | "aborted" | "blocked" | "hitl-paused";
 
-export const KINDS: Kind[] = ["feature", "bugfix", "refactor", "scaffold", "docs", "chore"];
+export const KINDS: Kind[] = ["feature", "bugfix", "refactor", "scaffold", "", "chore"];
 /**
  * `unknown` is accepted as a correction target on purpose: a run mislabelled `pi`
killedBy: test/cli.test.ts
statusReason: start records an explicit craft version: start records an explicit craft version

[Killed] StringLiteral
src/schema.ts:14:84
 export type Kind = "feature" | "bugfix" | "refactor" | "scaffold" | "docs" | "chore";
 export type Outcome = "open" | "completed" | "aborted" | "blocked" | "hitl-paused";
 
-export const KINDS: Kind[] = ["feature", "bugfix", "refactor", "scaffold", "docs", "chore"];
+export const KINDS: Kind[] = ["feature", "bugfix", "refactor", "scaffold", "docs", ""];
 /**
  * `unknown` is accepted as a correction target on purpose: a run mislabelled `pi`
killedBy: test/cli.test.ts
statusReason: every valid mode and kind is accepted: every valid mode and kind is accepted

[Killed] ArrayDeclaration
src/schema.ts:19:30
  * `unknown` is accepted as a correction target on purpose: a run mislabelled `pi`
  * that cannot be re-identified should be able to say so rather than keep a guess.
  */
-export const HOSTS: Host[] = ["pi", "claude-code", "unknown"];
+export const HOSTS: Host[] = [];
 export type PhaseName = "C" | "counsel" | "R" | "A" | "F" | "T" | "S" | "supervisor" | "unattributed";
 
killedBy: test/cli.test.ts
statusReason: totals headings name the harness, and host corrects a mislabelled run: totals headings name the harness, and host corrects a mislabelled run

[Killed] StringLiteral
src/schema.ts:19:37
  * `unknown` is accepted as a correction target on purpose: a run mislabelled `pi`
  * that cannot be re-identified should be able to say so rather than keep a guess.
  */
-export const HOSTS: Host[] = ["pi", "claude-code", "unknown"];
+export const HOSTS: Host[] = ["pi", "", "unknown"];
 export type PhaseName = "C" | "counsel" | "R" | "A" | "F" | "T" | "S" | "supervisor" | "unattributed";
 
killedBy: test/cli.test.ts
statusReason: totals headings name the harness, and host corrects a mislabelled run: totals headings name the harness, and host corrects a mislabelled run

[Killed] StringLiteral
src/schema.ts:22:42
 export const HOSTS: Host[] = ["pi", "claude-code", "unknown"];
 export type PhaseName = "C" | "counsel" | "R" | "A" | "F" | "T" | "S" | "supervisor" | "unattributed";
 
-export const PHASES: PhaseName[] = ["C", "counsel", "R", "A", "F", "T", "S", "supervisor", "unattributed"];
+export const PHASES: PhaseName[] = ["C", "", "R", "A", "F", "T", "S", "supervisor", "unattributed"];
 
 export const AGENT_PHASE: Record<string, PhaseName> = {
killedBy: test/cli.test.ts
statusReason: lite mode refuses a counsel phase, surfacing the store's guard as exit 2: lite mode refuses a counsel phase, surfacing the store's guard as exit 2

[Killed] StringLiteral
src/schema.ts:22:63
 export const HOSTS: Host[] = ["pi", "claude-code", "unknown"];
 export type PhaseName = "C" | "counsel" | "R" | "A" | "F" | "T" | "S" | "supervisor" | "unattributed";
 
-export const PHASES: PhaseName[] = ["C", "counsel", "R", "A", "F", "T", "S", "supervisor", "unattributed"];
+export const PHASES: PhaseName[] = ["C", "counsel", "R", "A", "", "T", "S", "supervisor", "unattributed"];
 
 export const AGENT_PHASE: Record<string, PhaseName> = {
killedBy: test/cli.test.ts
statusReason: every gateable phase is accepted by enter: every gateable phase is accepted by enter

[Survived] StringLiteral
src/schema.ts:27:19
 export const AGENT_PHASE: Record<string, PhaseName> = {
 	"craft-planner": "C",
 	"craft-counsel": "counsel",
-	"craft-builder": "R",
+	"craft-builder": "",
 	"craft-code-simplifier": "R",
 	"craft-evaluator": "A",

[Survived] StringLiteral
src/schema.ts:28:27
 	"craft-planner": "C",
 	"craft-counsel": "counsel",
 	"craft-builder": "R",
-	"craft-code-simplifier": "R",
+	"craft-code-simplifier": "",
 	"craft-evaluator": "A",
 	"craft-security-review": "T",

[Killed] StringLiteral
src/schema.ts:29:21
 	"craft-counsel": "counsel",
 	"craft-builder": "R",
 	"craft-code-simplifier": "R",
-	"craft-evaluator": "A",
+	"craft-evaluator": "",
 	"craft-security-review": "T",
 };
killedBy: test/store.test.ts
statusReason: named agent maps to phase when skill is late: named agent maps to phase when skill is late

[Killed] BlockStatement
src/schema.ts:228:39
 	mutants_survived?: number;
 }
 
-export function emptyTokens(): Tokens {
-	return { input: 0, output: 0, cacheRead: 0, cacheWrite: 0 };
-}
+export function emptyTokens(): Tokens {}
 
 export function emptyPhase(name: PhaseName): PhaseRecord {
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Survived] ArrayDeclaration
src/schema.ts:239:11
 		ended_at: null,
 		duration_ms: 0,
 		agents: [],
-		models: [],
+		models: ["Stryker was here"],
 		tokens: emptyTokens(),
 		cost_usd: 0,

[Killed] BlockStatement
src/schema.ts:260:37
 	};
 }
 
-export function emptySeams(): Seams {
-	return {
-		counsel_family_differs_from_c: null,
-		a_family_differs_from_r: null,
-		t_family_differs_from_r: null,
-	};
-}
+export function emptySeams(): Seams {}
 
 export function modelFamily(model?: string): string | null {
killedBy: test/store-format.test.ts
statusReason: an inferred version is marked, a declared one is not: an inferred version is marked, a declared one is not

[Survived] ObjectLiteral
src/schema.ts:261:9
 }
 
 export function emptySeams(): Seams {
-	return {
-		counsel_family_differs_from_c: null,
-		a_family_differs_from_r: null,
-		t_family_differs_from_r: null,
-	};
+	return {};
 }
 

[Killed] BlockStatement
src/schema.ts:268:60
 	};
 }
 
-export function modelFamily(model?: string): string | null {
-	if (!model) return null;
-	const i = model.indexOf("/");
-	return i === -1 ? model : model.slice(0, i);
-}
+export function modelFamily(model?: string): string | null {}
 
 export function familiesDiffer(a?: string[], b?: string[]): boolean | null {
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] ConditionalExpression
src/schema.ts:269:6
 }
 
 export function modelFamily(model?: string): string | null {
-	if (!model) return null;
+	if (true) return null;
 	const i = model.indexOf("/");
 	return i === -1 ? model : model.slice(0, i);
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] BooleanLiteral
src/schema.ts:269:6
 }
 
 export function modelFamily(model?: string): string | null {
-	if (!model) return null;
+	if (model) return null;
 	const i = model.indexOf("/");
 	return i === -1 ? model : model.slice(0, i);
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Survived] EqualityOperator
src/schema.ts:271:9
 export function modelFamily(model?: string): string | null {
 	if (!model) return null;
 	const i = model.indexOf("/");
-	return i === -1 ? model : model.slice(0, i);
+	return i !== -1 ? model : model.slice(0, i);
 }
 

[Survived] MethodExpression
src/schema.ts:271:28
 export function modelFamily(model?: string): string | null {
 	if (!model) return null;
 	const i = model.indexOf("/");
-	return i === -1 ? model : model.slice(0, i);
+	return i === -1 ? model : model;
 }
 

[Killed] BlockStatement
src/schema.ts:274:76
 	return i === -1 ? model : model.slice(0, i);
 }
 
-export function familiesDiffer(a?: string[], b?: string[]): boolean | null {
-	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
-	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
-	if (af.size === 0 || bf.size === 0) return null;
-	for (const f of bf) if (!af.has(f)) return true;
-	return false;
-}
+export function familiesDiffer(a?: string[], b?: string[]): boolean | null {}
 
 export function computeSeams(run: Run): Seams {
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] LogicalOperator
src/schema.ts:275:22
 }
 
 export function familiesDiffer(a?: string[], b?: string[]): boolean | null {
-	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
+	const af = new Set((a && []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	if (af.size === 0 || bf.size === 0) return null;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BooleanLiteral
src/schema.ts:275:85
 }
 
 export function familiesDiffer(a?: string[], b?: string[]): boolean | null {
-	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
+	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !x));
 	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	if (af.size === 0 || bf.size === 0) return null;
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] LogicalOperator
src/schema.ts:276:22
 
 export function familiesDiffer(a?: string[], b?: string[]): boolean | null {
 	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
-	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
+	const bf = new Set((b && []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	if (af.size === 0 || bf.size === 0) return null;
 	for (const f of bf) if (!af.has(f)) return true;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ArrowFunction
src/schema.ts:276:35
 
 export function familiesDiffer(a?: string[], b?: string[]): boolean | null {
 	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
-	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
+	const bf = new Set((b ?? []).map(() => undefined).filter((x): x is string => !!x));
 	if (af.size === 0 || bf.size === 0) return null;
 	for (const f of bf) if (!af.has(f)) return true;
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] LogicalOperator
src/schema.ts:277:6
 export function familiesDiffer(a?: string[], b?: string[]): boolean | null {
 	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
-	if (af.size === 0 || bf.size === 0) return null;
+	if (af.size === 0 && bf.size === 0) return null;
 	for (const f of bf) if (!af.has(f)) return true;
 	return false;
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] ConditionalExpression
src/schema.ts:277:23
 export function familiesDiffer(a?: string[], b?: string[]): boolean | null {
 	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
-	if (af.size === 0 || bf.size === 0) return null;
+	if (af.size === 0 || false) return null;
 	for (const f of bf) if (!af.has(f)) return true;
 	return false;
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] BooleanLiteral
src/schema.ts:278:45
 	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	if (af.size === 0 || bf.size === 0) return null;
-	for (const f of bf) if (!af.has(f)) return true;
+	for (const f of bf) if (!af.has(f)) return false;
 	return false;
 }
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] ConditionalExpression
src/schema.ts:278:26
 	const af = new Set((a ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	if (af.size === 0 || bf.size === 0) return null;
-	for (const f of bf) if (!af.has(f)) return true;
+	for (const f of bf) if (true) return true;
 	return false;
 }
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] BooleanLiteral
src/schema.ts:279:9
 	const bf = new Set((b ?? []).map((m) => modelFamily(m)).filter((x): x is string => !!x));
 	if (af.size === 0 || bf.size === 0) return null;
 	for (const f of bf) if (!af.has(f)) return true;
-	return false;
+	return true;
 }
 
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] BlockStatement
src/schema.ts:282:47
 	return false;
 }
 
-export function computeSeams(run: Run): Seams {
-	const byName = new Map(run.phases.map((p) => [p.name, p]));
-	const c = byName.get("C");
-	const counsel = byName.get("counsel");
-	const r = byName.get("R");
-	const a = byName.get("A");
-	const t = byName.get("T");
-	return {
-		counsel_family_differs_from_c: familiesDiffer(c?.models, counsel?.models),
-		a_family_differs_from_r: familiesDiffer(r?.models, a?.models),
-		t_family_differs_from_r: familiesDiffer(r?.models, t?.models),
-	};
-}
+export function computeSeams(run: Run): Seams {}
 
 export function phaseByName(run: Run, name: PhaseName): PhaseRecord {
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] ArrowFunction
src/schema.ts:283:40
 }
 
 export function computeSeams(run: Run): Seams {
-	const byName = new Map(run.phases.map((p) => [p.name, p]));
+	const byName = new Map(run.phases.map(() => undefined));
 	const c = byName.get("C");
 	const counsel = byName.get("counsel");
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ArrayDeclaration
src/schema.ts:283:47
 }
 
 export function computeSeams(run: Run): Seams {
-	const byName = new Map(run.phases.map((p) => [p.name, p]));
+	const byName = new Map(run.phases.map((p) => []));
 	const c = byName.get("C");
 	const counsel = byName.get("counsel");
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] StringLiteral
src/schema.ts:284:23
 
 export function computeSeams(run: Run): Seams {
 	const byName = new Map(run.phases.map((p) => [p.name, p]));
-	const c = byName.get("C");
+	const c = byName.get("");
 	const counsel = byName.get("counsel");
 	const r = byName.get("R");
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] StringLiteral
src/schema.ts:286:23
 	const byName = new Map(run.phases.map((p) => [p.name, p]));
 	const c = byName.get("C");
 	const counsel = byName.get("counsel");
-	const r = byName.get("R");
+	const r = byName.get("");
 	const a = byName.get("A");
 	const t = byName.get("T");
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] StringLiteral
src/schema.ts:287:23
 	const c = byName.get("C");
 	const counsel = byName.get("counsel");
 	const r = byName.get("R");
-	const a = byName.get("A");
+	const a = byName.get("");
 	const t = byName.get("T");
 	return {
killedBy: test/store.test.ts
statusReason: seams detect same-family collapse and cross-family pass: seams detect same-family collapse and cross-family pass

[Killed] OptionalChaining
src/schema.ts:290:49
 	const a = byName.get("A");
 	const t = byName.get("T");
 	return {
-		counsel_family_differs_from_c: familiesDiffer(c?.models, counsel?.models),
+		counsel_family_differs_from_c: familiesDiffer(c.models, counsel?.models),
 		a_family_differs_from_r: familiesDiffer(r?.models, a?.models),
 		t_family_differs_from_r: familiesDiffer(r?.models, t?.models),
killedBy: test/store.test.ts
statusReason: usage with no open phase and no agent is unattributed: usage with no open phase and no agent is unattributed

[Killed] OptionalChaining
src/schema.ts:290:60
 	const a = byName.get("A");
 	const t = byName.get("T");
 	return {
-		counsel_family_differs_from_c: familiesDiffer(c?.models, counsel?.models),
+		counsel_family_differs_from_c: familiesDiffer(c?.models, counsel.models),
 		a_family_differs_from_r: familiesDiffer(r?.models, a?.models),
 		t_family_differs_from_r: familiesDiffer(r?.models, t?.models),
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] OptionalChaining
src/schema.ts:291:43
 	const t = byName.get("T");
 	return {
 		counsel_family_differs_from_c: familiesDiffer(c?.models, counsel?.models),
-		a_family_differs_from_r: familiesDiffer(r?.models, a?.models),
+		a_family_differs_from_r: familiesDiffer(r.models, a?.models),
 		t_family_differs_from_r: familiesDiffer(r?.models, t?.models),
 	};
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] OptionalChaining
src/schema.ts:291:54
 	const t = byName.get("T");
 	return {
 		counsel_family_differs_from_c: familiesDiffer(c?.models, counsel?.models),
-		a_family_differs_from_r: familiesDiffer(r?.models, a?.models),
+		a_family_differs_from_r: familiesDiffer(r?.models, a.models),
 		t_family_differs_from_r: familiesDiffer(r?.models, t?.models),
 	};
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] OptionalChaining
src/schema.ts:292:54
 	return {
 		counsel_family_differs_from_c: familiesDiffer(c?.models, counsel?.models),
 		a_family_differs_from_r: familiesDiffer(r?.models, a?.models),
-		t_family_differs_from_r: familiesDiffer(r?.models, t?.models),
+		t_family_differs_from_r: familiesDiffer(r?.models, t.models),
 	};
 }
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] OptionalChaining
src/schema.ts:292:43
 	return {
 		counsel_family_differs_from_c: familiesDiffer(c?.models, counsel?.models),
 		a_family_differs_from_r: familiesDiffer(r?.models, a?.models),
-		t_family_differs_from_r: familiesDiffer(r?.models, t?.models),
+		t_family_differs_from_r: familiesDiffer(r.models, t?.models),
 	};
 }
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BlockStatement
src/schema.ts:296:69
 	};
 }
 
-export function phaseByName(run: Run, name: PhaseName): PhaseRecord {
-	let p = run.phases.find((x) => x.name === name);
-	if (!p) {
-		p = emptyPhase(name);
-		run.phases.push(p);
-	}
-	return p;
-}
+export function phaseByName(run: Run, name: PhaseName): PhaseRecord {}
 
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ArrowFunction
src/schema.ts:297:26
 }
 
 export function phaseByName(run: Run, name: PhaseName): PhaseRecord {
-	let p = run.phases.find((x) => x.name === name);
+	let p = run.phases.find(() => undefined);
 	if (!p) {
 		p = emptyPhase(name);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/schema.ts:297:33
 }
 
 export function phaseByName(run: Run, name: PhaseName): PhaseRecord {
-	let p = run.phases.find((x) => x.name === name);
+	let p = run.phases.find((x) => false);
 	if (!p) {
 		p = emptyPhase(name);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] BooleanLiteral
src/schema.ts:298:6
 
 export function phaseByName(run: Run, name: PhaseName): PhaseRecord {
 	let p = run.phases.find((x) => x.name === name);
-	if (!p) {
+	if (p) {
 		p = emptyPhase(name);
 		run.phases.push(p);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] ConditionalExpression
src/schema.ts:298:6
 
 export function phaseByName(run: Run, name: PhaseName): PhaseRecord {
 	let p = run.phases.find((x) => x.name === name);
-	if (!p) {
+	if (true) {
 		p = emptyPhase(name);
 		run.phases.push(p);
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase

[Killed] CallExpression
src/schema.ts:300:3
 	let p = run.phases.find((x) => x.name === name);
 	if (!p) {
 		p = emptyPhase(name);
-		run.phases.push(p);
+		;
 	}
 	return p;
killedBy: test/store.test.ts
statusReason: usage between enter/exit lands on that phase: usage between enter/exit lands on that phase
